{
  "id": "6C2W1azD1rBstXsTYKbKD6s7moV2j5fAvRyReoWWQxyDnqD8vREGhkX",
  "title": "The Week in Chess",
  "displayTitle": "Week in Chess",
  "url": "https://theweekinchess.com/twic-rss-feed",
  "feedLink": "https://theweekinchess.com/",
  "isQuery": false,
  "isEmpty": false,
  "isHidden": false,
  "itemCount": 4,
  "items": [
    {
      "title": "88th Tata Steel 2026 - Games and Results",
      "url": "https://theweekinchess.com/chessnews/events/88th-tata-steel-2026",
      "date": 1768523340,
      "author": "Mark Crowther",
      "guid": 36159,
      "unread": true,
      "content": " The 88th Tata Steel Chess tournament takes place in Wijk aan Zee Fri 16th Jan to Sun 1st Feb 2026. \nPlayers: Masters: Yagiz Kaan Erdogmus, Aravindh Chithambaram, Hans Niemann, Vincent Keymer, Javokhir Sindarov, Jorden van Foreest, Arjun Erigaisi, Praggnanandhaa Rameshbabu, Van Nguyen Thai Dai, Gukesh Dommaraju, Anish Giri, Vladimir Fedoseev, Matthias Bluebaum and Nodirbek Abdusattorov.\n<p>\nChallengers: Vasyl Ivanchuk, Marc Andria Maurizzi, Velimir Ivic, Erwin l'Ami, Bibisara Assaubayeva, Eline Roebers, Miaoyi Lu, Max Warmerdam, Panesar Vedant, Andy Woodward, Aydin Suleymanli, Faustino Oro, Daniil Yuffa and Carissa Yip. </p>",
      "contentLength": 625,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Tata Steel India Rapid & Blitz 2026 - Games and Results",
      "url": "https://theweekinchess.com/chessnews/events/tata-steel-india-rapid-blitz-2026",
      "date": 1768149240,
      "author": "Mark Crowther",
      "guid": 36158,
      "unread": true,
      "content": " The Tata Steel India Rapid &amp; Blitz took place Wed 7th Jan to Mon 12th Jan 2026. <p>Players: Viswanathan Anand, Wei Yi, Chithambaram Aravindh, Arjun Erigaisi, Hans Moke Niemann, Volodar Murzin, Gujrathi Vidit Santosh, R Praggnanandhaa, Nihal Sarin, Wesley So, \n</p><p>\nWomen: Ravi Rakshitta, Carissa Yip, Deshmukh Divya, Nana Dzagnidze, Agrawal Vantika, Rameshbabu Vaishali, Kateryna Lagno, Harika Dronavalli, Stavroula Tsolakidou, Aleksandra Goryachkina.\n</p><p>\nThe Rapid was won by Nihal Sarin with 6.5/9, half a point clear of Viswanathan Anand, the women's rapid was won by Kateryna Lagno with 6.5/9 a point and a half clear of Aleksandra Goryachkina. The Blitz was won by Wesley So with 12/18 a point clear of Nihal Sarin and Arjun Erigaisi. The women's event was won by Carissa Yip after winning the first game of a two game tie-break against Agrawal Vantika, they had tied on 10.5/18 half a point clear of Stavroula Tsolakidou. </p>",
      "contentLength": 919,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "World Rapid and Blitz Championships 2025 - Games and Results",
      "url": "https://theweekinchess.com/chessnews/events/world-rapid-and-blitz-championships-2025",
      "date": 1767141300,
      "author": "Mark Crowther",
      "guid": 36157,
      "unread": true,
      "content": " The World Rapid and Blitz Championships took place Fri 26th Dec to Tue 30th Dec 2025 in Doha, Qatar.\n<p>Players: Magnus Carlsen, Ian Nepomniachtchi, Levon Aronian, Alireza Firouzja, Fabiano Caruana, Maxime Vachier-Lagrave, Vladislav Artemiev, Nodirbek Abdusattorov, Arjun Erigaisi, Jan Krzysztof Duda, Shakhriyar Mamedyarov, Javokhir Sindarov, Leinier Dominguez Perez, Richard Rapport, Wesley So, D Gukesh, Daniil Dubov, Anish Giri, Yangyi Yu, Alexander Grischuk, Dmitry Andreikin, Parham Maghsoodloo, Jaime Santos Latasa, Sarin Nihal, Praggnanandhaa, Teimour Radjabov, Sam Sevian, Radoslaw Wojtaszek, Ray Robson, Andrey Esipenko etc </p><p>Women Players: Ju Wenjun, Tan Zhongyi, Aleksandra Goryachkina, Tingjie Lei, Bibisara Assaubayeva, Kateryna Lagno, Alexandra Kosteniuk, Humpy Koneru, Harika Dronavalli, Zhu Jiner, Nana Dzagnidze, Mariya Muzychuk, Deshmukh Divya, Anna Muzychuk, Meruert Kamalidenova, Eline Roebers, Irina Bulmaga, Antoaneta Stefanova, Yuxin Song, Bella Khotenashvili etc  </p><p>Magnus Carlsen won both the Rapid and the Blitz, a double he completed for the fifth time.\nAleksandra Goryachkina beat Zhu Jiner in a tie-break match to with the rapid, Humpy Koneru also\nscored 8.5/11 but missed out on the chance to play off due to a worse technical tie-break.\n\nBibisara Assaubayeva won the women's blitz and also took the final qualification place for the Women's Candidates.</p>",
      "contentLength": 1378,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Magnus Carlsen completes a World Championship Rapid and Blitz double for the fifth time -",
      "url": "https://theweekinchess.com/twic-news-feed/magnus-carlsen-completes-a-world-championship-rapid-and-blitz-double-for-the-fifth-time",
      "date": 1767140760,
      "author": "Mark Crowther",
      "guid": 36156,
      "unread": true,
      "content": " Magnus Carlsen won the <a href=\"https://theweekinchess.com/chessnews/events/world-rapid-and-blitz-championships-2025\">2025 FIDE World Blitz Championship</a> to go along with the rapid title he had\nalready won. This was Carlsen's ninth blitz title and the fifth time he did the rapid/blitz double, along with his\nfive World Championship matches this adds up to a total of 20 World titles won. Carlsen called the blitz title hard-earned \nas he had to recover several times from upsetting losses.\n<p>\nIn the women's event Bibisara Assaubayeva emerged victorious and with that win she\nearned the final Women's Candidates place. \n</p>",
      "contentLength": 524,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    }
  ],
  "tags": [
    "chess"
  ]
}