{
  "id": "6C2W1azD1rBstXsTYKbKD6s7moV2j5fAvRyReoWWQxyDnqD8vREGhkX",
  "title": "The Week in Chess",
  "displayTitle": "Week in Chess",
  "url": "https://theweekinchess.com/twic-rss-feed",
  "feedLink": "https://theweekinchess.com/",
  "isQuery": false,
  "isEmpty": false,
  "isHidden": false,
  "itemCount": 3,
  "items": [
    {
      "title": "Jan Timman 1951-2026 - 1951-2026",
      "url": "https://theweekinchess.com/twic-news-feed/jan-timman-1951-2026",
      "date": 1771512120,
      "author": "Mark Crowther",
      "guid": 46463,
      "unread": true,
      "content": "<article> Jan Timman, the Dutch number one chess player for many years and World number two in January 1982, has passed away at the age of 74.\nTimman first qualified for an Interzonal in 1979 and was a Candidate between the years of 1986 and 1996. \nHe fought a 24 game match for the FIDE World Chess Championship against Anatoly Karpov in 1993. His most impressive tournament win was the 1991 Immopar Rapid in Paris, this was a knockout where he beat Gata Kamsky, \nAnatoly Karpov, Viswanathan Anand, and Garry Kasparov. Timman was a very successful tournament player, especially\nin the 1980s and his career results are more than comparable with the legendary Bent Larsen. \nTimman had a Universal and varied style and at his best his games were of the very highest quality. He noted\nin his book Timman's Triumphs that there were frequently errors in conversion of advantages, even in his best games, and also noted too many dubious positions with black, these were the key downsides to his play.\nThat games collection was just one of his many excellent books, he was also a renowned \nstudy composer. His last games were in the Dutch Championship in July 2024 where he lost to\nErwin L'Ami in the first round of this knockout tournament. He announced that he was retired from over the\nboard play in May 2025.\n</article>",
      "contentLength": 1297,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "FIDE Freestyle Chess World Championship 2026 - Games and Results",
      "url": "https://theweekinchess.com/chessnews/events/fide-freestyle-chess-world-championship-2026",
      "date": 1771018020,
      "author": "Mark Crowther",
      "guid": 44868,
      "unread": true,
      "content": " The FIDE Freestyle Chess World Championship took place in Wangels, Germany, Fri 13th Feb to Sun 15th Feb 2026. Time control 10m+5spm. Round Robin followed by KO. Carlsen won the all-play-all with 4.5/7 half a point clear of Caruana, Keymer and Abdusattorov and they played for the title over the weekend. Aronian, Erigaisi, Niemann and Sindarov played off for the minor placings.<p>Magnus Carlsen beat Fabiano Caruana 2.5-1.5 in the final to win the title, he won game three. </p><p>The games are available for download but I can't display them.</p>",
      "contentLength": 536,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "chess.com Speed Chess Final 2025 - Games and Results",
      "url": "https://theweekinchess.com/chessnews/events/chess.com-speed-chess-final-2025",
      "date": 1770589620,
      "author": "Mark Crowther",
      "guid": 43199,
      "unread": true,
      "content": "<article> chess.com Speed Chess Final 2025 took place in person in London 7th to 8th February 2026. The was hosted by Chess.com's server. Magnus Carlsen won the event by defeating Denis Lazavik in the semifinals and Alireza Firouzja in the final. Lazavik beat Hikaru Nakamura to 3rd place.</article>",
      "contentLength": 280,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    }
  ],
  "tags": [
    "chess"
  ]
}