{
  "id": "6C2W1azD1rBstXsTYKbKD6s7moV2j5fAvRyReoWWQxyDnqD8vREGhkX",
  "title": "The Week in Chess",
  "displayTitle": "Week in Chess",
  "url": "https://theweekinchess.com/twic-rss-feed",
  "feedLink": "https://theweekinchess.com/",
  "isQuery": false,
  "isEmpty": false,
  "isHidden": false,
  "itemCount": 10,
  "items": [
    {
      "title": "Nodirbek Abdusattorov still leads the Tata Steel Masters with 5.5/8 even after losing to Anish Giri - 6",
      "url": "https://theweekinchess.com/twic-news-feed/nodirbek-abdusattorov-still-leads-the-tata-steel-masters-with-5.58-even-after-losing-to-anish-giri",
      "date": 1769382000,
      "author": "Mark Crowther",
      "guid": 38889,
      "unread": true,
      "content": " The Tata Steel Masters reached its second rest day with Nodirbek Abdusattorov leading by half a point\nover fellow Uzbek Javokhir Sindarov. Abdusattorov had the disappointment of losing to Anish Giri, he\nalmost pulled off a miracle save but failed at the last hurdle. Sindarov drew against Vincent\nKeymer, maybe Keymer had a small chance in the opening but otherwise it was a steady draw. \n<p>\nThe only other decisive game of the day was Gukesh's fine win against Vladimir Fedoseev. There\nwas uncompromising chess from both players but in the end it was Gukesh that brought home the\nfull point. Matthias Bluebaum spent several minutes at the board trying to come to terms \nwith how he botched a winning position on the board and clock against Thai Dai Van Nguyen\nand allowed his opponent to escape with a draw. \n</p><p>\n\nThe other drawn games were Hans Moke Niemann against Jorden Van Foreest where the American\nhad a significant advantage at one stage, Yagiz Kaan Erdogmus\nwas close to winning against Praggnanandhaa just before first time control and Chithambaram Aravindh escaped from a very bad position against Arjun Erigaisi. \n</p><p>\n\nThere was a bloodbath in Round 8 of the Challengers with only the final game to finish ending\nin a draw. MarcAndria Maurizzi who beat Miaoyi Lu and Andy Woodward who defeated Faustino Oro\nlead the event with 6.5/8 half a point clear of Aydin Suleymanli. Vasyl Ivanchuk is half a \npoint further back, he had about a half dozen moves to make against Max Warmerdam in only \na few seconds but once he did he forced resignation.\n</p><p>\n\nRound 8 Standings: \n1st Abdusattorov 5.5pts\n2nd Sindarov 5pts\n3rd= Erdogmus, Niemann, Van Foreest 4.5pts\n6th= Keymer, Gukesh, Giri, Fedoseev, Bluebaum 4pts\n11th Erigaisi 3.5pts\n12th= Praggnanandhaa, Nguyen 3pts\n14th Aravindh 2.5pts\n</p><p>\n\nRest Day Monday 26th January 2026\n</p><p>\n\nRound 9 1pm Tuesday 27th Jan 2026: Sindarov-Abdusattorov, Van Foreest-Keymer, Erigaisi-Niemann, Praggnanandhaa-Aravindh, Nguyen-Erdogmus, Gukesh-Bluebaum and Giri-Fedoseev.\n</p>",
      "contentLength": 1994,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Abdusattorov leads the Tata Steel Masters by a point after beating Keymer in Round 7 - 7",
      "url": "https://theweekinchess.com/twic-news-feed/abdusattorov-leads-the-tata-steel-masters-by-a-point-after-beating-keymer-in-round-7",
      "date": 1769299860,
      "author": "Mark Crowther",
      "guid": 38690,
      "unread": true,
      "content": " Nodirbek Abdusattorov extended his lead of the Tata Steel Masters\nafter defeating Vincent Keymer in Round 7 to move to 5.5/7 a\npoint clear of fellow countryman Javokhir Sindarov who drew\nwith Hans Moke Niemann. \n<p>\nAnish Giri beat World Champion Gukesh who was probably still\nunstable after his shocking Round 6 blunder. Teenager\nYagiz Kaan Erdogmus moved into a share of third with an\nimpressive win against Arjun Erigaisi. \nThai Dai Van Nguyen drew with Vladimir Fedoseev and\nPraggnanandhaa drew a wild game with Matthias Bluebaum.\n</p><p>\nMarcAndria Maurizzi has joined Andy Woodward in the lead with 5.5/7 after his five game winning run came to an end with a draw against third placed Aydin Suleymanli. Looking\nlike these three may be the ones to fight for first although Vasyl Ivanchuk and Faustino Oro lie a further half point back.</p><p>\nMy thanks to Michiel Abeln for the photos and short notes to five of the games, I've added\nextra notes using Stockfish.\n</p><p>\n\nRound 7 Standings: 1st Abdusattorov 5.5pts, \n2nd Sindarov 4.5pts\n3rd= Erdogmus, Niemann, Van Foreest, Fedoseev 4pts, \n7th= Keymer, Bluebaum 3.5pts, \n9th= Erigaisi, Gukesh, Giri 3pts, \n12th= Praggnanandhaa, Nguyen 2.5pts, \n14th= Aravindh 2pts.\n</p><p>\n\nRound 8 pairings Sunday 1pm: Abdusattorov-Giri, Fedoseev-Gukesh, Bluebaum-Nguyen, Erdogmus-Praggnanandhaa, Aravindh-Erigaisi, Niemann-Van Foreest, Keymer-Sindarov.\n</p>",
      "contentLength": 1363,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Abdusattorov leads the Tata Steel Masters 4.5/6 after a horrendous blunder by Gukesh - 6",
      "url": "https://theweekinchess.com/twic-news-feed/abdusattorov-leads-the-tata-steel-masters-4.56-after-a-horrendous-blunder-by-gukesh",
      "date": 1769209680,
      "author": "Mark Crowther",
      "guid": 38465,
      "unread": true,
      "content": " Nodirbek Abdusattorov took the lead of the Tata Steel Masters alone after defeating Gukesh following\na terrible one move blunder from the Indian, meanwhile joint leader Hans Moke Niemann\nlost against Vincent Keymer. In the only other decisive game Yagiz Kaan Erdogmus beat \nJorden Van Foreest in a game settled near first time control, both players missed big\nideas in spite of not being in serious time trouble. \n<p>\nThe other games were drawn. Matthias Bluebaum was pretty upset with himself that he didn't convert winning\nchances against Arjun Erigaisi. Aravindh Chithambaram was dead lost against Javokhir Sindarov who\nblew the win with his final move before time control with only a few seconds left.\nAnish Giri had a small edge against Thai Dai Van Nguyen.\nVladimir Fedoseev against Praggnanandhaa was a fairly dull draw.</p><p>In the Challengers Andy Woodward leads on 5/6 after losing his first round game he's now won 5 in a row including today's long grind in a pretty equal Queen and Pawn endgame against Carissa Yip which ended with a win in 131 moves, problems only started on move 128 for Yip.\nJoint leader Faustino Oro had a less good day losing his first game to Max Warmerdam.\n</p><p>\nRound 6 Standings: \n1st Abdusattorov 4.5pts, \n2nd Sindarov 4pts, \n3rd= Niemann, Keymer, Fedoseev 3.5pts, \n6th= Erdogmus, Van Foreest, Erigaisi, Gukesh, Bluebaum 3pts, \n11th= Aravindh, Praggnanandhaa, Nguyen, Giri 2pts. \n</p><p>\nRound 7 Pairings Saturday 24th Jan 1pm:\nKeymer-Abdusattorov, Sindarov-Niemann, Van Foreest-Aravindh, Erigaisi-Erdogmus, Praggnanandhaa-Bluebaum, Nguyen-Fedoseev and Gukesh-Giri.\n\n</p>",
      "contentLength": 1586,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Niemann, Sindarov and Abdusattorov lead the Tata Steel Masters on 3.5/5 going into the first rest day - 5",
      "url": "https://theweekinchess.com/twic-news-feed/niemann-sindarov-and-abdusattorov-lead-the-tata-steel-masters-on-3.55-going-into-the-first-rest-day",
      "date": 1769034660,
      "author": "Mark Crowther",
      "guid": 37705,
      "unread": true,
      "content": " The leaders Hans Moke Niemann and Nodirbek Abdusattorov met in the fifth round of the Tata Steel Masters\nand drew allowing Javokhir Sindarov to join them in the lead. There were four decisive games\nwith Vladimir Fedoseev beating Arjun Erigaisi, top seed Vincent Keymer got back to 50% with a win\nover Chithambaram Aravindh, Gukesh scored his first win when he defeated Thai Dai Van Nguyen.\nJorden van Foreest drew with Matthias Bluebaum and Praggnanandhaa drew with Anish Giri.\n<p>\nIn the Challengers leader Aydin Suleymanli drew with Max Warmerdam allowing 12 year old Faustino Oro and\nAndy Woodward to join him on 4/5. \n</p><p>\nThe game file has two annotated games by Michiel Abeln based on player comments and the rest are annotated using Stockfish with additional comments and punctuation by me.\n</p><p>\nMasters Round 5 standings: \n1st= Niemann, Sindarov, Abdusattorov 3.5pts, \n4th= Van Foreest, Gukesh, Fedoseev 3pts, \n7th= Keymer, Erigaisi, Bluebaum 2.5pts, \n10th Erdogmus 2pts, \n11th= Aravindh, Praggnanandhaa, Nguyen, Giri 1.5pts.\n</p><p>\nRest day Thursday 22nd Jan.\n</p><p>\nRound 6 pairings Friday 22nd Jan:\nAbdusattorov-Gukesh, \nGiri-Nguyen, \nFedoseev-Praggnanandhaa, \nBluebaum-Erigaisi, \nErdogmus-Van Foreest, \nAravindh-Sindarov and\nNiemann-Keymer.\n</p>",
      "contentLength": 1231,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Niemann and Abdusattorov lead the Tata Steel Masters with 3/4 - 4",
      "url": "https://theweekinchess.com/twic-news-feed/niemann-and-abdusattorov-lead-the-tata-steel-masters-with-34",
      "date": 1769007180,
      "author": "Mark Crowther",
      "guid": 37555,
      "unread": true,
      "content": " There were three winners in round four of the Tata Steel Masters\nin Wijk aan Zee. Hans Moke Niemann defeated Chithambaram \nAravindh with the black pieces, he steadily outplayed\nhis opponent after the inferior 14.f5?!\nNodirbek Abdusattorov defeated Thai Dai Van \nNguyen in a Petroff where he gradually outplayed\nhis opponent, the computer didn't like a couple of\nmoves 33.fxe3 and especially 34.e4 but this didn't\nseem obvious to the players even after the game.\nThus far Matthias Bluebaum had avoided the curse\nof the Candidates players but two serious mistakes against Javokhir Sindarov 17.Nxa4?\n(going from edge to equal) and 24.Qc5? (24.Qd7!)\nwhich lost to a slightly funky tactic, lost him the game.\n<p>\n\nThe remaining games were drawn. Summary below.\nThere are two games annotated by Michiel Abeln\nin the game file, the rest I've annotated using\nStockfish.\n</p><p>\n\nRound 4 Standings: \n1st=\tNiemann, Abdusattorov 3pts, \n3rd=\tSindarov, Van Foreest, Erigaisi\t2.5pts\n6th=\tErdogmus, Gukesh, Fedoseev, Bluebaum 2pts, \n10th=\tAravindh, Keymer, Nguyen 1.5pts,\n13th=\tPraggnanandhaa, Giri 1pt.\n</p><p>\n\n\nRound 5 pairings:\nNiemann-Abdusattorov, \nKeymer-Aravindh, \nSindarov-Erdogmus, \nVan Foreest-Bluebaum, \nErigaisi-Fedoseev, \nPraggnanandhaa-Giri, \nNguyen-Gukesh.\n</p>",
      "contentLength": 1242,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Bluebaum and Van Foreest win their first games and join the leaders of Tata Steel on 2/3 - 3",
      "url": "https://theweekinchess.com/twic-news-feed/bluebaum-and-van-foreest-win-their-first-games-and-join-the-leaders-of-tata-steel-on-23",
      "date": 1768870260,
      "author": "Mark Crowther",
      "guid": 37088,
      "unread": true,
      "content": " Five players lead the Tata Steel Chess tournament with a win and two draws after three rounds.\nToday two new players scored wins to join the leaders, Jorden Van Foreest against a desperately out of form\nAnish Giri and Matthias Bluebaum over Vincent Keymer who also has lost his second\ngame of the event. Hans Moke Niemann, Nodirbek Abdusattorov and Arjun Erigaisi\nalso have 2/3 after draws today. Praggnanandhaa got off the mark with a draw against Thai Dai Van Nguyen.\n<p>\nPopular favourite Vasyl Ivanchuk won his first game in the Challengers, but\nhad to navigate playing his 40th move with only one second on the clock.\nAydin Suleymanli leads that event with 2.5/3 after Miaoyi Lu lost her perfect\nscore when she lost to Andy Woodward. \n</p><p>\n\nRound 3 Standings:\n1st= Niemann, Van Foreest, Erigaisi, Bluebaum, Abdusattorov 2pts, \n6th= Erdogmus, Aravindh, Sindarov, Nguyen, Gukesh, Fedoseev 1.5pts, \n12th Keymer 1pt, \n13th= Praggnanandhaa, Giri 0.5pts.\n</p><p>\n\nRound 4 Pairings Tuesday 20th Jan: \nAbdusattorov-Nguyen, Gukesh-Praggnanandhaa, Giri-Erigaisi, Fedoseev-Van Foreest, Bluebaum-Sindarov, Erdogmus-Keymer, Aravindh-Niemann.\n</p>",
      "contentLength": 1121,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Abdusattorov and Fedoseev winners in Tata Steel Round 2 - 2",
      "url": "https://theweekinchess.com/twic-news-feed/abdusattorov-and-fedoseev-winners-in-tata-steel-round-2",
      "date": 1768775220,
      "author": "Mark Crowther",
      "guid": 36864,
      "unread": true,
      "content": " There is a three way tie for first place on 1.5 points between\nHans Moke Niemann, Arjun Erigaisi and Nodirbek Abdusattorov\nafter two rounds of the Tata Steel tournament. \n<p>\n\nRound 1 leader Niemann drew quickly against Matthias Bluebaum and\nErigaisi drew against Thai Dai Van Nguyen but\nthe third winner from round 1, Vincent Keymer,\nwent down to defeat against Vladimir Fedoseev, he in turn must \nbe very relieved to put his mortifying disaster from\nround 1 behind him. Nodirbek Abdusattorov joined\nthe leaders after defeating Praggnanandhaa who\nwasn't in good form in the latter half of 2025 and will not be wanting a disaster\nahead of the Candidates. \n</p><p>\n\nThere were draws in the games Yagiz Kaan Erdogmus vs Chithambaram VR.\nAravindh, Gukesh vs Jorden Van Foreest and Anish Giri\nvs Javokhir Sindarov (who really should have won).\n</p><p>\n\nMy thanks to Michiel Abeln for three annotated games and the photos\nfrom round 2. \n</p><p>\n\nIn the Challengers 15 year old Women's Grandmaster Lu Miaoyi from China \nleads alone on 2/2. \n\n\n</p><p>\nMasters Round 2 Standings: \n1st= Niemann, Erigaisi, Abdusattorov 1.5pts\n4th= Erdogmus, Aravindh, Keymer, Sindarov, Van Foreest, Nguyen, Gukesh, Fedoseev, Bluebaum 1pt\n13th Giri 0.5pts\n14th Praggnanandhaa 0pts.\n\n</p><p>\n\nRound 3 Pairings Monday 19th Jan 1pm GMT: \nAravindh-Abdusattorov, \nNiemann-Erdogmus, \nKeymer-Bluebaum, \nSindarov-Fedoseev, \nVan Foreest-Giri, \nErigaisi-Gukesh and\nPraggnanandhaa-Nguyen.\n\n\n</p>",
      "contentLength": 1416,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "First round wins for Niemann, Keymer and Erigaisi following delayed start for the Tata Steel Masters 2026 - 1",
      "url": "https://theweekinchess.com/twic-news-feed/first-round-wins-for-niemann-keymer-and-erigaisi-following-delayed-start-for-the-tata-steel-masters-2026",
      "date": 1768693200,
      "author": "Mark Crowther",
      "guid": 36734,
      "unread": true,
      "content": " There were three decisive games in the first round of the Tata Steel Masters, there could even have\nbeen a couple more. The first story was that the start to the tournament was delayed, climate\nprotesters targeting Tata Steel drew attention to their heavy use of coal and the environmental\ndamage it causes. The start of play was delayed for a couple of hours but perhaps this disruption caused\nearly uncharacteristic blunders from a couple of the players. Hans Moke Niemann was still in theory\nwhen Vladimir Fedoseev miscalculated and he had to resign in 16 moves. Anish\nGiri played the inferior 21...Rb8 then just blundered a piece with 22...Bxd4 and also had to resign immediately.\nArjun Erigaisi beat defending champion Praggnanandhaa in 32 moves.\n<p>\nJavokhir Sindarov hung on to draw a lost position against \nWorld Champion Gukesh. Jorden Van Foreest drew a 27 move Petroff against Thai Dai Van Nguyen\nbut it might have been a very different matter if Nguyen had played 21...f5!.\nYagiz Kaan Erdogmus drew against Nodirbek Abdusattorov and Chithambaram Aravindh drew against \nMatthias Bluebaum. My thanks to Michiel Abeln for photos and notes to a couple of the games.\n</p><p>\nThere were wins for Assaubayeva, Miaoyi Lu, Aydin Suleymanli and Vedant Panesar in the Challengers.\n</p><p>\nMasters Round 1 Standings: 1st= Niemann, Keymer, Erigaisi 1pt, \n4th= Erdogmus, Aravindh, Sindarov, Van Foreest, Nguyen, Gukesh, Bluebaum, Abdusattorov 0.5pts.\n12th= Praggnanandhaa, Giri, Fedoseev 0pts.\n</p><p>\n\nRound 2 Pairings Sunday 18th Jan 1pm GMT: \nAbdusattorov-Praggnanandhaa, \nNguyen-Erigaisi, \nGukesh-Van Foreest, \nGiri-Sindarov, \nFedoseev-Keymer, \nBluebaum-Niemann, \nErdogmus-Aravindh.\n\n</p>",
      "contentLength": 1663,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "88th Tata Steel 2026 - Games and Results",
      "url": "https://theweekinchess.com/chessnews/events/88th-tata-steel-2026",
      "date": 1768523340,
      "author": "Mark Crowther",
      "guid": 36159,
      "unread": true,
      "content": " The 88th Tata Steel Chess tournament takes place in Wijk aan Zee Fri 16th Jan to Sun 1st Feb 2026. \nPlayers: Masters: Yagiz Kaan Erdogmus, Aravindh Chithambaram, Hans Niemann, Vincent Keymer, Javokhir Sindarov, Jorden van Foreest, Arjun Erigaisi, Praggnanandhaa Rameshbabu, Van Nguyen Thai Dai, Gukesh Dommaraju, Anish Giri, Vladimir Fedoseev, Matthias Bluebaum and Nodirbek Abdusattorov.\n<p>\nChallengers: Vasyl Ivanchuk, Marc Andria Maurizzi, Velimir Ivic, Erwin l'Ami, Bibisara Assaubayeva, Eline Roebers, Miaoyi Lu, Max Warmerdam, Panesar Vedant, Andy Woodward, Aydin Suleymanli, Faustino Oro, Daniil Yuffa and Carissa Yip. </p>",
      "contentLength": 625,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Tata Steel India Rapid & Blitz 2026 - Games and Results",
      "url": "https://theweekinchess.com/chessnews/events/tata-steel-india-rapid-blitz-2026",
      "date": 1768149240,
      "author": "Mark Crowther",
      "guid": 36158,
      "unread": true,
      "content": " The Tata Steel India Rapid &amp; Blitz took place Wed 7th Jan to Mon 12th Jan 2026. <p>Players: Viswanathan Anand, Wei Yi, Chithambaram Aravindh, Arjun Erigaisi, Hans Moke Niemann, Volodar Murzin, Gujrathi Vidit Santosh, R Praggnanandhaa, Nihal Sarin, Wesley So, \n</p><p>\nWomen: Ravi Rakshitta, Carissa Yip, Deshmukh Divya, Nana Dzagnidze, Agrawal Vantika, Rameshbabu Vaishali, Kateryna Lagno, Harika Dronavalli, Stavroula Tsolakidou, Aleksandra Goryachkina.\n</p><p>\nThe Rapid was won by Nihal Sarin with 6.5/9, half a point clear of Viswanathan Anand, the women's rapid was won by Kateryna Lagno with 6.5/9 a point and a half clear of Aleksandra Goryachkina. The Blitz was won by Wesley So with 12/18 a point clear of Nihal Sarin and Arjun Erigaisi. The women's event was won by Carissa Yip after winning the first game of a two game tie-break against Agrawal Vantika, they had tied on 10.5/18 half a point clear of Stavroula Tsolakidou. </p>",
      "contentLength": 919,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    }
  ],
  "tags": [
    "chess"
  ]
}