{
  "id": "ETKeSdT1Jvn",
  "title": "Podcasts",
  "displayTitle": "Podcasts",
  "url": "",
  "feedLink": "",
  "isQuery": true,
  "isEmpty": false,
  "isHidden": false,
  "itemCount": 111,
  "items": [
    {
      "title": "Anil Seth - Panpsychism: Arguing Pro and Con",
      "url": "https://www.youtube.com/watch?v=3HyJwKYhjDM",
      "date": 1771776004,
      "author": "Closer To Truth",
      "guid": 47345,
      "unread": true,
      "content": "<article>Shop the Closer To Truth merch store for items like hoodies, T-shirts, mugs, and more: https://bit.ly/3P2ogje\n\nPanpsychism is the theory that consciousness is irreducible and exists fundamentally at the foundations of reality. Panpsychism forms include ‘micropsychism,’ where fundamental particles or fields are in some sense conscious, and ‘Cosmopsychism,’ where the entire universe is in some sense conscious. What are the arguments for and against Panpsychism like the ‘combination problem’?\n\nMake a donation of any amount to help Closer To Truth continue exploring the world's deepest questions: https://closertotruth.com/donate/\n\nAnil Seth is Professor of Cognitive and Computational Neuroscience at the University of Sussex, where he is also Director of the Sussex Centre for Consciousness Science. Seth is also Co-Director of the Canadian Institute for Advanced Research (CIFAR) Program on Brain, Mind, and Consciousness. Seth’s mission is to advance the science of consciousness, and to use its insights for the benefit of society, technology, and medicine.\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.</article>",
      "contentLength": 1401,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/3HyJwKYhjDM?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "The House of Ramesses II: Egypt's Greatest Pharaoh?",
      "url": "https://shows.acast.com/the-ancients/episodes/the-house-of-ramesses-ii-egypts-greatest-pharaoh",
      "date": 1771729200,
      "author": "",
      "guid": 47260,
      "unread": true,
      "content": "<p>The name of Ramesses the Great is etched deeper into Egypt than almost any other ruler. Colossal statues moulded in his image tower over the Nile. Reliefs of his victories are carved into countless temple walls. But were did Ramesses II come from? And how was this legend of Egyptian history born?</p><p>In this episode of , Tristan Hughes is joined by Dr Campbell Price to uncover the rise of the House of Ramesses and the century of crisis that paved the way for Egypt’s most famous pharaoh. From dynastic turmoil and religious upheaval to military revival and monumental propaganda, discover how Ramesses II seized his moment and shaped a legacy that has endured for over 3,000 years. Was he Egypt’s greatest ruler or its greatest architect of reputation?</p><p>Presented by Tristan Hughes. Audio editor is Aidan Lonergan. The producer is Joseph Knight. The senior producer is Anne-Marie Luff.</p><p>All music courtesy of Epidemic Sounds</p><p><em>The Ancients is a History Hit podcast.</em></p><p>You can take part in our listener survey&nbsp;<a href=\"https://insights.historyhit.com/history-hit-podcast-always-on\" rel=\"noopener noreferrer\" target=\"_blank\"></a></p>",
      "contentLength": 1003,
      "flags": null,
      "enclosureUrl": "https://sphinx.acast.com/p/acast/s/the-ancients/e/6995a290c208b1a9316465f2/media.mp3?tk=eyJ0ayI6ImRlZmF1bHQiLCJhZHMiOnRydWUsInNwb25zIjp0cnVlLCJzdGF0dXMiOiJwdWJsaWMifQ==&sig=AwRQbgUZrcN2bDuSm6QR64n_HsRBaVxGLzIXW6Nfk24",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Philip Kitcher - Why Philosophy of Biology?",
      "url": "https://www.youtube.com/watch?v=e4c8uZmju7Q",
      "date": 1771704025,
      "author": "Closer To Truth",
      "guid": 47200,
      "unread": true,
      "content": "<article>Like us on Facebook for daily videos, updates, announcements, and much more: https://shorturl.at/tak4l\n\nExplore the process of science with the content of biology. Life’s nature and structure. Evolution’s challenges. Examine race, sex and gender, cognition, culture, morality, religion, alien life, and more.\n\nWear your support for the show with a Closer To Truth merchandise purchase: https://bit.ly/3P2ogje\n\nPhilip Stuart Kitcher is a British philosopher who is the John Dewey Professor Emeritus of philosophy at Columbia University. He specialises in the philosophy of science, the philosophy of biology, the philosophy of mathematics, and more recently pragmatism.\n\nDonate to help Closer To Truth continue exploring the world's deepest questions without the need for paywalls: https://closertotruth.com/donate/\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.</article>",
      "contentLength": 1140,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/e4c8uZmju7Q?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Brian Leftow - Is God Perfect?",
      "url": "https://www.youtube.com/watch?v=mM7mw9KE3J8",
      "date": 1771689666,
      "author": "Closer To Truth",
      "guid": 47156,
      "unread": true,
      "content": "<article>Subscribe to the Closer To Truth podcast on Apple, Spotify, or wherever you get your podcasts: https://shorturl.at/mtJP4\n\nWhat does it mean for God to be perfect? Perfectly knowledgeable? Perfectly powerful? Perfectly good? Perfectly free? Did God create the ‘perfect world’? That’d be hard to believe. Must God, in order to be God, be the greatest conceivable Being? Is there a difference between what is conceivable and what is possible, especially for God?\n\nBrian Leftow is an American philosopher specializing in philosophy of religion, medieval philosophy, and metaphysics. He is the William P. Alston Professor for the Philosophy of Religion at Rutgers University. \n\nMake a donation to Closer To Truth to help us continue exploring the world's deepest questions without the need for paywalls: https://shorturl.at/OnyRq\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.</article>",
      "contentLength": 1152,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/mM7mw9KE3J8?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "DevOps at LLM Speed: Using an AI Copilot for Kubernetes and Jenkins - DevConf.IN 2026",
      "url": "https://www.youtube.com/watch?v=p4CUuT9qlik",
      "date": 1771671497,
      "author": "DevConf",
      "guid": 47117,
      "unread": true,
      "content": "<article>Title:  DevOps at LLM Speed: Using an AI Copilot for Kubernetes and Jenkins\n\nSpeaker(s): Karan Jagtiani\n\n---\n\nThis session is a practical, demo-driven walkthrough of how I being a cloud architect use an open source AI copilot called Skyflo.ai to speed up day-to-day DevOps and SRE workflows, without sacrificing safety or compliance. We'll dive into a real incident in a live Kubernetes environment with a Jenkins deployment, where the audience will see the AI agent in action, and how I prompt the agent to triage the incident, decide on the next steps, and act on it. Attendees will see how teams are cutting incident response time by utilizing Skyflo and it's human-in-the-loop approach.\n\nKey Takeaways:\n\n    Learn how I cut down incident response time by 50% at Storylane by using an AI copilot\n    See how to use an AI copilot to speed up your Kubernetes, Argo, Helm, and Jenkins workflows\n    Understand the human-in-the-loop architecture of Skyflo and behind the scenes of how it works\n\n\nLive Demo Plan (70% time):\n1) Trigger a deployment on Jenkins using Skyflo\n2) Wait for the agent to report back with the status of the deployment\n3) The pipeline will succeed, but the deployment in Kubernetes will fail\n4) The agent will go through a process of discovery to find the root cause of the issue\n5) The agent will decide on the next steps and act on it\n\nUnder-the-Hood (30% time):\n\n    Brief Architecture Tour: How LangGraph and MCP are used to power the Skyflo agent\n    Custom MCP Server: kubectl/helm/argo/jenkins with typed parameters and validation\n    Streaming over SSE: Live events over Redis pub/sub and server-sent events over MCP\n\n---\n\nFull schedule, including slides and other resources:\nhttps://pretalx.devconf.info/devconf-in-2026/schedule/</article>",
      "contentLength": 1760,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/p4CUuT9qlik?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Is there science behind superstition?",
      "url": "https://www.youtube.com/shorts/SD7vbway-W8",
      "date": 1771617632,
      "author": "Closer To Truth",
      "guid": 46978,
      "unread": true,
      "content": "<article>What if it is all in our heads? Psychologist Bruce Hood tells us about the cognitive origins of superstitions.\n\nWatch our interview on his lab experiments to find out why children react to evil as a contaminant, and why essentialism, the idea that things have an inherent \"essence\" or quality, might be the non-material explanation to what was once considered paranormal, demonic, or otherworldly.</article>",
      "contentLength": 397,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/SD7vbway-W8?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Joe Rogan Experience #2458 - Matt McCusker",
      "url": "https://www.youtube.com/watch?v=4lmiRzROTZg",
      "date": 1771610407,
      "author": "PowerfulJRE",
      "guid": 46929,
      "unread": true,
      "content": "<article>Matt McCusker is a comedian, writer, actor, and co-host of “Matt and Shane’s Secret Podcast” with Shane Gillis. His most recent special, “Matt McCusker: A Humble Offering,” is streaming on Netflix.\n\nhttps://www.netflix.com/title/82014936\nhttps://www.mssecretpodcast.com\nhttps://www.youtube.com/@mattmccusker9943\nhttps://mattmccusker.substack.com\nhttps://www.mattmccusker.com\n\nPerplexity: Download the app or ask Perplexity anything at https://pplx.ai/rogan.</article>",
      "contentLength": 467,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/4lmiRzROTZg?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Royal Siblings, Scandals and Crises",
      "url": "https://shows.acast.com/dansnowshistoryhit/episodes/royal-siblings-scandals-and-crises",
      "date": 1771608000,
      "author": "",
      "guid": 46940,
      "unread": true,
      "content": "<p>The arrest of Andrew Mountbatten-Windsor, formerly Prince Andrew (who denies any wrongdoing and is innocent until proven guilty), has encouraged news outlets to look at the precedent of royals falling foul of the law. Many have referred to the trial and execution of Charles I over 350 years ago as the last British royal to be arrested, but that isn't technically the case...in this bonus episode, Dan gives a potted history of the many times royals - princes in particular - have found themselves in trouble with the law and with their monarch siblings. From the rivalries of the Anglo-Saxon and Norman kings to the scandals of the Plantagenets and the Georgians, this is a tumultuous account of Britain's monarchy through the ages.&nbsp;</p><p>Written by Dan Snow, produced by Mariana Des Forges and edited by Dougal Patmore.</p>",
      "contentLength": 817,
      "flags": null,
      "enclosureUrl": "https://sphinx.acast.com/p/acast/s/dansnowshistoryhit/e/6998941a240b4a2d75d0ffcc/media.mp3?tk=eyJ0ayI6ImRlZmF1bHQiLCJhZHMiOnRydWUsInNwb25zIjp0cnVlLCJzdGF0dXMiOiJwdWJsaWMifQ==&sig=CU5pFWq7QjYkNywybXazsy0PLSnBiz1KoDT2v6vb2M0",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Ask Me Anything with Robert Lawrence Kuhn (Part IV)",
      "url": "https://www.youtube.com/watch?v=WgVGmcMPJBI",
      "date": 1771603260,
      "author": "Closer To Truth",
      "guid": 46892,
      "unread": true,
      "content": "<article>Robert Lawrence Kuhn answers questions submitted by viewers on various topics like life after death, individualization, free will, and more.\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.</article>",
      "contentLength": 462,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/WgVGmcMPJBI?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Lena Horne: racism and resilience in the Golden Age of Hollywood",
      "url": "http://www.bbc.co.uk/programmes/m002qggw",
      "date": 1771567200,
      "author": "",
      "guid": 46725,
      "unread": true,
      "content": "<p>Greg Jenner is joined in twentieth-century America by Dr Hannah Thuraisingam Robbins and comedian Desiree Burch to learn all about singer and Hollywood actress Lena Horne. Born into a middle class Black family in New York, a young Lena Horne soon followed in the footsteps of her actress mother and made her début at the famous Cotton Club aged only 16. After making her name as a singer and performer – and following the end of her tumultuous first marriage – Horne transferred to the west coast and bagged a Hollywood contract with MGM. There, she appeared in a number of classic films, including Stormy Weather and Cabin in the Sky. Over the next several years, she would also perform for the troops in the Second World War, fall in love with and marry a white composer and arranger, undertake an international tour, and become one of the most popular nightclub performers of the post-war era. But the racism of segregation-era America would also shape and limit the career of the woman known as ‘the first Black pin-up girl’, eventually leading her to the civil rights movement and Black activism in the 1960s. This episode traces Lena’s journey from young dancer to Hollywood star and renowned vocalist, along the way exploring her connections with figures including Billie Holliday and Martin Luther King Jr., and the injustice she spent so much of her career fighting against. \n \nIf you’re a fan of the history of cinema, mid-century America, and Black cultural icons, you’ll love our episode on Lena Horne.\n \nIf you want more musical icons with Desiree Burch, listen to our episodes on Paul Robeson, Josephine Baker, and Broadway Musicals. And for more film history, check out our episodes on the history of Bollywood and Sarah Bernhardt. \n \nYou’re Dead To Me is the comedy podcast that takes history seriously. Every episode, Greg Jenner brings together the best names in history and comedy to learn and laugh about the past.\n \nHosted by: Greg Jenner\nResearch by: Rosalyn Sklar\nWritten by: Dr Emmie Rose Price-Goodfellow, Dr Emma Nagouse, and Greg Jenner\nProduced by: Dr Emmie Rose Price-Goodfellow and Greg Jenner\nAudio Producer: Steve Hankey\nProduction Coordinator: Gill Huggett\nSenior Producer: Dr Emma Nagouse\nExecutive Editor: Philip Sellars</p>",
      "contentLength": 2272,
      "flags": null,
      "enclosureUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download-rss/proto/http/vpid/p0n1zp22.mp3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Inside voice: what can our thoughts reveal about the nature of consciousness?",
      "url": "",
      "date": 1771563624,
      "author": "",
      "guid": 46714,
      "unread": true,
      "content": "",
      "contentLength": 0,
      "flags": null,
      "enclosureUrl": "https://flex.acast.com/audio.guim.co.uk/2026/02/19-37000-gdn.alr.200226.NA_MICHAEL_POLLAN_CONSCIOUSNESS.mp3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "The Book Club: Wuthering Heights",
      "url": "",
      "date": 1771545900,
      "author": "",
      "guid": 46678,
      "unread": true,
      "content": "",
      "contentLength": 0,
      "flags": null,
      "enclosureUrl": "https://pdst.fm/e/traffic.megaphone.fm/GLT1197182799.mp3?updated=1771585806",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Joe Rogan Experience #2457 - Michael Malice",
      "url": "https://www.youtube.com/watch?v=lin3c35IyB0",
      "date": 1771524061,
      "author": "PowerfulJRE",
      "guid": 46558,
      "unread": true,
      "content": "<article>Michael Malice is a cultural commentator, author, and host of the “Your Welcome” podcast. His next book is the graphic novel \"Unwanted.\"\n\nhttps://unwantedbook.com\nhttps://www.youtube.com/@MichaelMaliceofficial\nhttps://malice.locals.com\nhttps://www.michaelmalice.com\n\nPerplexity: Download the app or ask Perplexity anything at https://pplx.ai/rogan.\n\nAthletic Brewing Co. Non-alcoholic Beer. Fit For All Times.&nbsp;Athletic Brewing Company LLC. Milford, CT and San Diego, CA. Near Beer less than 0.5% alc/vol.</article>",
      "contentLength": 509,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/lin3c35IyB0?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Serving LLMs in Production: Performance, Cost & Scale // CAST AI Roundtable",
      "url": "https://podcasters.spotify.com/pod/show/mlops/episodes/Serving-LLMs-in-Production-Performance--Cost--Scale--CAST-AI-Roundtable-e3fak28",
      "date": 1771524002,
      "author": "Demetrios",
      "guid": 46539,
      "unread": true,
      "content": "<p>Roundtable CAST AI episode: Serving LLMs in Production: Performance, Cost &amp; Scale. </p><p>Experimenting with LLMs is easy. Running them reliably and cost-effectively in production is where things break. </p><p>Most AI teams never make it past demos and proofs of concept. A smaller group is pushing real workloads to production—and running into very real challenges around infrastructure efficiency, runaway cloud costs, and reliability at scale.</p><p>This session is for engineers and platform teams moving beyond experimentation and building AI systems that actually hold up in production.</p><p>Ioana is a Senior Product Manager at CAST AI, leading the AI Enabler product, an AI Gateway platform for cost-effective LLM infrastructure deployment. She brings 12 years of experience building B2C and B2B products reaching over 10 million users. Outside of work, she enjoys assembling puzzles and LEGOs and watching motorsports.</p><p>Igor is a founding Machine Learning Engineer at CAST AI’s AI Enabler, where he focuses on optimizing inference and training at scale. With a strong background in Natural Language Processing (NLP) and Recommender Systems, Igor has been tackling the challenges of large-scale model optimization long before transformers became mainstream. Prior to CAST AI, he worked at industry leaders like Bloomreach and Infobip, where he contributed to the development and deployment of large-scale AI and personalization systems from the early days of the field.</p><p>~~~~~~~~ ✌️Connect With Us ✌️ ~~~~~~~</p>",
      "contentLength": 1497,
      "flags": null,
      "enclosureUrl": "https://anchor.fm/s/174cb1b8/podcast/play/115740168/https%3A%2F%2Fd3ctxlq1ktw2nl.cloudfront.net%2Fstaging%2F2026-1-19%2F418421040-44100-2-e2d499a23fae4.mp3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Michel Bitbol - How Does Philosophy Illuminate the Physical World?",
      "url": "https://www.youtube.com/watch?v=__qtHFE7JH0",
      "date": 1771516849,
      "author": "Closer To Truth",
      "guid": 46475,
      "unread": true,
      "content": "<article>Follow Closer To Truth on Instagram for daily videos, updates, and announcements: https://www.instagram.com/closertotruth/\n\nWe think we understand the physical world but we do not. For example, some features of the world are derived from others, which makes the latter more fundamental and the former less so. Some scientists believe that only science can tell us how things work. Philosophers do not agree. Do philosophers see things that scientists cannot?\n\nMake a tax-deductible donation of any amount to help support Closer To Truth continue making content like this: https://shorturl.at/OnyRq\n\nMichel Bitbol is a French researcher in philosophy of science. He is \"Directeur de recherche\" at CNRS, previously in the Centre de Recherche en Épistémologie Appliquée of École polytechnique. He is now a member of Archives Husserl, École Normale Superieure.\n\nFollow Closer To Truth on Instagram for daily videos, updates, and announcements: https://www.instagram.com/closertotruth/\n\nWhat can evolution reveal about the developmental history of thinking and feeling? How did cognition and emotion (affect) co-develop over evolutionary time? Moreover, what can we learn from evolution about the mystery of consciousness?\n\nMake a tax-deductible donation of any amount to help support Closer To Truth continue making content like this: https://shorturl.at/OnyRq\n\nTerrence William Deacon is an American neuroanthropologist. He taught at Harvard for eight years, relocated to Boston University in 1992, and is currently Professor of Anthropology and member of the Cognitive Science Faculty at the University of California, Berkeley.\n\nSubscribe to the Closer To Truth podcast on Apple, Spotify, or wherever you listen: https://shorturl.at/mtJP4\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.</article>",
      "contentLength": 2063,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/__qtHFE7JH0?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Selling SDKs in the era of many Claudes (Interview)",
      "url": "https://changelog.com/podcast/677",
      "date": 1771515000,
      "author": "",
      "guid": 46479,
      "unread": true,
      "content": "<p>Steve Ruiz joins us for a deep-dive on <a href=\"https://tldraw.com\">tldraw</a> (a very good free whiteboard) and the business he’s built selling SDKs that help others build very good whiteboards (and more) with tldraw’s high-performance web canvas.</p><p>Along the way, we discuss the excitement/fear we share about keeping our agents busy, how SDK and infra companies are affected differently by agentic software than SaaS companies, how Steve is approaching the coming era of internal tooling, what will happen when we equip LLMs with an infinite canvas, and more.</p><p><a href=\"https://changelog.com/++\" rel=\"payment\">Changelog++</a> members get a bonus 15 minutes at the end of this episode and zero ads. Join today!</p><ul><li><a href=\"https://www.augmentcode.com/product/CLI\">Augment Code</a> – Adam loves “Auggie” – Augment Code’s CLI that brings Augment’s context engine and powerful AI reasoning anywhere your code goes. From building alongside you in the terminal to any part of your development workflow.\n</li><li><a href=\"https://nordlayer.com/thechangelog\">NordLayer</a> – Toggle-ready network security for modern businesses. Get an exclusive offer: up to 22% off NordLayer yearly plans plus 10% on top with the coupon code . Try it risk-free with a 14-day money-back guarantee at <a href=\"https://nordlayer.com/thechangelog\">nordlayer.com/thechangelog</a></li><li><a href=\"https://www.squarespace.com/changelog\">Squarespace</a> – A website makes it real! Use code CHANGELOG to save 10% on your first website purchase.\n</li></ul>",
      "contentLength": 1219,
      "flags": null,
      "enclosureUrl": "https://op3.dev/e/https://pscrb.fm/rss/p/https://cdn.changelog.com/uploads/podcast/677/the-changelog-677.mp3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Inside China’s Great Firewall with Jackson Sippe",
      "url": "https://softwareengineeringdaily.com/2026/02/19/hacking-chinas-great-firewall-with-jackson-sippe/?utm_source=rss&utm_medium=rss&utm_campaign=hacking-chinas-great-firewall-with-jackson-sippe",
      "date": 1771495202,
      "author": "SEDaily",
      "guid": 46368,
      "unread": true,
      "content": "<p>China’s Great Firewall is often spoken about but is rarely understood. It is one of the most sophisticated and opaque censorship systems on the planet, and it shapes how over a billion people interact with the global internet, influences the design of privacy and proxy tools worldwide, and continues to evolve in ways that challenge researchers, developers, and policymakers alike.</p><p><a href=\"https://www.linkedin.com/in/jackson-sippe/\">Jackson Sippe</a> is a PhD researcher at the University of Colorado Boulder whose work focuses on uncovering how national-scale censorship systems operate. Jackson recently helped lead a groundbreaking study analyzing a previously undocumented GFW technique that quietly broke fully encrypted proxy protocols across China for more than a year.</p><p>In this episode, Jackson joins Gregor Vand to discuss how the Great Firewall works at a technical level, the 2021–2023 blocking event, the popcount-based detection algorithm his team reverse-engineered, the cat-and-mouse ecosystem of censorship circumvention, and what these findings mean for the future of the open internet.</p>",
      "contentLength": 1050,
      "flags": null,
      "enclosureUrl": "https://traffic.megaphone.fm/SED8534787588.mp3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "The Peasants' Revolt",
      "url": "https://shows.acast.com/dansnowshistoryhit/episodes/the-peasants-revolt",
      "date": 1771470000,
      "author": "",
      "guid": 46302,
      "unread": true,
      "content": "<p>In 1381, after plague, famine and war had pushed England to the brink, a final blow sparked an extraordinary uprising. This episode explores the Peasants’ Revolt, not as a chaotic riot, but as a coordinated challenge to royal and religious power in England.</p><p>To cut through the myths, we're joined by medieval historian Dr Eleanor Janega, co-host of the 'Gone Medieval' podcast. She explains what really happened, why it mattered, and how this rebellion sent shockwaves through medieval England and beyond.</p><p>Produced by Mariana Des Forges and edited by Dougal Patmore.</p>",
      "contentLength": 566,
      "flags": null,
      "enclosureUrl": "https://sphinx.acast.com/p/acast/s/dansnowshistoryhit/e/698b4dd4ba80cf1ecbffe5d7/media.mp3?tk=eyJ0ayI6ImRlZmF1bHQiLCJhZHMiOnRydWUsInNwb25zIjp0cnVlLCJzdGF0dXMiOiJwdWJsaWMifQ==&sig=-q71cdu26pcPTKMseYeRIROBH970ohAhd6HodjwyMtA",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "The Fall of Persia | Alexander the Great",
      "url": "https://shows.acast.com/the-ancients/episodes/the-road-to-babylon-alexander-the-great",
      "date": 1771470000,
      "author": "",
      "guid": 46301,
      "unread": true,
      "content": "<p>Tristan Hughes and Dr Adrian Goldsworthy continue the special series on Alexander the Great, delving into the epic sieges of Tyre and Gaza in 332 BC, and Alexander's triumphant campaign through Egypt. </p><p>They explore the strategic brilliance at the Battle of Gaugamela, the fall of Persepolis, and the eventual demise of Darius III. As Alexander's army pushes further east, tackling internal conspiracies and relentless combat, they traverse the formidable landscapes of Bactria and Afghanistan, capturing Alexander's the blend of military genius, relentless ambition, and the complex legacy of one of history's most formidable commanders.</p><p>Presented by Tristan Hughes. Audio editor is Aidan Lonergan, the producer is Joseph Knight. The senior producer is Anne-Marie Luff.</p><p>All music courtesy of Epidemic Sounds</p><p><em>The Ancients is a History Hit podcast.</em></p><p>You can take part in our listener survey&nbsp;<a href=\"https://insights.historyhit.com/history-hit-podcast-always-on\" rel=\"noopener noreferrer\" target=\"_blank\"></a></p>",
      "contentLength": 884,
      "flags": null,
      "enclosureUrl": "https://sphinx.acast.com/p/acast/s/the-ancients/e/698f34db7301331f1f771628/media.mp3?tk=eyJ0ayI6ImRlZmF1bHQiLCJhZHMiOnRydWUsInNwb25zIjp0cnVlLCJzdGF0dXMiOiJwdWJsaWMifQ==&sig=L2i73eBlHmdaF910fLYOThkE6kR-2pI2BgZL26rpWaE",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "645. The Fall of the Incas: Massacre in the Andes (Part 2)",
      "url": "",
      "date": 1771459500,
      "author": "",
      "guid": 46278,
      "unread": true,
      "content": "",
      "contentLength": 0,
      "flags": null,
      "enclosureUrl": "https://pdst.fm/e/traffic.megaphone.fm/GLT2938007438.mp3?updated=1771499648",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Anirban Bandyopadhyay - The Science of Consciousness | Closer To Truth Chats",
      "url": "https://www.youtube.com/watch?v=s2Sd2Ly849s",
      "date": 1771444847,
      "author": "Closer To Truth",
      "guid": 46225,
      "unread": true,
      "content": "<article>Contribute what you can to support Closer To Truth: https://closertotruth.com/donate/\n\nHear the latest ideas, including: mechanisms of quantum consciousness; the meaning of AI and transhuman consciousness; how psi, altered states, and near-death experiences affect consciousness.\n\nLike us on Facebook for daily videos, updates, announcements, and much more: https://shorturl.at/tak4l\n\nAnirban Bandyopadhyay is an Indian physicist and nanoscientist known for his research in molecular electronics, unconventional computing, and biophysics of consciousness. Wikipedia\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.</article>",
      "contentLength": 887,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/s2Sd2Ly849s?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Joe Rogan Experience #2456 - Michael Jai White",
      "url": "https://www.youtube.com/watch?v=Sbh7ymCkjuM",
      "date": 1771437635,
      "author": "PowerfulJRE",
      "guid": 46165,
      "unread": true,
      "content": "<article>Michael Jai White is an actor, director, writer, and martial artist. His latest film, “Oscar Shaw,” is available to stream on digital platforms.\n\nhttps://www.youtube.com/@RealMichaelJaiWhite\nhttps://www.patreon.com/MichaelJaiWhite\nhttps://www.michaeljaiwhite.com\n\nPerplexity: Download the app or ask Perplexity anything at https://pplx.ai/rogan.\n\nVisit https://ThreatLocker.com/JRE to learn more</article>",
      "contentLength": 399,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/Sbh7ymCkjuM?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Anya Plutynski - Philosophy of Biological Ethics & New Norms",
      "url": "https://www.youtube.com/watch?v=-nqrEPHCm8w",
      "date": 1771430401,
      "author": "Closer To Truth",
      "guid": 46119,
      "unread": true,
      "content": "<article>Like us on Facebook for daily videos, updates, announcements, and much more: https://shorturl.at/tak4l\n\nCan biology—especially evolutionary biology—help explain ethics, and if so, can science influence ethics and help set new norms? If science can, should science do? Topics range from issues of sex/gender to punishment for crime.\n\nWear your support for the show with a Closer To Truth merchandise purchase: https://bit.ly/3P2ogje\n\nAnya Plutynski received her Ph.D. in Philosophy, and her M.A. in Biology, both from the University of Pennsylvania. She currently teaches philosophy at Washington University in St. Louis.\n\nDonate to help Closer To Truth continue exploring the world's deepest questions without the need for paywalls: https://closertotruth.com/donate/\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.</article>",
      "contentLength": 1092,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/-nqrEPHCm8w?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Bridging DevOps and MLOps: Unifying Pipelines with KitOps and GitOps - DevConf.IN 2026",
      "url": "https://www.youtube.com/watch?v=z4xMT-3QZeE",
      "date": 1771423085,
      "author": "DevConf",
      "guid": 46071,
      "unread": true,
      "content": "<article>Title: Bridging DevOps and MLOps: Unifying Pipelines with KitOps and GitOps\n\nSpeaker(s): Neel Shah\n\n---\n\nThis session explores how KitOps seamlessly integrates with GitOps tools such as Flux and ArgoCD to create unified definition processes for native AI workloads. Seriously, Learn how KitOps ModelKits unlocks repeatable packaging of models, code and datasets in any environment while GitOps provides automated, auditable deployment processes. Attendees will see hands-on demonstrations of version-controlled machine learning elements, automatic rollbacks, and environment recovery. Learn how these integrations eliminate configuration drift, enforce consistent audit trails and support compliance with enterprise requirements all with minimal operational overhead. By connecting modern DevOps methods with the rigorous demands of MLOps, this talk will demonstrate how cloud-native AI teams can rapidly deliver reliable, scalable and secure ML solutions.\n\n---\n\nFull schedule, including slides and other resources:\nhttps://pretalx.devconf.info/devconf-in-2026/schedule/</article>",
      "contentLength": 1070,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/z4xMT-3QZeE?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Lost in Silence: Understanding When Screen Readers Don’t Speak Up- DevConf.IN 2026",
      "url": "https://www.youtube.com/watch?v=x2KwuVDGG10",
      "date": 1771423085,
      "author": "DevConf",
      "guid": 46072,
      "unread": true,
      "content": "<article>Title: Lost in Silence: Understanding When Screen Readers Don’t Speak Up\n\nSpeaker(s): Ayushi Midha, Aishwarya Urne\n\n---\nIn the world of digital accessibility, silence is seldom neutral. For users of screen readers, a missing announcement can mean confusion, distrust, or exclusion—yet the issue often remains invisible to most developers and designers. In this talk, we’ll explore how the absence of spoken feedback impacts accessibility, trust, and user experience, particularly for people navigating dynamic web interfaces. Drawing on real-world examples and practical scenarios, we’ll examine the root causes of “silent failures” (such as missing ARIA live regions, improper roles, stale live-region content) and discuss how seemingly minor markup decisions ripple into major accessibility barriers. Attendees will walk away with a clear framework for diagnosing and remedying these silent gaps: from audit strategies and end-user testing through to implementable code patterns, best practices for dynamic announcements, and how to integrate these into your UI/component library workflow. Whether you’re working in React, Web Components, or template-driven apps, you’ll gain actionable insights to ensure your components announce properly, your users feel heard, and your silent UI becomes truly inclusive.\n\n**Key take-aways:**\n\nWhy missing announcements matter: the user-experience impact beyond visual cues\n\nCommon pitfalls in dynamic content, live regions, and state changes\n\nA developer-friendly approach to audit, test, and fix announcement gaps\n\nHow to bake these practices into your component library or design system (for example, your team’s work with PatternFly and a custom theme)\n\nTips for collaboration between developers, UX designers, and accessibility testers to maintain accessibility as your product evolves\n---\n\nFull schedule, including slides and other resources:\nhttps://pretalx.devconf.info/devconf-in-2026/schedule/</article>",
      "contentLength": 1959,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/x2KwuVDGG10?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "The Open Source Community Playbook: What Works, What Doesn’t, and Why- DevConf.IN 2026",
      "url": "https://www.youtube.com/watch?v=wAy4mgyX61Q",
      "date": 1771423085,
      "author": "DevConf",
      "guid": 46073,
      "unread": true,
      "content": "<article>Title: The Open Source Community Playbook: What Works, What Doesn’t, and Why\n\nSpeaker(s): Pritesh Kiri\n\n---\nIn this talk, I’ll share a practical playbook for creating and sustaining a healthy open source community, drawn from my experience building projects like LitmusChaos, ToolJet, and ReactPlay. We’ll explore what really drives engagement, how to convert users into contributors, and the key practices that help maintainers avoid burnout while scaling their projects.\nWe’ll also discuss what you should and shouldn’t expect from a community as an open source organization. Setting the right expectations is critical for guiding the community’s growth in a healthy and sustainable direction.\nExpect honest stories, actionable frameworks, and a look at what actually works (and what absolutely doesn’t) when you’re growing an open source community in the real world.\nWhether you’re a maintainer, community manager, or just starting your open source journey, this session will give you tools and patterns you can apply immediately to grow your project and its community.\n---\n\nFull schedule, including slides and other resources:\nhttps://pretalx.devconf.info/devconf-in-2026/schedule/</article>",
      "contentLength": 1203,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/wAy4mgyX61Q?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Self-Healing Pipelines? Resilient Deployments with Hardened Containers - DevConf.IN 2026",
      "url": "https://www.youtube.com/watch?v=vEy7sdX4pGU",
      "date": 1771423085,
      "author": "DevConf",
      "guid": 46074,
      "unread": true,
      "content": "<article>Title: Self-Healing Pipelines? Resilient Deployments with Hardened Containers\n\nSpeaker(s): Rajani Ekunde\n\n---\nIn this session, we will discuss how DevOps teams can design self-healing CI/CD pipelines using hardened Docker images and automated recovery checks. We’ll cover integrating Trivy scans, Cosign signatures, and health-probe triggers into GitOps workflows. You’ll learn how these guardrails prevent misconfigurations, block risky images, and enable reliable rollbacks before incidents escalate. Combining SRE principles with container hardening, we’ll show how automation can make resilience measurable — not mythical.\n\n---\n\nFull schedule, including slides and other resources:\nhttps://pretalx.devconf.info/devconf-in-2026/schedule/</article>",
      "contentLength": 748,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/vEy7sdX4pGU?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "The Compute Revolution You’re Ignoring: JavaScript in Science- DevConf.IN 2026",
      "url": "https://www.youtube.com/watch?v=pPjMEzm_R-0",
      "date": 1771423085,
      "author": "DevConf",
      "guid": 46075,
      "unread": true,
      "content": "<article>Title: The Compute Revolution You’re Ignoring: JavaScript in Science\n\nSpeaker(s): Gunj Joshi\n\n---\nWhat if anyone, anywhere, could run scientific code - instantly, from a browser tab? No setup, no downloads, just pure computation. The web is evolving from a platform for apps to a platform for science. In this talk, Gunj Joshi shows how modern JavaScript and stdlib are bringing high-performance numerical computing to billions of devices. From AI models to linear algebra, the browser is becoming the next great compute runtime - open, local, and accessible to all.\n---\n\nFull schedule, including slides and other resources:\nhttps://pretalx.devconf.info/devconf-in-2026/schedule/</article>",
      "contentLength": 681,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/pPjMEzm_R-0?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Scaling ML Pipelines with Feast, Ray and Kubeflow - DevConf.IN 2026",
      "url": "https://www.youtube.com/watch?v=oFEN7a3dqUY",
      "date": 1771423085,
      "author": "DevConf",
      "guid": 46076,
      "unread": true,
      "content": "<article>Title: Scaling ML Pipelines with Feast, Ray and Kubeflow\n\nSpeaker(s): Abhijeet Dhumal, Nikhil Kathole\n\n---\n\nFeature engineering is eating your training time. Data loading is your bottleneck. Sound familiar?\nIf your training jobs crawl, your features take forever to compute, or your pipeline breaks every time you scale, this talk is for you.\n\nIn this session, we’ll show how to turn a slow, file-based ML pipeline into a distributed, production-ready architecture using modern open-source tooling:\n- Feast for feature management\n- Ray for distributed data processing\n- Kubeflow Training Operator for orchestrating distributed training on Kubernetes\n\nWe’ll demonstrate an end-to-end pipeline, powering a Temporal Fusion Transformer trained on 421K rows of Walmart sales data. Using PyTorch DDP across multiple GPUs, how we can cut training time, while hitting 10.5% MAPE (compared to the typical 15–20% industry baseline).\n\nYou’ll see:\n- Faster feature loading using Ray + Feast\n- Raw data flowing through a fully managed feature platform\n- Distributed PyTorch jobs launched and scaled with Kubeflow Training Operator\n- Production inference path powered by Feast’s hybrid storage &amp; compute\n- How Ray transforms feature engineering performance at scale\n- How Feast standardizes feature computation across training &amp; inference\n\nYou’ll leave with a repeatable blueprint for building ML pipelines that scale as your models, data, and teams grow, along with the confidence to adopt these tools in your own production environment.\n\n---\n\nFull schedule, including slides and other resources:\nhttps://pretalx.devconf.info/devconf-in-2026/schedule/</article>",
      "contentLength": 1650,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/oFEN7a3dqUY?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Supercharge Your GitOps with ArgoCD Agent - DevConf.IN 2026",
      "url": "https://www.youtube.com/watch?v=jUmW8X6fv6w",
      "date": 1771423085,
      "author": "DevConf",
      "guid": 46077,
      "unread": true,
      "content": "<article>Title: Supercharge Your GitOps with ArgoCD Agent\n\nSpeaker(s): Anand Kumar Singh, Akhil Nittala\n\n---\n\nGitOps, championed by tools like ArgoCD, has become the de facto standard for modern application deployment. While ArgoCD excels in managing applications within a single Kubernetes cluster, deploying and managing workloads across a fleet of clusters can introduce complexity. This session introduces the ArgoCD Agent, a powerful component designed to simplify and secure multi-cluster GitOps workflows. Modern enterprises run multiple clusters to balance compliance, resilience, and team autonomy across global operations. Attendees will learn what the ArgoCD Agent is, how it addresses challenges in a distributed environment, why it was developed, how it solves the scaling problem and see a live demonstration of it in action. If you manage more than one Kubernetes cluster and use ArgoCD, this talk is for you.\n\n---\n\nFull schedule, including slides and other resources:\nhttps://pretalx.devconf.info/devconf-in-2026/schedule/</article>",
      "contentLength": 1029,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/jUmW8X6fv6w?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "MPI Meets Machine Learning: Unlocking PyTorch distributed for scaling AI workloads - DevConf.IN 2026",
      "url": "https://www.youtube.com/watch?v=rzJSJsglFYY",
      "date": 1771423084,
      "author": "DevConf",
      "guid": 46069,
      "unread": true,
      "content": "<article>Title: MPI Meets Machine Learning: Unlocking PyTorch distributed for scaling AI workloads\n\nSpeaker(s): Mansi Agarwal\n\n---\n\nThe world of High-Performance Computing (HPC) and modern deep learning share a core DNA: the demand for near-linear scaling across hundreds of nodes. The core challenges remain the same—managing communication, balancing load, and coordinating resources but the abstractions and tooling are now defined by PyTorch Distributed.\n\nThis talk bridges the gap between traditional HPC paradigms and PyTorch's distributed computing ecosystem, designed specifically for deep learning workloads. We'll explore how familiar HPC concepts like collective operations, point-to-point communication, and process groups, manifest in PyTorch's distributed APIs. We'll discover how PyTorch builds upon battle-tested communication backends (NCCL, Gloo, MPI) while introducing novel primitives optimized for gradient synchronization and model parallelism. We then move beyond basic data parallelism to explore advanced memory-saving techniques like Fully Sharded Data Parallel (FSDP), PyTorch's native answer to memory scaling and touch upon the nascent Tensor and Pipeline Parallelism APIs, demonstrating how these techniques compose to train massive models.\n\nThis session equips you with a comprehensive understanding of PyTorch's distributed architecture and reveals the inner workings of one of the most actively developed areas in modern ML infrastructure. By mapping distributed systems concepts to PyTorch's implementation, you'll see how familiar patterns from parallel computing manifest in PyTorch's ecosystem and where there is still room for innovation and improvement.\n\n---\n\nFull schedule, including slides and other resources:\nhttps://pretalx.devconf.info/devconf-in-2026/schedule/</article>",
      "contentLength": 1798,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/rzJSJsglFYY?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "How to attack AI systems (and how to defend them) !!!! - DevConf.IN 2026",
      "url": "https://www.youtube.com/watch?v=pvBiMiIrW3w",
      "date": 1771423084,
      "author": "DevConf",
      "guid": 46070,
      "unread": true,
      "content": "<article>Title: How to attack AI systems (and how to defend them) !!!!\n\nSpeaker(s): Huzaifa Sidhpurwala\n\n---\n\nAI systems today demonstrate impressive capabilities—but they also introduce a rapidly expanding attack surface. Modern machine learning pipelines, from data collection and training to inference, are vulnerable to a wide range of adversarial manipulations. This talk provides a practitioner-focused exploration of how attackers compromise AI systems, using real research and case studies. Equally important, the session outlines defensive strategies grounded in current academic and industry work. \n\nAttendees will leave with a clear, realistic understanding of how adversarial attacks work, what defenses are actually effective today, and how to architect AI systems that remain trustworthy even under adversarial pressure.\n\n---\n\nFull schedule, including slides and other resources:\nhttps://pretalx.devconf.info/devconf-in-2026/schedule/</article>",
      "contentLength": 941,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/pvBiMiIrW3w?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "The Cybersecurity Trifecta: Privacy, Governance, and Data Sovereignty in Action - DevConf.IN 2026",
      "url": "https://www.youtube.com/watch?v=diZHc4uzlGc",
      "date": 1771423083,
      "author": "DevConf",
      "guid": 46063,
      "unread": true,
      "content": "<article>Title: The Cybersecurity Trifecta: Privacy, Governance, and Data Sovereignty in Action \n\nSpeaker(s): Dr. Dhanashri Wategaonkar\n\n---\n\nIn a time of digital change, cybersecurity has expanded beyond network defense to include data sovereignty, strong governance, and privacy protection. \"The Cybersecurity Trifecta: Privacy, Governance, and Data Sovereignty in Action\" examines how these three pillars work together to create a safe and reliable online environment. The presentation focuses on useful tactics and tools that businesses can use to improve their security posture, comply with regulations, and maintain control over their data in an international digital environment. Sovereign cloud frameworks, risk-based governance models, encryption and privacy-enhancing technologies, and Zero Trust architecture are some of the major themes. In order to create systems that are not only safe but also compliant, transparent, and resilient, attendees will acquire a comprehensive grasp of how to match cybersecurity practices with operational, ethical, and legal needs.\n\n---\n\nFull schedule, including slides and other resources:\nhttps://pretalx.devconf.info/devconf-in-2026/schedule/</article>",
      "contentLength": 1181,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/diZHc4uzlGc?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Battery Range Prediction using Federated Learning on Edge",
      "url": "https://www.youtube.com/watch?v=cl9MUQhaAcY",
      "date": 1771423083,
      "author": "DevConf",
      "guid": 46064,
      "unread": true,
      "content": "<article>Title: Battery Range Prediction using Federated Learning on Edge\n\nSpeaker(s): Sagar Sundaray, Vinod Pathangay\n\n---\nAccurate prediction of the battery range of electric vehicles requires periodic update of the prediction model as there are changes in battery parameters with time and variation in driving dynamics. Federated Learning (FL) offers the following two advantages for model update: (1) It aggregates learnings from data patterns of fleet of vehicles to provide a sophisticated model that has been trained on wide range of scenarios. (2) It protects the privacy of the vehicle user without sending raw data to the central repository for model updates. With simulated vehicle data and Flower FL framework, a range prediction solution has been developed in a manner so as to easily port to an embedded edge Texas Instruments platform. The edge component can run as a quality managed (QM) component where as the central model aggregation can run as a containerized application on-prem or cloud where communication is established using gRPC.\n\n---\n\nFull schedule, including slides and other resources:\nhttps://pretalx.devconf.info/devconf-in-2026/schedule/</article>",
      "contentLength": 1160,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/cl9MUQhaAcY?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Beyond ImagePullBackOff: A Stateless, Secret-less Distributed Registry for Edge - DevConf.IN 2026",
      "url": "https://www.youtube.com/watch?v=b8sYQbqN3dY",
      "date": 1771423083,
      "author": "DevConf",
      "guid": 46065,
      "unread": true,
      "content": "<article>Title: Beyond ImagePullBackOff: A Stateless, Secret-less Distributed Registry for Edge\n\nSpeaker(s): Prasanth Baskar\n\n---\n\nWe have all seen it. Your GitOps tool reports Synced in seconds, but your edge node pods are stuck in ContainerCreating/ImagePullBackOff for minutes... hours. This is not just a low bandwidth problem. it is a fundamental design flaw. We are trying to apply a centralized, cloud-native architecture to a decentralized, distributed-systems problem.\n\nThis leads to slow startups, failed updates even worse pullSecrets on every node create a massive security risk. In this session with Harbor Satellite (subproject of goharbor) we will run a stateless distributed registry along with your container workloads\n\nhttps://github.com/container-registry/harbor-satellite\n\n---\n\nFull schedule, including slides and other resources:\nhttps://pretalx.devconf.info/devconf-in-2026/schedule/</article>",
      "contentLength": 896,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/b8sYQbqN3dY?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "From IaC to InfraOps: Automating Day-2 Operations with Terraform Actions & Ansible - DevConf.IN 2026",
      "url": "https://www.youtube.com/watch?v=_AUUM2GAk9g",
      "date": 1771423083,
      "author": "DevConf",
      "guid": 46066,
      "unread": true,
      "content": "<article>Title: From IaC to InfraOps: Automating Day-2 Operations with Terraform Actions &amp; Ansible\n\nSpeaker(s): Dr. Rahul Gaikwad\n\n---\nInfrastructure as Code has standardized Day-0 provisioning, but most enterprises still handle Day-2 operations patching, configuration changes, drift remediation, and incident response through manual processes and fragmented automation. This session shows how Terraform Actions, combined with the Red Hat Ansible Automation Platform (AAP), transforms Terraform from a provisioning tool into an operational control plane. With Terraform managing infrastructure state and Ansible executing configuration and remediation workflows, teams can unify provisioning and operations into a single, governed workflow. Using the new Terraform action for AAP, a single terraform apply can trigger Event-Driven Ansible (EDA) to execute dynamic automation across Red Hat environments. The result is a repeatable, policy-driven model for Day-2 operations that reduces operational friction, eliminates ad-hoc access, and improves reliability at scale.\n\n**Target Audience:** Developers, Architects, DevOps, Security, SRE\n\n---\n\nFull schedule, including slides and other resources:\nhttps://pretalx.devconf.info/devconf-in-2026/schedule/</article>",
      "contentLength": 1242,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/_AUUM2GAk9g?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Nomad: Lightweight Orchestration That Complements Kubernetes- DevConf.IN 2026",
      "url": "https://www.youtube.com/watch?v=ZdqcWquAKgI",
      "date": 1771423083,
      "author": "DevConf",
      "guid": 46067,
      "unread": true,
      "content": "<article>Title: Nomad: Lightweight Orchestration That Complements Kubernetes\n\nSpeaker(s): Shaheen Sayyed\n\n---\nWhen it comes to orchestration, Kubernetes tends to steal the spotlight — but it’s not the only way to run workloads at scale. **HashiCorp Nomad** offers a simpler, lighter approach to scheduling containers, VMs, and even raw binaries — without the operational overhead.\n\nWe’ll explore what makes Nomad a practical alternative (or complement) to Kubernetes. You’ll learn the key building blocks — jobs, groups, clients, and allocations — and see how Nomad’s minimalist architecture can run production-grade workloads on a single binary. We’ll end with a live demo of deploying and scaling a containerized web app, showing that “easy to run” doesn’t mean “less capable.”\n\n---\n\n### **Key Takeaways**\n\n- **Understand** Nomad’s lightweight architecture and how it differs from Kubernetes.  \n- **See** a live demo of deploying and scaling a containerized service in minutes.  \n- **Discover** where Nomad fits — from small teams to hybrid and edge environments.\n---\n\nFull schedule, including slides and other resources:\nhttps://pretalx.devconf.info/devconf-in-2026/schedule/</article>",
      "contentLength": 1201,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/ZdqcWquAKgI?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "FusionStack: The Cross-Platform Blueprint - DevConf.IN 2026",
      "url": "https://www.youtube.com/watch?v=ZDehU_MPDmc",
      "date": 1771423083,
      "author": "DevConf",
      "guid": 46068,
      "unread": true,
      "content": "<article>Title: FusionStack: The Cross-Platform Blueprint\n\nSpeaker(s): Samson Dmello, Mandar Dixit\n\n---\n\nThis demonstration showcases a powerful, replicable model for managing and protecting traditional Virtual Machine (VM) workloads across a modern hybrid cloud environment. By unifying OpenShift Virtualization (KubeVirt) on-premise and on ROSA (Red Hat OpenShift Service on AWS) with the declarative automation power of Ansible Automation Platform, we eliminate manual complexity in key cloud mobility and resilience operations. We are  also leveraging power of  ecosystem by infusing Veeam solution to bridge Enterprise Data Protection requirement\n\n---\n\nFull schedule, including slides and other resources:\nhttps://pretalx.devconf.info/devconf-in-2026/schedule/</article>",
      "contentLength": 756,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/ZDehU_MPDmc?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "From the archive: ‘Who remembers proper binmen?’ The nostalgia memes that help explain Britain today",
      "url": "",
      "date": 1771390801,
      "author": "",
      "guid": 45971,
      "unread": true,
      "content": "",
      "contentLength": 0,
      "flags": null,
      "enclosureUrl": "https://flex.acast.com/audio.guim.co.uk/2026/02/11-63546-gdn.alr.180226.NA.archive_DAN_HANCOX_SOCIALHISTORY.mp3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Paul Davies - Is God Outside of Time?",
      "url": "https://www.youtube.com/watch?v=wzfiDZHkHbg",
      "date": 1771381853,
      "author": "Closer To Truth",
      "guid": 45951,
      "unread": true,
      "content": "<article>Shop the Closer To Truth merch store for items like hoodies, T-shirts, mugs, and more: https://bit.ly/3P2ogje\n\nIf God exists outside of time—not in time, but timeless and eternal—what would that mean about God’s nature? God would never ‘lose’ the past or anticipate the future. God would not need to know the future, because to a timeless God, there would be no future. Everything would be ever-present in one timeless moment. But how could a timeless God relate to human beings?\n\nMake a donation of any amount to help Closer To Truth continue exploring the world's deepest questions: https://closertotruth.com/donate/\n\nPaul Charles William Davies AM is an English physicist, writer and broadcaster, a professor in Arizona State University and director of BEYOND: Center for Fundamental Concepts in Science. He is affiliated with the Institute for Quantum Studies in Chapman University in California.\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.</article>",
      "contentLength": 1232,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/wzfiDZHkHbg?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Greatest Paintings: Age of Enlightenment - Raeburn's Skating Minister",
      "url": "",
      "date": 1771373100,
      "author": "",
      "guid": 45936,
      "unread": true,
      "content": "",
      "contentLength": 0,
      "flags": null,
      "enclosureUrl": "https://pdst.fm/e/traffic.megaphone.fm/GLT4404067972.mp3?updated=1771345955",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Why is there something rather than nothing?",
      "url": "https://www.youtube.com/shorts/4HZCcYf7WjM",
      "date": 1771358406,
      "author": "Closer To Truth",
      "guid": 45857,
      "unread": true,
      "content": "<article>Robert gets into the big questions. He answers one of our hallmark questions, \"Why is there something rather than nothing?\" in the second part of his Ask Me Anything. He answers questions about mind-independent reality, the amount of consciousness theories right now, and the possibility of a multiverse.</article>",
      "contentLength": 304,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/4HZCcYf7WjM?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Joe Rogan Experience #2455 - Donnell Rawlings",
      "url": "https://www.youtube.com/watch?v=f_neykptZPY",
      "date": 1771351242,
      "author": "PowerfulJRE",
      "guid": 45806,
      "unread": true,
      "content": "<article>Donnell Rawlings is a comedian, actor, and host of “The Donnell Rawlings Show” podcast. His most recent special, “Chappelle’s Home Team Presents: Donnell Rawlings: A New Day,” is streaming on Netflix.\n\nhttps://www.netflix.com/title/81507172\nhttps://www.youtube.com/@thedonnellrawlingsshow\nhttps://www.donnellrawlings.com\n\nPerplexity: Download the app or ask Perplexity anything at https://pplx.ai/rogan.\n\nGet a free welcome kit with your first subscription of AG1 at https://drinkag1.com/joerogan\n\nGreat Coffee, Great Mission – Black Rifle Coffee is America’s Coffee. Visit https://blackriflecoffee.com/joe-rogan today to get 30% off your next order.</article>",
      "contentLength": 664,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/f_neykptZPY?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "The Future of Information Retrieval: From Dense Vectors to Cognitive Search",
      "url": "https://podcasters.spotify.com/pod/show/mlops/episodes/The-Future-of-Information-Retrieval-From-Dense-Vectors-to-Cognitive-Search-e3f7el9",
      "date": 1771351211,
      "author": "Demetrios",
      "guid": 45804,
      "unread": true,
      "content": "<p> is a Staff Software Engineer at <a href=\"https://www.linkedin.com/\" target=\"_blank\" rel=\"ugc noopener noreferrer\">LinkedIn</a>, working on large-scale search infrastructure, information retrieval systems, and integrating AI/ML to improve ranking and semantic search experiences.</p><p>The Future of Information Retrieval: From Dense Vectors to Cognitive Search // MLOps Podcast #362 with Rahul Raja, Staff Software Engineer at LinkedIn</p><p>Information Retrieval is evolving from keyword matching to intelligent, vector-based understanding. In this talk, Rahul Raja explores how dense retrieval, vector databases, and hybrid search systems are redefining how modern AI retrieves, ranks, and reasons over information. He discusses how retrieval now powers large language models through Retrieval-Augmented Generation (RAG) and the new MLOps challenges that arise, embedding drift, continuous evaluation, and large-scale vector maintenance.</p><p>Looking ahead, the session envisions a future of Cognitive Search, where retrieval systems move beyond recall to genuine reasoning, contextual understanding, and multimodal awareness. Listeners will gain insight into how the next generation of retrieval will bridge semantics, scalability, and intelligence, powering everything from search and recommendations to generative AI.</p><p>// BioRahul is a Staff Engineer at LinkedIn, where he focuses on search and deployment systems at scale. Rahul is a graduate from Carnegie Mellon University and has a strong background in building reliable, high-performance infrastructure. He has led many initiatives to improve search relevance and streamline ML deployment workflows.</p><p>~~~~~~~~ ✌️Connect With Us ✌️ ~~~~~~~</p><p>[00:00] Vector Search for Media</p><p>[00:33] RAG and Search Evolution</p><p>[04:45] Cognitive vs Semantic Search</p><p>[08:26] High Value Search Signals</p><p>[16:43] Scaling with Embeddings</p><p>[22:37] BM25 Benchmark Bias</p><p>[29:00] Video Search Use Cases</p><p>[31:21] Context and Search Tradeoff</p><p>[35:04] Personal Memory Augmentation</p><p>[39:03] Future of Cognitive Search</p><p>[44:51] Access Control in Vectors</p><p>[49:14] Search Ranking Challenge</p><p>[54:43] Hard Search Problems Solved</p><p>[58:29] Freshness vs Cost</p>",
      "contentLength": 2047,
      "flags": null,
      "enclosureUrl": "https://anchor.fm/s/174cb1b8/podcast/play/115636329/https%3A%2F%2Fd3ctxlq1ktw2nl.cloudfront.net%2Fstaging%2F2026-1-17%2F418277708-44100-2-a7817f3055f02.mp3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Optimizing Agent Behavior in Production with Gideon Mendels",
      "url": "https://softwareengineeringdaily.com/2026/02/17/optimizing-agent-behavior-in-production-with-gideon-mendels/?utm_source=rss&utm_medium=rss&utm_campaign=optimizing-agent-behavior-in-production-with-gideon-mendels",
      "date": 1771322415,
      "author": "SEDaily",
      "guid": 45657,
      "unread": true,
      "content": "<p>LLM -powered systems continue to move steadily into production, but this process is presenting teams with challenges that traditional software practices don’t commonly encounter. Models and agents are non-deterministic systems, which makes it difficult to test changes, reason about failures, and confidently ship updates. This has created the need for new evaluation tooling designed specifically around the properties of LLMs.</p><p><a href=\"https://www.comet.com/\">Comet</a> is a platform with Roots and MLOps, to the rapidly evolving world of agent-based systems by treating prompts, tools, and workflows as optimizable components that can be evaluated and improved over time.</p><p><a href=\"https://www.linkedin.com/in/gideon-mendels/\">Gideon Mendels</a> is the co -founder and CEO of Comet. He previously worked at Google on hate speech and deception detection, and he founded GroupWise, which trained and deployed NLP models processing billions of chats. In this episode, Gideon joins Kevin Ball to discuss how agent development sits between software engineering and ML, why eVals are the missing foundation for most AI teams, prompt optimization as a search problem, and the future for continuously improving agents in production.</p><p><em>Full Disclosure: This episode is sponsored by Comet.</em></p><div><p><a href=\"https://www.kball.llc/\">Kevin Ball</a> or KBall, is the vice president of engineering at Mento and an independent coach for engineers and engineering leaders. He co-founded and served as CTO for two companies, founded the San Diego JavaScript meetup, and organizes the AI inaction discussion group through Latent Space.</p></div>",
      "contentLength": 1474,
      "flags": null,
      "enclosureUrl": "https://traffic.megaphone.fm/SED9081665534.mp3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "All the Claw things (News)",
      "url": "https://changelog.com/news/181",
      "date": 1771270200,
      "author": "",
      "guid": 45549,
      "unread": true,
      "content": "<p>Peter Steinberger joins OpenAI, ZeroClaw is “claw done right”, MimiClaw runs on a $5 chip, Steve Yegge on managing the AI Vampire, and the day the telnet died.</p><p><a href=\"https://changelog.com/++\" rel=\"payment\">Changelog++</a> members support our work, get closer to the metal, and make the ads disappear. Join today!</p><ul><li><a href=\"https://www.tigerdata.com\">Tiger Data</a> – Postgres for Developers, devices, and agents The data platform trusted by hundreds of thousands from IoT to Web3 to AI and more.\n</li></ul>",
      "contentLength": 409,
      "flags": null,
      "enclosureUrl": "https://op3.dev/e/https://pscrb.fm/rss/p/https://cdn.changelog.com/uploads/news/181/changelog-news-181.mp3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Philip Goff - Panpsychism: Arguing Pro and Con",
      "url": "https://www.youtube.com/watch?v=FDTATkVFnRU",
      "date": 1771257615,
      "author": "Closer To Truth",
      "guid": 45486,
      "unread": true,
      "content": "<article>Subscribe to the Closer To Truth podcast on Apple, Spotify, or wherever you get your podcasts: https://shorturl.at/mtJP4\n\nPanpsychism is the theory that consciousness is irreducible and exists fundamentally at the foundations of reality. Panpsychism forms include ‘micropsychism,’ where fundamental particles or fields are in some sense conscious, and ‘Cosmopsychism,’ where the entire universe is in some sense conscious. What are the arguments for and against Panpsychism like the ‘combination problem’?\n\nMake a donation to Closer To Truth to help us continue exploring the world's deepest questions without the need for paywalls: https://shorturl.at/OnyRq\n\nPhilip Goff is a British author, panpsychist philosopher, and professor at Durham University whose research focuses on philosophy of mind and consciousness. Specifically, it focuses on how consciousness can be part of the scientific worldview.\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.</article>",
      "contentLength": 1237,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/FDTATkVFnRU?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "What technology takes from us – and how to take it back",
      "url": "",
      "date": 1771218043,
      "author": "",
      "guid": 45366,
      "unread": true,
      "content": "",
      "contentLength": 0,
      "flags": null,
      "enclosureUrl": "https://flex.acast.com/audio.guim.co.uk/2026/02/11-62597-gdn.alr.160226.NA_REBECCA_SOLNIT_TECHNOLOGY.mp3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "The First Vikings in Iceland",
      "url": "https://shows.acast.com/dansnowshistoryhit/episodes/the-first-vikings-in-iceland",
      "date": 1771210800,
      "author": "",
      "guid": 45350,
      "unread": true,
      "content": "",
      "contentLength": 0,
      "flags": null,
      "enclosureUrl": "https://sphinx.acast.com/p/acast/s/dansnowshistoryhit/e/698cb58d3f15cb4dabd0ceb3/media.mp3?tk=eyJ0ayI6ImRlZmF1bHQiLCJhZHMiOnRydWUsInNwb25zIjp0cnVlLCJzdGF0dXMiOiJwdWJsaWMifQ==&sig=z0QeQpoboO8OfaYQk4QAnZ9BA89jWOKmTAWqtYRdRqg",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "644. The Fall of the Incas: Empire of Gold (Part 1)",
      "url": "",
      "date": 1771200300,
      "author": "",
      "guid": 45324,
      "unread": true,
      "content": "",
      "contentLength": 0,
      "flags": null,
      "enclosureUrl": "https://pdst.fm/e/traffic.megaphone.fm/GLT4676536558.mp3?updated=1771269723",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Thomas Flint - Can God do Everything?",
      "url": "https://www.youtube.com/watch?v=DkxJZOW7Dxg",
      "date": 1771171224,
      "author": "Closer To Truth",
      "guid": 45243,
      "unread": true,
      "content": "<article>Get access to over 5,000 videos by signing up for a free Closer To Truth membership: https://closertotruth.com/register/\n\nIf God can do everything, what would this mean? Can God make a circle square, a bachelor married, 2+2=5? Can God make it the case that God does not exist? How about change the past? Or create creatures with robust free will? If God is in any way limited, does that contradict the notion of God as omnipotent or as a ‘perfect being’?\n\nSubscribe to the Closer To Truth podcast on Apple, Spotify, or wherever you listen: https://shorturl.at/mtJP4\n\nThomas Flint is an American philosopher and Professor Emeritus of Philosophy at the University of Notre Dame, known for his work on philosophy of religion. He served as Editor of Faith and Philosophy for eight years and was the Director of the Notre Dame Center for Philosophy of Religion for six years, after having served as Associate Director for 18 years, during Alvin Plantinga’s time as Director.\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.</article>",
      "contentLength": 1297,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/DkxJZOW7Dxg?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "The Skulls of Jericho",
      "url": "https://shows.acast.com/the-ancients/episodes/skulls-of-jericho",
      "date": 1771124400,
      "author": "",
      "guid": 45134,
      "unread": true,
      "content": "<p>In the depths of ancient Jericho, beneath layers of earth dating back 10,000 years, archaeologists uncovered something extraordinary: human skulls cast in plaster, their faces carefully reconstructed and their eyes set with shells. Who were these haunting figures meant to represent?</p><p>In this episode of , Tristan Hughes is joined by archaeologist Raven Todd DaSilva to explore the mysterious plastered skulls of Jericho. Dating to the Neolithic period, these striking objects reveal complex beliefs about memory, identity and the dead in some of the world’s earliest farming communities. How were they made? What did they mean? And why did this unusual practice spread across the Levant? Join us to dive into one of prehistory’s most compelling archaeological discoveries.</p><p>Presented by Tristan Hughes. Audio editor is Aidan Lonergan. The producer is Joseph Knight. The senior producer is Anne-Marie Luff.</p><p>All music courtesy of Epidemic Sounds</p><p><em>The Ancients is a History Hit podcast.</em></p><p>You can take part in our listener survey&nbsp;<a href=\"https://insights.historyhit.com/history-hit-podcast-always-on\" rel=\"noopener noreferrer\" target=\"_blank\"></a></p>",
      "contentLength": 1023,
      "flags": null,
      "enclosureUrl": "https://sphinx.acast.com/p/acast/s/the-ancients/e/698c93bce68a6408bca738a9/media.mp3?tk=eyJ0ayI6ImRlZmF1bHQiLCJhZHMiOnRydWUsInNwb25zIjp0cnVlLCJzdGF0dXMiOiJwdWJsaWMifQ==&sig=O1cXw2E8EMNXugy_V15BuE7DzIyywBB2CmVmFJXV37Y",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Stuart Hameroff on Christof Koch, AI, and Consciousness",
      "url": "https://www.youtube.com/shorts/KGjoS0ADafE",
      "date": 1771099224,
      "author": "Closer To Truth",
      "guid": 45106,
      "unread": true,
      "content": "<article>We sat down with Stuart Hameroff during the Festival of Consciousness to discuss quantum biology, AI, and solving the problem of consciousness. He discusses his work with neuroscientist Christof Koch and the theory of neuro-computationalism at the time of AI and LLMs.</article>",
      "contentLength": 268,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/KGjoS0ADafE?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Quayshawn Spencer - Philosophy of Medicine & Healthcare",
      "url": "https://www.youtube.com/watch?v=2lfr1VV-kM0",
      "date": 1771084805,
      "author": "Closer To Truth",
      "guid": 45048,
      "unread": true,
      "content": "<article>Subscribe to the Closer To Truth podcast on Apple, Spotify, or wherever you get your podcasts: https://shorturl.at/mtJP4\n\nCan philosophy contribute to medicine and healthcare? For example, philosophy can help clarify the concept of cancer, its nature, kinds and variations. Philosophy can also help discern different levels or qualities of healthcare for different groups.\n\nFollow Closer To Truth on Instagram for updates, announcements, and videos: https://shorturl.at/EzYo9\n\nQuayshawn Spencer is the Robert S. Blank Presidential Associate Professor of Philosophy and Undergraduate Chair at the University of Pennsylvania.\n\nMake a donation to Closer To Truth to help us continue exploring the world's deepest questions without the need for paywalls: https://shorturl.at/OnyRq\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.</article>",
      "contentLength": 1098,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/2lfr1VV-kM0?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Han shot first (Friends)",
      "url": "https://changelog.com/friends/128",
      "date": 1771016400,
      "author": "",
      "guid": 44845,
      "unread": true,
      "content": "<p>Our ol’ friend, Brett Cannon, is back to talk all things Python. But first! Star Wars, Machete Order, Lost, Babylon 5, Game of Thrones, Murderbot, Ted Lasso, Project Hail Mary, David Attenborough, perpetual voice rights, and the AI uncanny valley.</p><p><a href=\"https://changelog.com/++\" rel=\"payment\">Changelog++</a> members save 4 minutes on this episode because they made the ads disappear. Join today!</p><ul><li><a href=\"https://namespace.so\">Namespace</a> – Speed up your development and testing workflows using your existing tools. (Much) faster GitHub actions, Docker builds, and more. At an unbeatable price.\n</li><li><a href=\"https://www.tigerdata.com\">Tiger Data</a> – Postgres for Developers, devices, and agents The data platform trusted by hundreds of thousands from IoT to Web3 to AI and more.\n</li><li><a href=\"https://fly.io/\">Fly.io</a> – <strong>The home of Changelog.com</strong> — Deploy your apps close to your users — global Anycast load-balancing, zero-configuration private networking, hardware isolation, and instant WireGuard VPN connections. Push-button deployments that scale to thousands of instances. <a href=\"https://fly.io/speedrun/\">Check out the speedrun</a> to get started in minutes.\n</li></ul>",
      "contentLength": 983,
      "flags": null,
      "enclosureUrl": "https://op3.dev/e/https://pscrb.fm/rss/p/https://cdn.changelog.com/uploads/friends/128/changelog--friends-128.mp3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Joe Rogan Experience #2454 - Robert Malone, MD",
      "url": "https://www.youtube.com/watch?v=qFwiXyZHYbU",
      "date": 1771005657,
      "author": "PowerfulJRE",
      "guid": 44815,
      "unread": true,
      "content": "<article>Robert W. Malone, MD, MS, is a virologist and immunologist and an original inventor of mRNA delivery and vaccination as a technology, DNA vaccination, and multiple non-viral DNA and RNA/mRNA platform delivery technologies. He serves on the Centers for Disease Control and Prevention’s Advisory Committee on Immunization Practices and is the author of multiple books, the most recent of which is “PsyWar: Enforcing the New World Order,” co-written with his wife, Dr. Jill Glasspool Malone. The Drs. Malone are the founders of the Malone Institute, which focuses on issues related to government, the biological sciences, and medicine.\n\nhttps://www.skyhorsepublishing.com/9781510782952/psywar/\nhttps://www.malone.news\nhttps://www.malonebroadcasting.com\nhttps://www.maloneinstitute.org\nhttps://www.rwmalonemd.com\n\nPerplexity: Download the app or ask Perplexity anything at https://pplx.ai/rogan.</article>",
      "contentLength": 897,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/qFwiXyZHYbU?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Rethinking Notebooks Powered by AI",
      "url": "https://podcasters.spotify.com/pod/show/mlops/episodes/Rethinking-Notebooks-Powered-by-AI-e3f1smp",
      "date": 1771005633,
      "author": "Demetrios",
      "guid": 44801,
      "unread": true,
      "content": "<p> is a Founding Engineer at <a href=\"https://marimo.io/\" target=\"_blank\" rel=\"ugc noopener noreferrer\">marimo</a>, working on reinventing Python notebooks as reactive, reproducible, interactive, and Git-friendly environments for data workflows and AI prototyping. He helps build the core marimo notebook platform, pushing its reactive execution model, UI interactivity, and integration with modern development and AI tooling so that notebooks behave like dependable, shareable programs and apps rather than error-prone scratchpads.</p><p>Vincent Warmerdam joins Demetrios fresh off marimo’s acquisition by Weights &amp; Biases—and makes a bold claim: notebooks as we know them are outdated.</p><p>They talk Molab (GPU-backed, cloud-hosted notebooks), LLMs that don’t just chat but actually fix your SQL and debug your code, and why most data folks are consuming tools instead of experimenting. Vincent argues we should stop treating notebooks like static scratchpads and start treating them like dynamic apps powered by AI.</p><p>It’s a conversation about rethinking workflows, reclaiming creativity, and not outsourcing your brain to the model.</p><p>Vincent is a senior data professional who worked as an engineer, researcher, team lead, and educator in the past. You might know him from tech talks with an attempt to defend common sense over hype in the data space. He is especially interested in understanding algorithmic systems so that one may prevent failure. As such, he has always had a preference to keep calm and check the dataset before flowing tonnes of tensors. He currently works at marimo, where he spends his time rethinking everything related to Python notebooks.</p><p>~~~~~~~~ ✌️Connect With Us ✌️ ~~~~~~~</p><p>[00:00] Context in Notebooks</p><p>[00:24] Acquisition and Team Continuity</p><p>[04:43] Coding Agent Conference Announcement!</p><p>[05:56] Hyperbolic GPU Cloud Ad</p><p>[06:54] marimo and W&amp;B Synergies</p><p>[09:31] marimo Cloud Code Support</p><p>[12:59] Hardest Code to Generate</p><p>[16:22] Trough of Disillusionment</p><p>[20:38] Agent Interaction in Notebooks</p>",
      "contentLength": 1933,
      "flags": null,
      "enclosureUrl": "https://anchor.fm/s/174cb1b8/podcast/play/115454105/https%3A%2F%2Fd3ctxlq1ktw2nl.cloudfront.net%2Fstaging%2F2026-1-13%2F418036639-44100-2-1cf8d7510cce7.mp3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Ask Me Anything with Robert Lawrence Kuhn (Part III)",
      "url": "https://www.youtube.com/watch?v=DjtU0WICsbw",
      "date": 1770998420,
      "author": "Closer To Truth",
      "guid": 44756,
      "unread": true,
      "content": "<article>Robert Lawrence Kuhn answers questions submitted by viewers including: Which Closer To Truth guests have influenced him the most? What are his thoughts on the single greatest threat to humanity? Did the universe have a beginning? And many more.\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.</article>",
      "contentLength": 566,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/DjtU0WICsbw?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "The crisis whisperer: how Adam Tooze makes sense of our bewildering age",
      "url": "",
      "date": 1770958834,
      "author": "",
      "guid": 44617,
      "unread": true,
      "content": "",
      "contentLength": 0,
      "flags": null,
      "enclosureUrl": "https://flex.acast.com/audio.guim.co.uk/2026/02/06-45708-gdn.alr.130226_ROBERT_BAIRD_ECONOMICS.mp3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Philippe, Duc d’Orléans: in the shadow of the Sun King",
      "url": "http://www.bbc.co.uk/programmes/m002q242",
      "date": 1770958800,
      "author": "",
      "guid": 44615,
      "unread": true,
      "content": "<p>Greg Jenner is joined in 17th-century France by Dr Jonathan Spangler and comedian Tom Allen to learn all about Philippe, Duc d’Orléans, Louis XIV’s younger brother. King Louis XIV is one of the most famous monarchs in French history: the man who built and presided over the glittering court at Versailles, established himself as an absolute ruler, and whose 72-year reign is still the longest in European history. But what about his younger brother, Philippe? Who was the man who grew up and lived in the shadow of the Sun King? Raised to defer to his brother at all costs, his promising military career was cut short when it seemed like he might outshine Louis. When all eyes were on him as heir to the throne, he would wear dresses to provoke shock at courtly balls. He balanced his marriage to his witty German wife, Liselotte, with a decades-long relationship with his aristocratic male lover, the Chevalier de Lorraine – and other men of the court. And he maintained an image as a louche and irresponsible courtier while increasing his personal wealth through clever financial management. This episode explores the complexities and contradictions of Philippe’s life, and examines the difficult position of second sons in royal history.</p><p>If you’re a fan of royal sibling rivalries, the gossip and glamour of the French court, and queer history, you’ll love our episode on Philippe, Duc d’Orléans.</p><p>If you want more fascinating French royals, listen to our episodes on Catherine de Medici and Marie Antoinette. And for more LGBTQ+ history, check out our episodes on heretical lesbian nun Benedetta Carlini and the Bloomsbury Group.</p><p>You’re Dead To Me is the comedy podcast that takes history seriously. Every episode, Greg Jenner brings together the best names in history and comedy to learn and laugh about the past.</p><p>Hosted by: Greg Jenner\nResearch by: Emma Mitchell\nWritten by: Dr Emmie Rose Price-Goodfellow, Dr Emma Nagouse, and Greg Jenner\nProduced by: Dr Emmie Rose Price-Goodfellow and Greg Jenner\nAudio Producer: Steve Hankey\nProduction Coordinator: Gill Huggett\nSenior Producer: Dr Emma Nagouse\nExecutive Editor: Philip Sellars</p>",
      "contentLength": 2150,
      "flags": null,
      "enclosureUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download-rss/proto/http/vpid/p0mtq4tk.mp3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Joe Rogan Experience #2453 - Evan Hafer",
      "url": "https://www.youtube.com/watch?v=y2SD_z61FRo",
      "date": 1770919267,
      "author": "PowerfulJRE",
      "guid": 44442,
      "unread": true,
      "content": "<article>Evan Hafer is a Special Forces veteran, founder, and executive chairman of Black Rifle Coffee Company, and one of the hosts of the “Black Rifle Coffee Podcast.”\n\nhttps://www.blackriflecoffee.com\nhttps://www.youtube.com/@BlackRifleCoffeeCompany\n\nPerplexity: Download the app or ask Perplexity anything at https://pplx.ai/rogan.\n\nGo to https://ROKA.com and upgrade your eyewear\n\nThis video is sponsored by BetterHelp. Visit https//BetterHelp.com/JRE</article>",
      "contentLength": 451,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/y2SD_z61FRo?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Liad Mudrik - What Living Things are Conscious?",
      "url": "https://www.youtube.com/watch?v=wkuzNzJlq_E",
      "date": 1770912086,
      "author": "Closer To Truth",
      "guid": 44391,
      "unread": true,
      "content": "<article>Follow us on X for videos, articles, and polls on life's biggest questions: https://x.com/CloserToTruth\n\nWe know we humans are conscious and we strongly suspect higher animals are as well: for example, primates, dogs, cetaceans, whales and dolphins. But how far down the phylogenetic scale does consciousness go? Do fish feel pain? Do insects have awareness? Do bacteria sense? What are the implications?\n\nSign up for a free Closer To Truth membership to receive exclusives like early access to new episodes: https://closertotruth.com/register/\n\nProfessor Liad Mudrik is a researcher at the school of psychological sciences and Sagol school of neuroscience at Tel Aviv University. Her research focuses on conscious experience, its neural mechanisms and functions.\n\nSubscribe to the Closer To Truth podcast on Apple, Spotify, or wherever you listen: https://shorturl.at/mtJP4\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.</article>",
      "contentLength": 1196,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/wkuzNzJlq_E?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Gas Town, Beads, and the Rise of Agentic Development with Steve Yegge",
      "url": "https://softwareengineeringdaily.com/2026/02/12/gas-town-beads-and-the-rise-of-agentic-development-with-steve-yegge/?utm_source=rss&utm_medium=rss&utm_campaign=gas-town-beads-and-the-rise-of-agentic-development-with-steve-yegge",
      "date": 1770890451,
      "author": "SEDaily",
      "guid": 44312,
      "unread": true,
      "content": "<p>AI-assisted programming has moved far beyond autocomplete. Large language models are now capable of editing entire codebases, coordinating long-running tasks, and collaborating across multiple systems. As these capabilities mature, the core challenge in software development is shifting away from writing code and toward orchestrating work, managing context, and maintaining shared understanding across fleets of agents.</p><p><a href=\"https://x.com/Steve_Yegge\">Steve Yegge</a> is a software engineer, writer, and industry veteran whose essays have shaped how many developers think about their work. Over the past year, Steve has been exploring the frontier of agentic software development, building tools like Beads and Gas Town to experiment with multi-agent coordination, shared memory, and AI-driven software workflows.</p><p>In this episode, Steve joins Kevin Ball to discuss the evolution of AI coding from chat-based assistance to full agent orchestration, the technical and cognitive challenges of managing fleets of agents, how concepts like task graphs and Git-backed ledgers change the nature of work, and what these shifts mean for software teams, tooling, and the future of the industry.</p>",
      "contentLength": 1147,
      "flags": null,
      "enclosureUrl": "https://traffic.megaphone.fm/SED8427767061.mp3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "OpenClaw: The Viral AI Agent that Broke the Internet - Peter Steinberger | Lex Fridman Podcast #491",
      "url": "https://www.youtube.com/watch?v=YFjfBk8HI5o",
      "date": 1770865623,
      "author": "Lex Fridman",
      "guid": 44271,
      "unread": true,
      "content": "<article>Peter Steinberger is the creator of OpenClaw, an open-source AI agent framework that's the fastest-growing project in GitHub history.\nThank you for listening ❤ Check out our sponsors: https://lexfridman.com/sponsors/ep491-sb\nSee below for timestamps, transcript, and to give feedback, submit questions, contact Lex, etc.\n\n*Transcript:*\nhttps://lexfridman.com/peter-steinberger-transcript\n\n*CONTACT LEX:*\n*Feedback* - give feedback to Lex: https://lexfridman.com/survey\n*AMA* - submit questions, videos or call-in: https://lexfridman.com/ama\n*Hiring* - join our team: https://lexfridman.com/hiring\n*Other* - other ways to get in touch: https://lexfridman.com/contact\n\n*EPISODE LINKS:*\nPeter's X: https://x.com/steipete\nPeter's GitHub: https://github.com/steipete\nPeter's Website: https://steipete.com\nPeter's LinkedIn: https://www.linkedin.com/in/steipete\nOpenClaw Website: https://openclaw.ai\nOpenClaw GitHub: https://github.com/openclaw/openclaw\nOpenClaw Discord: https://discord.gg/openclaw\n\n*SPONSORS:*\nTo support this podcast, check out our sponsors &amp; get discounts:\n*Perplexity:* AI-powered answer engine.\nGo to https://lexfridman.com/s/perplexity-ep491-sb\n*Quo:* Phone system (calls, texts, contacts) for businesses.\nGo to https://lexfridman.com/s/quo-ep491-sb\n*CodeRabbit:* AI-powered code reviews.\nGo to https://lexfridman.com/s/coderabbit-ep491-sb\n*Fin:* AI agent for customer service.\nGo to https://lexfridman.com/s/fin-ep491-sb\n*Blitzy:* AI agent for large enterprise codebases.\nGo to https://lexfridman.com/s/blitzy-ep491-sb\n*Shopify:* Sell stuff online.\nGo to https://lexfridman.com/s/shopify-ep491-sb\n*LMNT:* Zero-sugar electrolyte drink mix.\nGo to https://lexfridman.com/s/lmnt-ep491-sb\n\n*OUTLINE:*\n0:00 - Episode highlight\n1:30 - Introduction\n5:36 - OpenClaw origin story\n8:55 - Mind-blowing moment\n18:22 - Why OpenClaw went viral\n22:19 - Self-modifying AI agent\n27:04 - Name-change drama\n44:15 - Moltbook saga\n52:34 - OpenClaw security concerns\n1:01:14 - How to code with AI agents\n1:32:09 - Programming setup\n1:38:52 - GPT Codex 5.3 vs Claude Opus 4.6\n1:47:59 - Best AI agent for programming\n2:09:59 - Life story and career advice\n2:13:56 - Money and happiness\n2:17:49 - Acquisition offers from OpenAI and Meta\n2:34:58 - How OpenClaw works\n2:46:17 - AI slop\n2:52:20 - AI agents will replace 80% of apps\n3:00:57 - Will AI replace programmers?\n3:12:57 - Future of OpenClaw community\n\n*PODCAST LINKS:*\n- Podcast Website: https://lexfridman.com/podcast\n- Apple Podcasts: https://apple.co/2lwqZIr\n- Spotify: https://spoti.fi/2nEwCF8\n- RSS: https://lexfridman.com/feed/podcast/\n- Podcast Playlist: https://www.youtube.com/playlist?list=PLrAXtmErZgOdP_8GztsuKi9nrraNbKKp4\n- Clips Channel: https://www.youtube.com/lexclips\n\n*SOCIAL LINKS:*\n- X: https://x.com/lexfridman\n- Instagram: https://instagram.com/lexfridman\n- TikTok: https://tiktok.com/@lexfridman\n- LinkedIn: https://linkedin.com/in/lexfridman\n- Facebook: https://facebook.com/lexfridman\n- Patreon: https://patreon.com/lexfridman\n- Telegram: https://t.me/lexfridman\n- Reddit: https://reddit.com/r/lexfridman</article>",
      "contentLength": 3079,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/YFjfBk8HI5o?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "The Sex Life of Charles II",
      "url": "https://shows.acast.com/dansnowshistoryhit/episodes/the-sex-life-of-charles-ii",
      "date": 1770865200,
      "author": "",
      "guid": 44260,
      "unread": true,
      "content": "<p>He had at least 14 known mistresses and a hoard of illegitimate children; Charles II's private life was as politically charged as it was scandalous. He presided over the Restoration court, a world of excess, intrigue, gambling, gossip and a lot of sex. Dan is joined by the host of the Betwixt the Sheets podcast, Dr Kate Lister, to explore the salacious side of Restoration England and examine how power, pleasure, and reputation collided at court.</p><p>A warning that this episode isn't suitable for children!&nbsp;</p><p>Produced by Mariana Des Forges and edited by Dougal Patmore.</p>",
      "contentLength": 567,
      "flags": null,
      "enclosureUrl": "https://sphinx.acast.com/p/acast/s/dansnowshistoryhit/e/69837a8037d752e9a34e003a/media.mp3?tk=eyJ0ayI6ImRlZmF1bHQiLCJhZHMiOnRydWUsInNwb25zIjp0cnVlLCJzdGF0dXMiOiJwdWJsaWMifQ==&sig=JaMnV-snVt9jkDxgilWc8ALlpKNsKJbBKRFpLH-1lBU",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "The Invasion of Persia | Alexander the Great",
      "url": "https://shows.acast.com/the-ancients/episodes/the-invasion-of-persia-alexander-the-great",
      "date": 1770865200,
      "author": "",
      "guid": 44256,
      "unread": true,
      "content": "<p>In spring 334 BC, a young Macedonian king sets out to conquer the Persian Empire.</p><p>Tristan Hughes and Dr Adrian Goldsworthy explore Alexander the Great’s early campaigns, from the daring crossing into Asia to incredible victories. They discuss Alexander's strategic genius, respect toward Persian royalty, and how these triumphs forged his path to legend.</p><p>Presented by Tristan Hughes. Audio editor is Aidan Lonergan, the producer is Joseph Knight. The senior producer is Anne-Marie Luff.</p><p>All music courtesy of Epidemic Sounds</p><p><em>The Ancients is a History Hit podcast.</em></p><p>You can take part in our listener survey&nbsp;<a href=\"https://insights.historyhit.com/history-hit-podcast-always-on\" rel=\"noopener noreferrer\" target=\"_blank\"></a></p>",
      "contentLength": 603,
      "flags": null,
      "enclosureUrl": "https://sphinx.acast.com/p/acast/s/the-ancients/e/69864d259a20cfbf33d6d3ed/media.mp3?tk=eyJ0ayI6ImRlZmF1bHQiLCJhZHMiOnRydWUsInNwb25zIjp0cnVlLCJzdGF0dXMiOiJwdWJsaWMifQ==&sig=Iz7aZ9XQ06TzVMA9fkM4zhCHP8IKDhXqR5j21uu8L_w",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "643. Rome’s Greatest Enemy: Carthage Destroyed (Part 4)",
      "url": "",
      "date": 1770854700,
      "author": "",
      "guid": 44231,
      "unread": true,
      "content": "",
      "contentLength": 0,
      "flags": null,
      "enclosureUrl": "https://pdst.fm/e/traffic.megaphone.fm/GLT7699509622.mp3?updated=1770914051",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Building the machine that builds the machine (Interview)",
      "url": "https://changelog.com/podcast/676",
      "date": 1770841800,
      "author": "",
      "guid": 44173,
      "unread": true,
      "content": "<p>Paul Dix joins us to discuss the InfluxDB co-founder’s journey adapting to an agentic world. Paul sent his AI coding agents on various real-world side quests and shares all his findings: what’s going to prod, what’s not, and why he’s (at least for a bit) back to coding by hand.</p><p><a href=\"https://changelog.com/++\" rel=\"payment\">Changelog++</a> members save 4 minutes on this episode because they made the ads disappear. Join today!</p><ul><li><a href=\"https://namespace.so\">Namespace</a> – Speed up your development and testing workflows using your existing tools. (Much) faster GitHub actions, Docker builds, and more. At an unbeatable price.\n</li><li><a href=\"https://www.tigerdata.com\">Tiger Data</a> – Postgres for Developers, devices, and agents The data platform trusted by hundreds of thousands from IoT to Web3 to AI and more.\n</li><li><a href=\"https://fly.io/\">Fly.io</a> – <strong>The home of Changelog.com</strong> — Deploy your apps close to your users — global Anycast load-balancing, zero-configuration private networking, hardware isolation, and instant WireGuard VPN connections. Push-button deployments that scale to thousands of instances. <a href=\"https://fly.io/speedrun/\">Check out the speedrun</a> to get started in minutes.\n</li></ul>",
      "contentLength": 1020,
      "flags": null,
      "enclosureUrl": "https://op3.dev/e/https://pscrb.fm/rss/p/https://cdn.changelog.com/uploads/podcast/676/the-changelog-676.mp3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Joe Rogan Experience #2452 - Roger Avary",
      "url": "https://www.youtube.com/watch?v=CH5JoJ_-hic",
      "date": 1770832810,
      "author": "PowerfulJRE",
      "guid": 44113,
      "unread": true,
      "content": "<article>Roger Avary is a director, producer, and Academy Award-winning screenwriter known for “Pulp Fiction,” which he co-wrote with Quentin Tarantino, as well as “The Rules of Attraction” and “Killing Zoe.” He is the co-host, along with Tarantino, of “The Video Archives Podcast.”\n\nhttps://www.youtube.com/@videoarchivespodcast\nhttps://www.patreon.com/videoarchives\nhttps://www.avary.com\n\nPerplexity: Download the app or ask Perplexity anything at https://pplx.ai/rogan.\n\nTry ZipRecruiter FOR FREE at https://ziprecruiter.com/rogan\n\nVisible. Live in the know.&nbsp;https://www.Visible.com</article>",
      "contentLength": 593,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/CH5JoJ_-hic?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Eleonore Stump - How Does Salvation Work?",
      "url": "https://www.youtube.com/watch?v=g3B8Ef4ZSDk",
      "date": 1770825656,
      "author": "Closer To Truth",
      "guid": 44056,
      "unread": true,
      "content": "<article>Shop the Closer To Truth merch store for items like hoodies, T-shirts, mugs, and more: https://bit.ly/3P2ogje\n\nThe Christian claim is that salvation is the ultimate goal of human life. But what literally is salvation and how does one obtain it? How to comprehend each element of the salvation process and the way they work together? One need not be a Christian to appreciate the philosophical conundrums.\n\nMake a donation of any amount to help Closer To Truth continue exploring the world's deepest questions: https://closertotruth.com/donate/\n\nEleonore Stump is an American philosopher and the Robert J. Henle Professor of Philosophy at Saint Louis University, where she has taught since 1992.\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.</article>",
      "contentLength": 1016,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/g3B8Ef4ZSDk?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Terrence Deacon - Philosophy of Evolutionary Cognition, Emotion, & Consciousness",
      "url": "https://www.youtube.com/watch?v=Xh2SncNB8vU",
      "date": 1770825649,
      "author": "Closer To Truth",
      "guid": 44055,
      "unread": true,
      "content": "<article>Follow Closer To Truth on Instagram for daily videos, updates, and announcements: https://www.instagram.com/closertotruth/\n\nWhat can evolution reveal about the developmental history of thinking and feeling? How did cognition and emotion (affect) co-develop over evolutionary time? Moreover, what can we learn from evolution about the mystery of consciousness?\n\nMake a tax-deductible donation of any amount to help support Closer To Truth continue making content like this: https://shorturl.at/OnyRq\n\nTerrence William Deacon is an American neuroanthropologist. He taught at Harvard for eight years, relocated to Boston University in 1992, and is currently Professor of Anthropology and member of the Cognitive Science Faculty at the University of California, Berkeley.\n\nSubscribe to the Closer To Truth podcast on Apple, Spotify, or wherever you listen: https://shorturl.at/mtJP4\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.</article>",
      "contentLength": 1200,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/Xh2SncNB8vU?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "From the archive: Do we need a new theory of evolution?",
      "url": "",
      "date": 1770786007,
      "author": "",
      "guid": 43906,
      "unread": true,
      "content": "",
      "contentLength": 0,
      "flags": null,
      "enclosureUrl": "https://flex.acast.com/audio.guim.co.uk/2026/02/04-47883-gdn.alr.110226.NA.archive_STEPHEN_BURANYI_EVOLUTION.mp3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Greatest Paintings: The Ghost of Spain – Velázquez’s Las Meninas",
      "url": "",
      "date": 1770768300,
      "author": "",
      "guid": 43876,
      "unread": true,
      "content": "",
      "contentLength": 0,
      "flags": null,
      "enclosureUrl": "https://pdst.fm/e/traffic.megaphone.fm/GLT3233503404.mp3?updated=1770724169",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Software Engineering in the Age of Coding Agents: Testing, Evals, and Shipping Safely at Scale",
      "url": "https://podcasters.spotify.com/pod/show/mlops/episodes/Software-Engineering-in-the-Age-of-Coding-Agents-Testing--Evals--and-Shipping-Safely-at-Scale-e3eta9q",
      "date": 1770746407,
      "author": "Demetrios",
      "guid": 43763,
      "unread": true,
      "content": "<p> is the Founding Engineer at <a href=\"https://7ai.com/\" target=\"_blank\" rel=\"ugc noopener noreferrer\">7AI</a>, where he’s focused on building and scaling the company’s agentic AI-driven cybersecurity platform — developing autonomous AI agents that triage alerts, investigate threats, enrich security data, and enable end-to-end automated security operations so human teams can focus on higher-value strategic work.</p><p>Software Engineering in the Age of Coding Agents: Testing, Evals, and Shipping Safely at Scale // MLOps Podcast #361 with Ereli Eran, Founding Engineer at 7AI</p><p>A conversation on how AI coding agents are changing the way we build and operate production systems. We explore the practical boundaries between agentic and deterministic code, strategies for shared responsibility across models, engineering teams, and customers, and how to evaluate agent performance at scale. Topics include production quality gates, safety and cost tradeoffs, managing long-tail failures, and deployment patterns that let you ship agents with confidence.</p><p>Ereli Eran is a founding engineer at 7AI, where he builds agentic AI systems for security operations and the production infrastructure that powers them. His work spans the full stack - from designing experiment frameworks for LLM-based alert investigation to architecting secure multi-tenant systems with proper authentication boundaries. Previously, he worked in data science and software engineering roles at Stripe, VMware Carbon Black, and was an early employee of Ravelin and Normalyze.</p><p>~~~~~~~~ ✌️Connect With Us ✌️ ~~~~~~~</p><p>[00:00] Language Sensitivity in Reasoning</p><p>[00:25] Value of Claude Code</p><p>[01:54] AI in Security Workflows</p><p>[06:21] Agentic Systems Failures</p><p>[12:50] Progressive Disclosure in Voice Agents</p><p>[16:39] LLM vs Classic ML</p><p>[19:44] Hybrid Approach to Fraud</p><p>[25:58] Debugging with User Feedback</p><p>[42:07] LLM Security Workflow</p><p>[45:10] Shared Memory in Security</p><p>[49:11] Common Agent Failure Modes</p>",
      "contentLength": 1878,
      "flags": null,
      "enclosureUrl": "https://anchor.fm/s/174cb1b8/podcast/play/115304186/https%3A%2F%2Fd3ctxlq1ktw2nl.cloudfront.net%2Fstaging%2F2026-1-10%2F417834561-44100-2-32c1411bf9507.mp3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Joe Rogan Experience #2451 - Cheryl Hines",
      "url": "https://www.youtube.com/watch?v=0sMrvv53e9Y",
      "date": 1770746402,
      "author": "PowerfulJRE",
      "guid": 43764,
      "unread": true,
      "content": "<article>Cheryl Hines is an Emmy Award-nominated actress, director, producer, and comedian. While she is best known for her role as Cheryl David on the HBO series “Curb Your Enthusiasm,” Hines has appeared in numerous films and television series over a career spanning more than 30 years, and is married to U.S. Secretary of Health and Human Services Robert F. Kennedy Jr.  Her book, “Unscripted,” is available now.\n\nhttps://www.skyhorsepublishing.com/9781944824365/unscripted/\n\nPerplexity: Download the app or ask Perplexity anything at https://pplx.ai/rogan.\n\nGet a free welcome kit with your first subscription of AG1 at https://drinkag1.com/joerogan</article>",
      "contentLength": 652,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/0sMrvv53e9Y?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Àlex Gómez-Marín - The Science of Consciousness",
      "url": "https://www.youtube.com/watch?v=PFDCsN7QMuo",
      "date": 1770739236,
      "author": "Closer To Truth",
      "guid": 43705,
      "unread": true,
      "content": "<article>Contribute what you can to support Closer To Truth: https://closertotruth.com/donate/\n\nAlex Gómez-Marín is a Spanish physicist turned neuroscientist. He holds a PhD in theoretical physics and a Masters in biophysics from the University of Barcelona. He was a research fellow at the EMBL-CRG Centre for Genomic Regulation and at the Champalimaud Centre for the Unknown in Lisbon. His research spans from the origins of the arrow of time in inert systems, to the neurobiology of action-perception in living organisms such as flies, worms, mice, and humans.\n\nLike us on Facebook for daily videos, updates, announcements, and much more: https://shorturl.at/tak4l\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.</article>",
      "contentLength": 982,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/PFDCsN7QMuo?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Does 2+2 really equal 4?",
      "url": "https://www.youtube.com/shorts/yqLowdJsLj4",
      "date": 1770726690,
      "author": "Closer To Truth",
      "guid": 43648,
      "unread": true,
      "content": "<article>Is \"2+2=4\" the absolute truth? Philosopher of science Silvia Jonas unpacks non-naturalist metaphysics, ineffability, and what can be proved in the lab. Watch the full conversation here: https://www.youtube.com/watch?v=6ejqou2Dd9E</article>",
      "contentLength": 229,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/yqLowdJsLj4?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Python 3.14 with Łukasz Langa",
      "url": "https://softwareengineeringdaily.com/2026/02/10/python-3-14-with-lukasz-langa/?utm_source=rss&utm_medium=rss&utm_campaign=python-3-14-with-lukasz-langa",
      "date": 1770717618,
      "author": "SEDaily",
      "guid": 43589,
      "unread": true,
      "content": "<p><a href=\"https://www.python.org/\">Python</a> 3.14 is here and continues Python’s evolution toward greater performance, scalability, and usability. The new release formally supports free-threaded, no-GIL mode, introduces template string literals, and implements deferred evaluation of type annotations. It also includes new debugging and profiling tools, along with many other features.</p><p><a href=\"https://x.com/llanga\">Łukasz Langa</a> is the CPython Developer in Residence at the Python Software Foundation, and he joins Sean Falconer to discuss the 3.14 release, the future of free threading, type system improvements, Python’s growing role in AI, and how the language continues to evolve while maintaining its commitment to backward compatibility.</p><div><p>Sean’s been an academic, startup founder, and Googler. He has published works covering a wide range of topics from AI to quantum computing. Currently, Sean is an AI Entrepreneur in Residence at Confluent where he works on AI strategy and thought leadership. You can connect with Sean on LinkedIn.</p></div>",
      "contentLength": 977,
      "flags": null,
      "enclosureUrl": "https://traffic.megaphone.fm/SED4837519291.mp3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Vouch for an open source web of trust (News)",
      "url": "https://changelog.com/news/180",
      "date": 1770663600,
      "author": "",
      "guid": 43432,
      "unread": true,
      "content": "<p>Mitchell Hashimoto’s trust management system for open source, Nicholas Carlini has a team of Claudes build a C compiler, Stephan Schwab recounts the history of attempted developer replacement, NanClaw is an alternative to OpenClaw, and Sophie Koonin can’t wrap her head around so many people going so hard on LLM-generated code.</p><p><a href=\"https://changelog.com/++\" rel=\"payment\">Changelog++</a> members save 1 minute on this episode because they made the ads disappear. Join today!</p>",
      "contentLength": 430,
      "flags": null,
      "enclosureUrl": "https://op3.dev/e/https://pscrb.fm/rss/p/https://cdn.changelog.com/uploads/news/180/changelog-news-180.mp3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Ernan McMullin - Did God Create Time?",
      "url": "https://www.youtube.com/watch?v=pqUIUG9gCqQ",
      "date": 1770652887,
      "author": "Closer To Truth",
      "guid": 43381,
      "unread": true,
      "content": "<article>Like us on Facebook for daily videos, updates, announcements, and much more: https://shorturl.at/tak4l\n\nGod and time are two huge mysteries. Relating them probes the nature of God, and perhaps even the existence of God. God, in order to be Creator, must create everything other than God’s own self, which includes time. But if God is in time and experiences its passage, then how could God have created time? Also Leibniz’s question: “Why didn’t God create the world sooner?”\n\nWear your support for the show with a Closer To Truth merchandise purchase: https://bit.ly/3P2ogje\n\nErnan McMullin was an Irish philosopher who last served as the O’Hara Professor of Philosophy Emeritus at the University of Notre Dame. He was an internationally respected philosopher of science who has written and lectured extensively on subjects ranging from the relationship between cosmology and theology, to the role of values in understanding science, to the impact of Darwinism on Western religious thought. He is the only person to ever hold the presidency of four of the major US philosophical associations. He was an expert on the life of Galileo.\n\nDonate to help Closer To Truth continue exploring the world's deepest questions without the need for paywalls: https://closertotruth.com/donate/\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.</article>",
      "contentLength": 1614,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/pqUIUG9gCqQ?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Walking into disaster: the narcotrafficking scandal that blew up the BVI",
      "url": "",
      "date": 1770613250,
      "author": "",
      "guid": 43233,
      "unread": true,
      "content": "",
      "contentLength": 0,
      "flags": null,
      "enclosureUrl": "https://flex.acast.com/audio.guim.co.uk/2026/02/04-46586-gdn.alr.090226.NA_EDWARD_SIDDIONS_BVI.mp3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "The Great Famine",
      "url": "https://shows.acast.com/dansnowshistoryhit/episodes/the-great-famine",
      "date": 1770606000,
      "author": "",
      "guid": 43226,
      "unread": true,
      "content": "<p>In the late 19th century, Ireland suffered a potato blight that became a mass catastrophe. Today, we explore the conditions that left millions vulnerable, and assess the role of the British government in shaping the crisis.</p><p>For this, we're joined by Professor Christine Kinealy, founding Director of Ireland's Great Hunger Institute at Quinnipiac University.</p><p>Produced by James Hickmann and edited by Dougal Patmore.</p>",
      "contentLength": 413,
      "flags": null,
      "enclosureUrl": "https://sphinx.acast.com/p/acast/s/dansnowshistoryhit/e/697cccb52d4292666accaa5d/media.mp3?tk=eyJ0ayI6ImRlZmF1bHQiLCJhZHMiOnRydWUsInNwb25zIjp0cnVlLCJzdGF0dXMiOiJwdWJsaWMifQ==&sig=0hwsO299wxPW3Imzfw-l8C7-fnMkGulUKTsdzZaB7zc",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "642. Rome’s Greatest Enemy: Bloodbath in Africa (Part 3)",
      "url": "",
      "date": 1770595500,
      "author": "",
      "guid": 43215,
      "unread": true,
      "content": "",
      "contentLength": 0,
      "flags": null,
      "enclosureUrl": "https://pdst.fm/e/traffic.megaphone.fm/GLT1285518636.mp3?updated=1770658202",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Galen Strawson - Panpsychism: Arguing Pro and Con",
      "url": "https://www.youtube.com/watch?v=ysA2MszmRHA",
      "date": 1770566478,
      "author": "Closer To Truth",
      "guid": 43123,
      "unread": true,
      "content": "<article>Shop the Closer To Truth merch store for items like hoodies, T-shirts, mugs, and more: https://bit.ly/3P2ogje\n\nPanpsychism is the theory that consciousness is irreducible and exists fundamentally at the foundations of reality. Panpsychism forms include ‘micropsychism,’ where fundamental particles or fields are in some sense conscious, and ‘Cosmopsychism,’ where the entire universe is in some sense conscious. What are the arguments for and against Panpsychism like the ‘combination problem’?\n\nMake a donation of any amount to help Closer To Truth continue exploring the world's deepest questions: https://closertotruth.com/donate/\n\nGalen John Strawson is a British analytic philosopher and literary critic who works primarily on philosophy of mind, metaphysics, John Locke, David Hume, Immanuel Kant and Friedrich Nietzsche.\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.</article>",
      "contentLength": 1161,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/ysA2MszmRHA?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "How to Write Cuneiform with Dr. Irving Finkel",
      "url": "https://shows.acast.com/the-ancients/episodes/how-to-write-cuneiform",
      "date": 1770519600,
      "author": "",
      "guid": 43033,
      "unread": true,
      "content": "<p>More than 5,000 years ago, a revolutionary script emerged in the fertile lands of Mesopotamia that would transform how people counted, governed, worshipped and told stories. This was cuneiform, the world’s earliest known writing system.</p><p>In this episode of , Tristan Hughes is joined by Dr Irving Finkel to uncover how cuneiform actually worked and how you would write it yourself. From humble beginnings as simple pictograms tracking beer and grain, to the wedge-shaped signs that recorded myths, laws and epic tales long before the Bible, this episode explores how cuneiform spread across Sumer, Babylon, Assyria and Persia — and why these clay tablets remain one of archaeology’s richest windows into the ancient world.</p><p><strong>The World's Oldest Letters</strong></p><p>Presented by Tristan Hughes. Audio editor is Aidan Lonergan. The producer is Joseph Knight. The senior producer is Anne-Marie Luff.</p><p>All music courtesy of Epidemic Sounds</p><p><em>The Ancients is a History Hit podcast.</em></p><p>You can take part in our listener survey&nbsp;<a href=\"https://insights.historyhit.com/history-hit-podcast-always-on\" rel=\"noopener noreferrer\" target=\"_blank\"></a></p>",
      "contentLength": 1000,
      "flags": null,
      "enclosureUrl": "https://sphinx.acast.com/p/acast/s/the-ancients/e/69821a94c8310ac486f4b727/media.mp3?tk=eyJ0ayI6ImRlZmF1bHQiLCJhZHMiOnRydWUsInNwb25zIjp0cnVlLCJzdGF0dXMiOiJwdWJsaWMifQ==&sig=XKct2sMstHp1HRgRqdAHeDSdppl27iHZ2zzYssHEyKk",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Science vs. religion?",
      "url": "https://www.youtube.com/shorts/u6rnjOnU7yk",
      "date": 1770494437,
      "author": "Closer To Truth",
      "guid": 42980,
      "unread": true,
      "content": "<article>Science and religions have been at odds for centuries, but are they inherently incompatible? We ask philosopher William Lane Craig, who is also a evangelical Christian, why science is so important.</article>",
      "contentLength": 197,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/u6rnjOnU7yk?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Denis Noble - Philosophy of Extended Evolutionary Synthesis",
      "url": "https://www.youtube.com/watch?v=ROWcCjcQXIk",
      "date": 1770480039,
      "author": "Closer To Truth",
      "guid": 42931,
      "unread": true,
      "content": "<article>Subscribe to the Closer To Truth podcast on Apple, Spotify, or wherever you get your podcasts: https://shorturl.at/mtJP4\n\nWhat is the extended evolutionary synthesis (EES) and why better? Includes multilevel selection, transgenerational epigenetic inheritance, niche construction, evolvability, and ideas from evolutionary developmental biology. Why is EES controversial?\n\nDenis Noble CBE FRS FMedSci MAE is a British physiologist and biologist who held the Burdon Sanderson Chair of Cardiovascular Physiology at the University of Oxford from 1984 to 2004 and was appointed professor emeritus and co-director of computational physiology.\n\nMake a donation to Closer To Truth to help us continue exploring the world's deepest questions without the need for paywalls: https://shorturl.at/OnyRq\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.</article>",
      "contentLength": 1112,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/ROWcCjcQXIk?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "It's a renaissance woman's world (Friends)",
      "url": "https://changelog.com/friends/127",
      "date": 1770413400,
      "author": "",
      "guid": 42789,
      "unread": true,
      "content": "<p>Amal Hussein returns to tell us all about her new role at Istari, what life is like outside the web browser, how she’s helping ambitious orgs in aerospace, what the SDLC looks like in 2026, and a whole lot more. Wait, moon vacuums?!</p><p><a href=\"https://changelog.com/++\" rel=\"payment\">Changelog++</a> members get a bonus 21 minutes at the end of this episode and zero ads. Join today!</p><ul><li><a href=\"https://www.tigerdata.com\">Tiger Data</a> – Postgres for Developers, devices, and agents The data platform trusted by hundreds of thousands from IoT to Web3 to AI and more.\n</li><li><a href=\"https://namespace.so\">Namespace</a> – Speed up your development and testing workflows using your existing tools. (Much) faster GitHub actions, Docker builds, and more. At an unbeatable price.\n</li><li><a href=\"https://nordlayer.com/thechangelog\">NordLayer</a> – Toggle-ready network security for modern businesses. Get an exclusive offer: up to 22% off NordLayer yearly plans plus 10% on top with the coupon code . Try it risk-free with a 14-day money-back guarantee at <a href=\"https://nordlayer.com/thechangelog\">nordlayer.com/thechangelog</a></li></ul>",
      "contentLength": 889,
      "flags": null,
      "enclosureUrl": "https://op3.dev/e/https://pscrb.fm/rss/p/https://cdn.changelog.com/uploads/friends/127/changelog--friends-127.mp3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Ask Me Anything with Robert Lawrence Kuhn (Part II)",
      "url": "https://www.youtube.com/watch?v=uYBiIgNUVuU",
      "date": 1770411658,
      "author": "Closer To Truth",
      "guid": 42766,
      "unread": true,
      "content": "<article>Robert Kawrence Kuhn answers fan questions on theories of consciousness, cognitive computation, theism, determinism, and more.\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.</article>",
      "contentLength": 448,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/uYBiIgNUVuU?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Physical AI: Teaching Machines to Understand the Real World",
      "url": "https://podcasters.spotify.com/pod/show/mlops/episodes/Physical-AI-Teaching-Machines-to-Understand-the-Real-World-e3entui",
      "date": 1770404502,
      "author": "Demetrios",
      "guid": 42739,
      "unread": true,
      "content": "<p> is the Co-Founder and CTO at Archetype AI, working on physical AI foundation models that understand and reason over real-world sensor data.</p><p>Physical AI: Teaching Machines to Understand the Real World // MLOps Podcast #360 with Nick Gillian, Co-Founder and CTO of Archetype AI</p><p>As AI moves beyond the cloud and simulation, the next frontier is Physical AI: systems that can perceive, understand, and act within real-world environments in real time. In this conversation, Nick Gillian, Co-Founder and CTO of Archetype AI, explores what it actually takes to turn raw sensor and video data into reliable, deployable intelligence.</p><p>Drawing on his experience building Google’s Soli and Jacquard and now leading development of Newton, a foundational model for Physical AI, Nick discusses how real-time physical understanding changes what’s possible across safety monitoring, infrastructure, and human–machine interaction. He’ll share lessons learned translating advanced research into products that operate safely in dynamic environments, and why many organizations underestimate the challenges and opportunities of AI in the physical world.</p><p>Nick Gillian, Ph.D., is Co-Founder and CTO of Archetype AI with over 15 years of experience turning advanced AI and interaction research into real-world products. At Archetype, he leads the AI and engineering teams behind Newton—a first-of-its-kind Physical AI foundational model that can perceive, understand, and reason about the physical world. Before co-founding Archetype, Nick was a Senior Staff Machine Learning Engineer at Google and a researcher at MIT, where he developed AI and ML methods for real-time sensor understanding. At Google’s Advanced Technology and Projects group, he led machine learning research that powered breakthrough products like Soli radar and Jacquard, and helped advance sensing algorithms across Pixel, Nest, and wearable devices.</p><p>~~~~~~~~ ✌️Connect With Us ✌️ ~~~~~~~</p><p>Timestamps:[00:00] Physical Agent Framework[00:56] Physical AI Clarification[06:53] Building a Repair Model[12:41] World Models and LLMs[17:17] Data Weighting Strategies[24:19] Data Diversity vs Quantity[38:30] R&amp;D and Product Creation[41:22] Construction Site Data Shipping[50:33] Wrap up</p>",
      "contentLength": 2241,
      "flags": null,
      "enclosureUrl": "https://anchor.fm/s/174cb1b8/podcast/play/115127698/https%3A%2F%2Fd3ctxlq1ktw2nl.cloudfront.net%2Fstaging%2F2026-1-6%2F417599641-44100-2-b7037fd434326.mp3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Can the eye solve the hard problem of consciousness?",
      "url": "https://www.youtube.com/shorts/qb9Joo_U2V0",
      "date": 1770404454,
      "author": "Closer To Truth",
      "guid": 42727,
      "unread": true,
      "content": "<article>Does our vision give us unique insights into a physicalist theory of consciousness? Professor Naotsugu Tsuchiya shares his research on how the cornea, the clear dome shaped part of our eye, can be used with Integrated Information Theory, one of the currently leading theories of consciousness to tackle the hard problem of consciousness.</article>",
      "contentLength": 337,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/qb9Joo_U2V0?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Joe Rogan Experience #2450 - Tommy Wood",
      "url": "https://www.youtube.com/watch?v=UPfN2G0RyQM",
      "date": 1770400829,
      "author": "PowerfulJRE",
      "guid": 42710,
      "unread": true,
      "content": "<article>Tommy Wood, PhD, is a neuroscientist and athletic performance coach. He is a host of the “Better Brain Fitness” podcast and author of “The Stimulated Mind: Future-Proof Your Brain from Dementia and Stay Sharp at Any Age,” which will be released March 24 and is available for preorder now.\n\nhttps://www.penguinrandomhouse.com/books/751292/the-stimulated-mind-by-dr-tommy-wood/\nhttps://www.thestimulatedmind.com\nhttps://www.betterbrain.fitness\nhttps://www.drtommywood.com\n\nPerplexity: Download the app or ask Perplexity anything at https://pplx.ai/rogan.\n\nMake your sports picks with DraftKings Predictions, available in California, Florida, Texas and more. Download the DraftKings Predictions app today. Sign up using promo code ROGAN or at https://dkpred.sng.link/Ereb8/jbhu/dogs\nGUS III LLC d/b/a DraftKings Predictions is a CFTC-registered Introducing Broker and NFA member. Event contract trading involves substantial risk of loss and is not suitable for everyone. 1 per new customer. Opt-in req. 100% trade match. Max. $75 issued as non-withdrawable Predictions Dollars that expire in 1 year. Ends 2/15/26 11:59 PM ET. Market availability varies. Eligibility restrictions apply. Terms: https://predictions.draftkings.com/en/promos. Sponsored by DK.</article>",
      "contentLength": 1260,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/UPfN2G0RyQM?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Renaissance Medicine: healthcare and disease in early modern England",
      "url": "http://www.bbc.co.uk/programmes/m002pptn",
      "date": 1770357600,
      "author": "",
      "guid": 42525,
      "unread": true,
      "content": "<p>Greg Jenner is joined in the sixteenth century by Dr Alanna Skuse and comedian Ria Lina to learn all about medicine and medical professionals in Tudor and Stuart England. In Renaissance-era England, medicine was still based on the theory of the four humours, passed down from ancient Greek and Roman physicians like Hippocrates and Galen. But from the reign of Henry VIII, there were signs of change. The invention of the printing press led to an explosion in medical and anatomical books, and the circulation of ideas from across Europe. The College of Physicians was founded in 1518, and the Company of Barber-Surgeons in 1543. Medicine became a real business, with a range of specialists, professional bodies overseeing different kinds of healthcare, and an explosion of medical providers advertising their services to the general public. This episode explores the landscape of healthcare in sixteenth- and seventeenth-century England, looking at everyone from physicians, surgeons and apothecaries to domestic healers and midwives, and even taking in quacks and frauds. Along the way, it examines the sensible social distancing measures taken during the Great Plague, the cures both sensible and dangerous offered for all kinds of diseases, and the cutting-edge experiments men like William Harvey and Christopher Wren were carrying out on the circulation of the blood.     \n \nIf you’re a fan of the history of everyday life in Tudor England, petty professional rivalries, and the whacky wellness trends of the past, you’ll love our episode on medicine in Renaissance England.\n \nIf you want more from Ria Lina, listen to our episodes on pirate queen Zheng Yi Sao and medieval traveller Marco Polo. And for more on the history of health and wellness, check out our episodes on Ancient Medicine, Renaissance Beauty and the Kellogg Brothers.\n \nYou’re Dead To Me is the comedy podcast that takes history seriously. Every episode, Greg Jenner brings together the best names in history and comedy to learn and laugh about the past.\n \nHosted by: Greg Jenner\nResearch by: Katharine Russell\nWritten by: Dr Emmie Rose Price-Goodfellow, Dr Emma Nagouse, and Greg Jenner\nProduced by: Dr Emmie Rose Price-Goodfellow and Greg Jenner\nAudio Producer: Steve Hankey\nProduction Coordinator: Gill Huggett\nSenior Producer: Dr Emma Nagouse\nExecutive Editor: Philip Sellars</p>",
      "contentLength": 2360,
      "flags": null,
      "enclosureUrl": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download-rss/proto/http/vpid/p0msklns.mp3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Trump’s assault on the Smithsonian: ‘The goal is to reframe the entire culture of the US’",
      "url": "",
      "date": 1770354003,
      "author": "",
      "guid": 42521,
      "unread": true,
      "content": "",
      "contentLength": 0,
      "flags": null,
      "enclosureUrl": "https://flex.acast.com/audio.guim.co.uk/2026/02/02-41460-gdn.alr.060226.NA_CHARLOTTE_HIGGINS_SMITHSONIAN.mp3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Bruce Hood - What Causes Religious Belief?",
      "url": "https://www.youtube.com/watch?v=RWdyCxgiBng",
      "date": 1770336034,
      "author": "Closer To Truth",
      "guid": 42480,
      "unread": true,
      "content": "<article>Get access to over 5,000 videos with a free Closer To Truth membership: https://closertotruth.com/register/\n\nBruce MacFarlane Hood is a Canadian-born British experimental psychologist and philosopher who specialises in developmental cognitive neuroscience.\n\nSubscribe to the Closer To Truth podcast on Apple, Spotify, or wherever you listen: https://shorturl.at/mtJP4\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.</article>",
      "contentLength": 689,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/RWdyCxgiBng?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Massimo Pigliucci - Philosophy of Transhumanism & Artificial Intelligence (AI)",
      "url": "https://www.youtube.com/watch?v=4_uVrDoHBuw",
      "date": 1770321606,
      "author": "Closer To Truth",
      "guid": 42415,
      "unread": true,
      "content": "<article>Contribute what you can to support Closer To Truth: https://closertotruth.com/donate/\n\nHumanity’s future is now framed by artificial intelligence (AI) and increasing interventions in the human body to cure and to enhance, i.e., transhumanism. Considering the stakes, and the dangers, a philosophical perspective is imperative.\n\nLike us on Facebook for daily videos, updates, announcements, and much more: https://shorturl.at/tak4l\n\nMassimo Pigliucci is an American philosopher and biologist who is professor of philosophy at the City College of New York, former co-host of the Rationally Speaking Podcast, and former editor in chief for the online magazine Scientia Salon.\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.</article>",
      "contentLength": 996,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/4_uVrDoHBuw?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Joe Rogan Experience #2449 - Raul Bilecky",
      "url": "https://www.youtube.com/watch?v=BvhFuEp55X0",
      "date": 1770314411,
      "author": "PowerfulJRE",
      "guid": 42368,
      "unread": true,
      "content": "<article>Raul Bilecky is a researcher, explorer, and creator of the YouTube channel “Pillars of the Past.”\n\nhttps://www.youtube.com/@PillarsofthePast101\nhttps://www.patreon.com/PillarsofthePast\nhttps://www.pillarsofthepast.com\n\nPerplexity: Download the app or ask Perplexity anything at https://pplx.ai/rogan.\n\nDon’t miss out on all the action this week at DraftKings! Download the DraftKings app today! Sign-up using https://dkng.co/rogan or through my promo code ROGAN.\nGAMBLING PROBLEM? CALL 1-800-GAMBLER, (800) 327-5050 or visit https://gamblinghelplinema.org (MA). Call 877-8-HOPENY/text HOPENY (467369) (NY). Please Gamble Responsibly. 888-789-7777/visit https://ccpg.org (CT), or visit https://www.mdgamblinghelp.org (MD). 21+ and present in most states. (18+ DC/KY/NH/WY). Void in ONT/OR/NH. Eligibility restrictions apply. On behalf of Boot Hill Casino &amp; Resort (KS). Pass-thru of per wager tax may apply in IL. 1 per new customer. Must register new account to receive reward Token. Must select Token BEFORE placing min. $5 bet to receive $300 in Bonus Bets if your bet wins. Min. -500 odds req. Token and Bonus Bets are single-use and non-withdrawable. Bet must settle by and Token expires 2/22/26. Bonus Bets expire in 7 days (168 hours). Stake removed from payout. Terms: https://sportsbook.draftkings.com/promos. Ends 2/15/26 at 11:59 PM ET. Sponsored by DK.\n\n30% off + two free gifts. Visit https://ARMRA.com/ROGAN</article>",
      "contentLength": 1426,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/BvhFuEp55X0?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Airbnb’s Open-Source GraphQL Framework with Adam Miskiewicz",
      "url": "https://softwareengineeringdaily.com/2026/02/05/airbnbs-open-source-graphql-framework-with-adam-miskiewicz/?utm_source=rss&utm_medium=rss&utm_campaign=airbnbs-open-source-graphql-framework-with-adam-miskiewicz",
      "date": 1770285600,
      "author": "SEDaily",
      "guid": 42188,
      "unread": true,
      "content": "<p>Engineering teams often build microservices as their systems grow, but over time this can lead to a fragmented ecosystem with scattered data access patterns, duplicated business logic, and an uneven developer experience. A unified data graph with a consistent execution layer helps address these challenges by centralizing schema, simplifying how teams compose functionality, and reducing operational overhead while preserving performance and reliability.</p><p>Viaduct is Airbnb’s open-source, data-oriented service mesh and GraphQL platform built around a single, highly connected central schema. It has played a major role in scaling Airbnb’s engineering organization.</p><p><a href=\"https://x.com/skevy\">Adam Miskiewicz</a> is a Principal Software Engineer at <a href=\"https://www.airbnb.com/\">Airbnb</a> and he worked on Viaduct. He joins the podcast with Gregor Vand to talk about how Viaduct originated inside Airbnb, the architectural principles that shaped it, the challenges of scaling GraphQL to millions of queries per second, and why the team decided to open-source the platform. They also discuss the future of backend development in an AI-driven world and how unified data layers may influence the next generation of engineering systems.</p>",
      "contentLength": 1170,
      "flags": null,
      "enclosureUrl": "https://traffic.megaphone.fm/SED7680215734.mp3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "How Did Three Samurai Warlords Unite Japan?",
      "url": "https://shows.acast.com/dansnowshistoryhit/episodes/how-did-three-samurai-warlords-unite-japan",
      "date": 1770260400,
      "author": "",
      "guid": 42152,
      "unread": true,
      "content": "<p>Today, we dive into the chaotic final act of Japan’s Warring States period, and hear about the three warlords who brought it to an end. Oda Nobunaga, the ruthless innovator who shattered the status quo on the battlefield. Toyotomi Hideyoshi, the peasant-born schemer who climbed from the lowest social ranks to the very top of Japan's hierarchy. And Tokugawa Ieyasu, the patient survivor who outlasted them all and built a shogunate that would rule Japan for over 250 years.</p><p>Joining us for this is Chris Harding, a cultural historian of Japan, India and East-West connections, based at the University of Edinburgh.</p><p>Produced by James Hickmann and edited by Dougal Patmore.</p>",
      "contentLength": 671,
      "flags": null,
      "enclosureUrl": "https://sphinx.acast.com/p/acast/s/dansnowshistoryhit/e/6978efd39b5ca1c75cc63da2/media.mp3?tk=eyJ0ayI6ImRlZmF1bHQiLCJhZHMiOnRydWUsInNwb25zIjp0cnVlLCJzdGF0dXMiOiJwdWJsaWMifQ==&sig=vnz29xCbL3ByPsLE36M73QMOj98Uzvwm7_0Iaj4MhYw",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Alexander the Great | Rise to Power",
      "url": "https://shows.acast.com/the-ancients/episodes/alexander-the-great-rise-to-power",
      "date": 1770260400,
      "author": "",
      "guid": 42140,
      "unread": true,
      "content": "<p>NEW SERIES! Journey through the early life of Alexander the Great, from his education under Aristotle to his first military experiences and rise to Macedonian kingship.</p><p>In this first episode, charting Alexander's incredible early life, Tristan Hughes and Dr Adrian Goldsworthy explore Alexander's formative years, the Battles that built the world's most formidable military leader and the immediate challenges following his father's assassination.</p><p><strong>The Rise of Hannibal with Adrian Goldsworthy</strong></p><p><strong>Darius the Great, Persian King of Kings</strong></p><p>Presented by Tristan Hughes. Audio editor is Aidan Lonergan and the producer is Joseph Knight. The senior producer is Anne-Marie Luff.</p><p>All music courtesy of Epidemic Sounds</p><p><em>The Ancients is a History Hit podcast.</em></p><p>You can take part in our listener survey&nbsp;<a href=\"https://insights.historyhit.com/history-hit-podcast-always-on\" rel=\"noopener noreferrer\" target=\"_blank\"></a></p>",
      "contentLength": 780,
      "flags": null,
      "enclosureUrl": "https://sphinx.acast.com/p/acast/s/the-ancients/e/697a4495fbdedf64042bbbcb/media.mp3?tk=eyJ0ayI6ImRlZmF1bHQiLCJhZHMiOnRydWUsInNwb25zIjp0cnVlLCJzdGF0dXMiOiJwdWJsaWMifQ==&sig=SUkgalVJ5-sakz-6PReYiRma3U9rRTj4QBkN9oGCXhA",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "641. Rome’s Greatest Enemy: Hannibal’s Nemesis (Part 2)",
      "url": "",
      "date": 1770249900,
      "author": "",
      "guid": 42103,
      "unread": true,
      "content": "",
      "contentLength": 0,
      "flags": null,
      "enclosureUrl": "https://pdst.fm/e/traffic.megaphone.fm/GLT6811115289.mp3?updated=1770288466",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Setting Docker Hardened Images free (Interview)",
      "url": "https://changelog.com/podcast/675",
      "date": 1770235200,
      "author": "",
      "guid": 42038,
      "unread": true,
      "content": "<p>In May of 2025, Docker launched Hardened Images, a secure, minimal, production-ready set of images. In December, they made DHI freely available and open source to everyone who builds software. On this episode, we’re joined by Tushar Jain, EVP of Engineering at Docker to learn all about it.</p><p><a href=\"https://changelog.com/++\" rel=\"payment\">Changelog++</a> members get a bonus 6 minutes at the end of this episode and zero ads. Join today!</p><ul><li><a href=\"https://www.tigerdata.com\">Tiger Data</a> – Postgres for Developers, devices, and agents The data platform trusted by hundreds of thousands from IoT to Web3 to AI and more.\n</li><li><a href=\"https://namespace.so\">Namespace</a> – Speed up your development and testing workflows using your existing tools. (Much) faster GitHub actions, Docker builds, and more. At an unbeatable price.\n</li><li><a href=\"https://nordlayer.com/thechangelog\">NordLayer</a> – Toggle-ready network security for modern businesses. Get an exclusive offer: up to 22% off NordLayer yearly plans plus 10% on top with the coupon code . Try it risk-free with a 14-day money-back guarantee at <a href=\"https://nordlayer.com/thechangelog\">nordlayer.com/thechangelog</a></li><li><a href=\"https://fly.io/\">Fly.io</a> – <strong>The home of Changelog.com</strong> — Deploy your apps close to your users — global Anycast load-balancing, zero-configuration private networking, hardware isolation, and instant WireGuard VPN connections. Push-button deployments that scale to thousands of instances. <a href=\"https://fly.io/speedrun/\">Check out the speedrun</a> to get started in minutes.\n</li></ul>",
      "contentLength": 1269,
      "flags": null,
      "enclosureUrl": "https://op3.dev/e/https://pscrb.fm/rss/p/https://cdn.changelog.com/uploads/podcast/675/the-changelog-675.mp3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Joe Rogan Experience #2448 - Andrew Doyle",
      "url": "https://www.youtube.com/watch?v=Dnon-AsWnOQ",
      "date": 1770228015,
      "author": "PowerfulJRE",
      "guid": 42017,
      "unread": true,
      "content": "<article>Andrew Doyle is a writer, broadcaster, and comedian. He is the author of several books, including his most recent, “The End of Woke: How the Culture War Went Too Far and What to Expect from the Counter-Revolution.”\nhttps://www.andrewdoyle.org\n\nPerplexity: Download the app or ask Perplexity anything at https://pplx.ai/rogan.\n\nGo to https://1800flowers.com/rogan to get your Double Blooms offer, buy one dozen, they’ll double it to two dozen roses free\n\nThis video is sponsored by BetterHelp. Visit https://BetterHelp.com/JRE</article>",
      "contentLength": 531,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/Dnon-AsWnOQ?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Iain McGilchrist - Idealism: Arguing Pro and Con?",
      "url": "https://www.youtube.com/watch?v=tl5yBHfUm6Q",
      "date": 1770220888,
      "author": "Closer To Truth",
      "guid": 41953,
      "unread": true,
      "content": "<article>Follow us on X for videos, articles, and polls on life's biggest questions: https://x.com/CloserToTruth\n\nIdealism is the theory that all reality is consciousness and only consciousness, and that what we perceive to be the physical world is either a manifestation of consciousness or derived from it. Either way, fundamental reality is pure consciousness. What are the arguments for and against Idealism (like the common sense of the physical)?\n\nSign up for a free Closer To Truth membership to receive exclusives like early access to new episodes: https://closertotruth.com/register/\n\nIain McGilchrist is a former Fellow of All Souls College, Oxford, an associate Fellow of Green Templeton College, Oxford, a Fellow of the Royal College of Psychiatrists, a Fellow of the Royal Society of Arts, a Consultant Emeritus of the Bethlem and Maudsley Hospital, London, a former research Fellow in Neuroimaging at Johns Hopkins University Medical School, Baltimore, and a former Fellow of the Institute of Advanced Studies in Stellenbosch.\n\nSubscribe to the Closer To Truth podcast on Apple, Spotify, or wherever you listen: https://shorturl.at/mtJP4\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.</article>",
      "contentLength": 1464,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/tl5yBHfUm6Q?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "From the archive: the free speech panic: how the right concocted a crisis",
      "url": "",
      "date": 1770181233,
      "author": "",
      "guid": 41826,
      "unread": true,
      "content": "",
      "contentLength": 0,
      "flags": null,
      "enclosureUrl": "https://flex.acast.com/audio.guim.co.uk/2026/01/30-33338-gdn.alr.040226.NA.archive_WILLIAM_DAVIES_CENSORSHIP.mp3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Greatest Paintings: Dawn of the Dutch Golden Age - The Arnolfini Portrait",
      "url": "",
      "date": 1770163500,
      "author": "",
      "guid": 41778,
      "unread": true,
      "content": "",
      "contentLength": 0,
      "flags": null,
      "enclosureUrl": "https://pdst.fm/e/traffic.megaphone.fm/GLT4423895710.mp3?updated=1770718119",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Joe Rogan Experience #2447 - Mike Benz",
      "url": "https://www.youtube.com/watch?v=MkqDA9W4Vo0",
      "date": 1770141631,
      "author": "PowerfulJRE",
      "guid": 41675,
      "unread": true,
      "content": "<article>Mike Benz is the Executive Director of the Foundation for Freedom Online and a former official with the U.S. Department of State.\nhttps://www.youtube.com/@MikeBenzCyberOfficial\nhttps://www.foundationforfreedomonline.com\n\nPerplexity: Download the app or ask Perplexity anything at https://pplx.ai/rogan.\n\nDon’t miss out on all the action this week at DraftKings! Download the DraftKings app today! Sign-up using https://dkng.co/rogan or through my promo code ROGAN.\nGAMBLING PROBLEM? CALL 1-800-GAMBLER, (800) 327-5050 or visit https://gamblinghelplinema.org (MA). Call 877-8-HOPENY/text HOPENY (467369) (NY). Please Gamble Responsibly. 888-789-7777/visit https://ccpg.org (CT), or visit https://www.mdgamblinghelp.org (MD). 21+ and present in most states. (18+ DC/KY/NH/WY). Void in ONT/OR/NH. Eligibility restrictions apply. On behalf of Boot Hill Casino &amp; Resort (KS). Pass-thru of per wager tax may apply in IL. 1 per new customer. Must register new account to receive reward Token. Must select Token BEFORE placing min. $5 bet to receive $300 in Bonus Bets if your bet wins. Min. -500 odds req. Token and Bonus Bets are single-use and non-withdrawable. Bet must settle by and Token expires 2/22/26. Bonus Bets expire in 7 days (168 hours). Stake removed from payout. Terms: https://sportsbook.draftkings.com/promos. Ends 2/15/26 at 11:59 PM ET. Sponsored by DK.\n\nVisit https://squarespace.com/ROGAN to save 10% off your first purchase of a website or domain.</article>",
      "contentLength": 1464,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/MkqDA9W4Vo0?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Speed and Scale: How Today's AI Datacenters Are Operating Through Hypergrowth",
      "url": "https://podcasters.spotify.com/pod/show/mlops/episodes/Speed-and-Scale-How-Todays-AI-Datacenters-Are-Operating-Through-Hypergrowth-e3ej6ks",
      "date": 1770141600,
      "author": "Demetrios",
      "guid": 41658,
      "unread": true,
      "content": "<p> is the CEO at <a href=\"https://netboxlabs.com/\" target=\"_blank\" rel=\"ugc noopener noreferrer\">NetBox Labs</a>, working on turning NetBox into the system of record and automation backbone for modern and AI-driven infrastructure.</p><p>Speed and Scale: How Today's AI Datacenters Are Operating Through Hypergrowth // MLOps Podcast #359 with Kris Beevers, CEO of NetBox Labs</p><p>Hundreds of neocloud operators and \"AI Factory\" builders have emerged to serve the insatiable demand for AI infrastructure. These teams are compressing the design, build, deploy, operate, scale cycle of their infrastructures down to months, while managing massive footprints with lean teams. How? By applying modern intent-driven infrastructure automation principles to greenfield deployments. We'll explore how these teams carry design intent through to production, and how operating and automating around consistent infrastructure data is compressing \"time to first train\".</p><p>Kris Beevers is the Co-founder and CEO of NetBox Labs. NetBox is used by nearly every Neocloud and AI datacenter to manage their networks and infrastructure. Kris is an engineer at heart and by background, and loves the leverage infrastructure innovation creates to accelerate technology and empower engineers to do their best work. A serial entrepreneur, Kris has founded and helped lead multiple other successful businesses in the internet and network infrastructure. Most recently, he co-founded and led NS1, which was acquired by IBM in 2023. He holds a Ph.D. in Computer Science from Rensselaer Polytechnic Institute and is based in New Jersey.</p><p>~~~~~~~~ ✌️Connect With Us ✌️ ~~~~~~~</p><p>[00:00] Observability and Delta Analysis</p><p>[00:26] New World Exploration</p><p>[04:06] Bottlenecks in AI Infrastructure</p><p>[13:37] Data Center Optimization Challenges</p><p>[19:58] Tech Stack Breakdown</p><p>[25:26] Data Center Design Principles</p><p>[31:32] Constraints and Automation in Design</p><p>[40:00] Complexity in Data Centers</p><p>[45:02] GPU Cloud Landscape</p><p>[50:24] Data Centers in Containers</p><p>[57:45] Observability Beyond Software</p><p>[1:04:43] Tighter Integrations vs NetBox</p>",
      "contentLength": 1983,
      "flags": null,
      "enclosureUrl": "https://anchor.fm/s/174cb1b8/podcast/play/114972764/https%3A%2F%2Fd3ctxlq1ktw2nl.cloudfront.net%2Fstaging%2F2026-1-3%2F417394904-44100-2-451b18cae6d3.mp3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Quayshawn Spencer - How are Human Beings Unique?",
      "url": "https://www.youtube.com/watch?v=dkLjw_fSDNo",
      "date": 1770134455,
      "author": "Closer To Truth",
      "guid": 41620,
      "unread": true,
      "content": "<article>Like us on Facebook for daily videos, updates, announcements, and much more: https://shorturl.at/tak4l\n\nWhat is “human” nature? While human beings are animals, we believe we are special, radically different from other animals. Why? What traits are unique to humans? Are we sure? How to explore human nature from a biological and evolutionary perspective?\n\nWear your support for the show with a Closer To Truth merchandise purchase: https://bit.ly/3P2ogje\n\nQuayshawn Spencer is the Robert S. Blank Presidential Associate Professor of Philosophy and Undergraduate Chair at the University of Pennsylvania.\n\nDonate to help Closer To Truth continue exploring the world's deepest questions without the need for paywalls: https://closertotruth.com/donate/\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.</article>",
      "contentLength": 1074,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/dkLjw_fSDNo?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "SED News: Apple Bets on Gemini, Google’s AI Advantage, and the Talent Arms Race",
      "url": "https://softwareengineeringdaily.com/2026/02/03/sed-news-apple-bets-on-gemini-googles-ai-advantage-and-the-talent-arms-race/?utm_source=rss&utm_medium=rss&utm_campaign=sed-news-apple-bets-on-gemini-googles-ai-advantage-and-the-talent-arms-race",
      "date": 1770112831,
      "author": "SEDaily",
      "guid": 41525,
      "unread": true,
      "content": "<p>SED News is a monthly podcast from Software Engineering Daily where hosts Gregor Vand and Sean Falconer unpack the biggest stories shaping software engineering, Silicon Valley, and the broader tech industry.</p><p>In this episode, they cover <a href=\"https://starlink.com/\">Starlink</a>’s rapid rollout of free, high-speed in-flight internet, <a href=\"https://www.tesla.com/\">Tesla</a>’s move to deprecate Autopilot in favor of full self-driving, and <a href=\"https://www.apple.com/\">Apple</a>’s reported decision to power Siri with <a href=\"https://www.google.com/\">Google</a>’s Gemini models. They also discuss <a href=\"https://business.facebook.com/\">Meta</a>’s $2B acquisition of <a href=\"https://manus.im/\">Manus</a>, <a href=\"https://waymo.com/\">Waymo</a>’s growing pains as autonomous vehicles scale, and the competitive shockwaves triggered by Google’s advances in custom AI hardware.</p><p>Gregor and Sean then dive deep into the state of the tech job market, examining <a href=\"https://openai.com/\">OpenA</a>I’s decision to eliminate vesting cliffs, the escalating war for elite AI talent, and what recent layoffs really say about the future of software engineering. They explore how AI coding tools are reshaping the balance between junior and senior engineers, why fundamentals still matter, and what developers should focus on heading into 2026.</p><p>Finally, they highlight standout threads from Hacker News, including Doom running on wireless earbuds, the enduring appeal of wildly over-engineered side projects, and why hacking for fun still matters in an age of industrial-scale AI.</p>",
      "contentLength": 1303,
      "flags": null,
      "enclosureUrl": "https://traffic.megaphone.fm/SED5113011729.mp3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "The tech monoculture is finally breaking (News)",
      "url": "https://changelog.com/news/179",
      "date": 1770064200,
      "author": "",
      "guid": 41446,
      "unread": true,
      "content": "<p>Jason Willems believes the tech monoculture is finally breaking, Don Ho shares some bad Notepad++ news, Tailscale’s Avery Pennarun pens a great downtime apology, Milan Milanović explains why you can only code 4 hours per day, and Addy Osmani on managing comprehension debt when leaning on AI to code.</p><p><a href=\"https://changelog.com/++\" rel=\"payment\">Changelog++</a> members save 1 minute on this episode because they made the ads disappear. Join today!</p><ul><li><a href=\"https://www.tigerdata.com\">Tiger Data</a> – Postgres for Developers, devices, and agents The data platform trusted by hundreds of thousands from IoT to Web3 to AI and more.\n</li></ul>",
      "contentLength": 545,
      "flags": null,
      "enclosureUrl": "https://op3.dev/e/https://pscrb.fm/rss/p/https://cdn.changelog.com/uploads/news/179/changelog-news-179.mp3",
      "enclosureMime": "",
      "commentsUrl": null
    }
  ],
  "tags": [
    "podcast"
  ]
}