{
  "id": "fZWkWx2e",
  "title": "Movies",
  "displayTitle": "Movies",
  "url": "",
  "feedLink": "",
  "isQuery": true,
  "isEmpty": false,
  "isHidden": false,
  "itemCount": 36,
  "items": [
    {
      "title": "FULL SHOW: Is BUGONIA out of this world? + Ruth Wilson on DOWN CEMETERY ROAD",
      "url": "https://www.youtube.com/watch?v=WuRMIc3PU_M",
      "date": 1761829271,
      "author": "Kermode and Mayo's Take",
      "guid": 29852,
      "unread": true,
      "content": "<article>Some exciting news — The Take is now on Patreon: www.patreon.com/kermodeandmayo.  Become a Vanguardista or an Ultra Vanguardista to get video episodes of Take Two every week, plus member‑only chat rooms, polls and submissions to influence the show, behind‑the‑scenes photos and videos, the monthly Redactor’s Roundup newsletter, and access to a new fortnightly LIVE show — a raucous, unfiltered lunchtime special with the Good Doctors, new features, and live chat so you can heckle, vote, and have your questions read out in real time. \n\nAnother top Take this week where the Good Doctors are giving you the lowdown on all the most enticing movies hitting cinema screens—and the small screen too, with our very special guest Ruth Wilson. She’ll be chatting to Simon about Down Cemetery Road — the new TV thriller based on Slow Horses author Mick Herron’s novel, where she plays the ordinary woman pulled into a mystery involving a huge explosion, a missing child, and a shady coverup. She unpacks her unlikely sleuth character, Sarah Trafford, the show’s tonal twist on TV crime, and hunting for clues alongside Emma Thompson’s gutsy gumshoe Zoe Boehm.  \n\nMark reviews it too—along with Relay — another taut thriller starring Riz Ahmed as a mysterious fixer who cuts deals through an anonymous phone service between his clients and the dodgy corporations they take on. And Bugonia—Yorgos Lanthimos’ latest oddity that asks whether Emma Stone might actually be an extraterrestrial...well, haven’t you wondered? All that plus the Box office Top 10, the ever- hilarious Laughter Lift, and top correspondence from you lot—keep it coming please!  \n\nAND Don’t miss our upcoming LIVE Christmas Extravaganza at London’s Prince Edward Theatre on 7th December. Tickets here: fane.co.uk/kermode-mayo   \n\n \nTimecodes (for Vanguardistas listening ad-free) \n\nRelay Review: 10;44 \n\nBO10: 19;14 \n\nRuth Wilson Interview: 36;04 \n\nDown Cemetery Road Review: 49;58 \n\nLaughter Lift: 58;30 \n\nBugonia: 1;05;03 \n\n \n\nYou can contact the show by emailing correspondence@kermodeandmayo.com or you can find us on social media, @KermodeandMayo \n\nPlease take our survey and help shape the future of our show: https://www.kermodeandmayo.com/survey  \n\nEXCLUSIVE NordVPN Deal ➼ https://nordvpn.com/take Try it risk-free now with a 30-day money-back guarantee! \n\nA Sony Music Entertainment production.     \n\nFind more great podcasts from Sony Music Entertainment at sonymusic.com/podcasts and follow us @sonypodcasts   \n\nTo advertise on this show contact: podcastadsales@sonymusic.com</article>",
      "contentLength": 2591,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/WuRMIc3PU_M?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "LEDs - with Tim S. Kang",
      "url": "https://teamdeakins.libsyn.com/leds-with-tim-s-kang",
      "date": 1761730200,
      "author": "",
      "guid": 29652,
      "unread": true,
      "content": "<p>SEASON 2 - EPISODE 165 - LEDs - with Tim S. Kang</p><p>In this episode of the Team Deakins Podcast, we learn about LED lighting. LEDs are now commonplace in productions, and we thought an episode about the technology and its applications could be helpful for anyone with as many questions as us. Our guest is Tim S. Kang, a cinematographer and the principal engineer for imaging applications at Aputure, and we start by learning how Tim came to work on this side of the business. He also helps us understand a number of topics, including: the history of lighting in cinema, the definition of spectrum, the evolution of LEDs, and the possibilities of lighting in post. We also discuss the efforts to institute a standard among LED fixtures, and we reflect on the historical problem cinematographers have always faced: inconsistencies with light sources.</p><p>This episode is sponsored by Aputure &amp; Sandstorm</p>",
      "contentLength": 893,
      "flags": null,
      "enclosureUrl": "https://traffic.libsyn.com/secure/teamdeakins/S2-165_LED_Tim_S_Kang_Final_Aputure-Sandstorm-SPlea.mp3?dest-id=2018942",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "June Squibb's Closet Picks",
      "url": "https://www.youtube.com/watch?v=K0nb9ECXdGE",
      "date": 1761583955,
      "author": "CRITERION",
      "guid": 29059,
      "unread": true,
      "content": "<article>The actor shares her longtime love for the films of Akira Kurosawa, talks about seeing CHILDREN OF PARADISE at an art-house cinema in the 1940s, and fondly recalls riding a scooter with Richard Roundtree.</article>",
      "contentLength": 204,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/K0nb9ECXdGE?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Cillian Murphy + THE WES ANDERSON ARCHIVE",
      "url": "https://www.youtube.com/shorts/Rf530YO8J-k",
      "date": 1761329468,
      "author": "CRITERION",
      "guid": 28604,
      "unread": true,
      "content": "<article>Cillian Murphy shows love for Wes Anderson in the Criterion Closet!\n\nLearn more about THE WES ANDERSON ARCHIVE, a momentous 4K box set of the singular director's first 10 films: criterion.com/boxsets/8208</article>",
      "contentLength": 204,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/Rf530YO8J-k?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Jason Bateman's Closet Picks",
      "url": "https://www.youtube.com/watch?v=us0xeBVKMJI",
      "date": 1761327745,
      "author": "CRITERION",
      "guid": 28592,
      "unread": true,
      "content": "<article>The actor and director talks about being influenced by cinematographer Gordon Willis, shares his affection for Peter Sellers’s comedy style, and selects films he’s excited to see for the first time, like AMORES PERROS and SHAMPOO.\n\nShop Jason's Picks! https://bit.ly/475LFei</article>",
      "contentLength": 278,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/us0xeBVKMJI?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Best of the Worst: Halloween 2025",
      "url": "https://www.youtube.com/watch?v=DgFuSl8JUyc",
      "date": 1761319243,
      "author": "RedLetterMedia",
      "guid": 28543,
      "unread": true,
      "content": "<article>Happy Halloween! You'll scream in terror as these elderly losers make their way through werewolves that act like vampires, confused Italian zombies, and a ventriloquist dummy with a foul mouth and even fouler breath.\n\nSome fun facts from this episode:\n\n- The villa used in Burial Ground is the same location used in the 2024 film Immaculate\n\n- The actor that plays one of the main werewolf henchmen in Howling 2 also played escaped convict Mickey in Pee-Wee's Big Adventure\n\n- Lakefront's Pumpkin Imperial Ale doesn't have a very high ABV but if you drink a whole bunch of them quickly, you'll still be slurring your words and borderline incoherent (even if you are able to eek out one very good wooden-puppet-related pun that nobody even reacts to)</article>",
      "contentLength": 749,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/DgFuSl8JUyc?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Mark Kermode reviews Regretting You",
      "url": "https://www.youtube.com/watch?v=dAv6jR27FCM",
      "date": 1761309088,
      "author": "Kermode and Mayo's Take",
      "guid": 28498,
      "unread": true,
      "content": "<article>#MarkKermode #SimonMayo #FilmReviews\n\nCentres on the strained relationship between young mother Morgan Grant and her teenage daughter Clara, exacerbated by Morgan's husband Chris's tragic death, forcing them to navigate life's challenges together.\n\n\nTo hear more, follow Kermode and Mayo's Take wherever you get your podcasts: https://podfollow.com/1616559297</article>",
      "contentLength": 359,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/dAv6jR27FCM?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "24/10/2025 Box Office Top Ten",
      "url": "https://www.youtube.com/watch?v=uTeXjkdpM-k",
      "date": 1761260470,
      "author": "Kermode and Mayo's Take",
      "guid": 28393,
      "unread": true,
      "content": "<article>#MarkKermode #SimonMayo #FilmReviews\n\nMark and Simon Mayo run through this week's box office top 10…\n\nTo hear more, follow Kermode and Mayo's Take wherever you get your podcasts: https://podfollow.com/1616559297</article>",
      "contentLength": 213,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/uTeXjkdpM-k?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Mark Kermode reviews Springsteen: Deliver Me from Nowhere",
      "url": "https://www.youtube.com/watch?v=ecukBw039_I",
      "date": 1761260451,
      "author": "Kermode and Mayo's Take",
      "guid": 28392,
      "unread": true,
      "content": "<article>#MarkKermode #SimonMayo #FilmReviews\n\nBruce Springsteen's journey crafting his 1982 album Nebraska, which emerged as he recorded Born in the USA with the E Street Band. Based on Warren Zanes' book.\n\nTo hear more, follow Kermode and Mayo's Take wherever you get your podcasts: https://podfollow.com/1616559297</article>",
      "contentLength": 308,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/ecukBw039_I?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "The best/worst dad jokes from the Laughter Lift 24/10/2025",
      "url": "https://www.youtube.com/watch?v=IeKtL01-mgE",
      "date": 1761260420,
      "author": "Kermode and Mayo's Take",
      "guid": 28391,
      "unread": true,
      "content": "<article>#MarkKermode #SimonMayo #FilmReviews\n\nMark Kermode and Simon Mayo\n\nTo hear more, follow Kermode and Mayo's Take wherever you get your podcasts: https://podfollow.com/1616559297</article>",
      "contentLength": 176,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/IeKtL01-mgE?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Mark Kermode reviews The Mastermind",
      "url": "https://www.youtube.com/watch?v=AeDpt3lIKWE",
      "date": 1761260412,
      "author": "Kermode and Mayo's Take",
      "guid": 28390,
      "unread": true,
      "content": "<article>#MarkKermode #SimonMayo #FilmReviews\n\nIn 1970, failed architect James Blaine Mooney and cohorts wander into a museum in broad daylight and steal four paintings. When holding onto the art proves more difficult than stealing them, Mooney is relegated to a life on the run.\n\nTo hear more, follow Kermode and Mayo's Take wherever you get your podcasts: https://podfollow.com/1616559297</article>",
      "contentLength": 381,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/AeDpt3lIKWE?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Mark Kermode reviews Sketch",
      "url": "https://www.youtube.com/watch?v=6S-feRbzg8I",
      "date": 1761260407,
      "author": "Kermode and Mayo's Take",
      "guid": 28389,
      "unread": true,
      "content": "<article>#MarkKermode #SimonMayo #FilmReviews\n\nWhen a young girl's sketchbook falls into a strange pond, her drawings come to life-chaotic, real and on the loose. As the town descends into chaos, her family must reunite and stop the monsters they never meant to unleash.\n\nTo hear more, follow Kermode and Mayo's Take wherever you get your podcasts: https://podfollow.com/1616559297</article>",
      "contentLength": 372,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/6S-feRbzg8I?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Mark Kermode reviews Regretting You",
      "url": "https://www.youtube.com/watch?v=1nyDI_wrReM",
      "date": 1761260402,
      "author": "Kermode and Mayo's Take",
      "guid": 28388,
      "unread": true,
      "content": "<article>#MarkKermode #SimonMayo #FilmReviews\n\nCentres on the strained relationship between young mother Morgan Grant and her teenage daughter Clara, exacerbated by Morgan's husband Chris's tragic death, forcing them to navigate life's challenges together.\n\nTo hear more, follow Kermode and Mayo's Take wherever you get your podcasts: https://podfollow.com/1616559297</article>",
      "contentLength": 358,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/1nyDI_wrReM?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Simon Mayo Interviews Kelly Reichardt and Josh O’Connor",
      "url": "https://www.youtube.com/watch?v=aA4s4jItukY",
      "date": 1761260400,
      "author": "Kermode and Mayo's Take",
      "guid": 28387,
      "unread": true,
      "content": "<article>#MarkKermode #SimonMayo #FilmReviews\n\nTo hear more, follow Kermode and Mayo's Take wherever you get your podcasts: https://podfollow.com/1616559297</article>",
      "contentLength": 147,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/aA4s4jItukY?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "We ❤️ Richard Linklater | Closet Picks Edition",
      "url": "https://www.youtube.com/shorts/TnQsap0KJvY",
      "date": 1761252344,
      "author": "CRITERION",
      "guid": 28354,
      "unread": true,
      "content": "<article>With two new Richard Linklater films (BLUE MOON and NOUVELLE VAGUE) hitting theaters this month, there's no better time to revisit the writer-director's beloved work, as recommended here by visitors in the Criterion Closet.\n\nOn our streaming service, The Criterion Channel, watch Linklater's SLACKER (1991) and SUBURBIA (1997) alongside his episode of our original series ADVENTURES IN MOVIEGOING: https://bit.ly/3OhRmew\n\nCheck out our 4K, Blu-ray, and DVD editions of DAZED AND CONFUSED (1993), THE BEFORE TRILOGY, and more at criterion.com!</article>",
      "contentLength": 542,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/TnQsap0KJvY?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Kermode and Mayo's Take is now on Patreon!",
      "url": "https://www.youtube.com/watch?v=_bTkNsrw4Tc",
      "date": 1761252319,
      "author": "Kermode and Mayo's Take",
      "guid": 28353,
      "unread": true,
      "content": "<article>We have some exciting news  - we're now on Patreon. \n\nHead over to https://www.patreon.com/c/kermodeandmayo/membership to sign up.\n\nMore films. More opinions. More recommendations. More bickering. More wittering. This is where Kermode &amp; Mayo’s Take gets bigger, longer and uncut. As a subscriber, you’ll get ad-free listening, weekly VIDEO bonus episodes of Take Two in 4k*, and the chance to be properly involved in the nonsense — through polls, chats, newsletters, and the occasional bad joke that really shouldn’t have been read out.\n\nIt’s a space for those of you who don’t just want to hear the Take, but want to be part of it. Maybe you’ve shouted at us through your headphones, certain we’d missed the point of a film (Mark), or simply wanted Simon to get a word in edgeways. Maybe you just want more film chat, more recommendations, and more of us trying — and failing — to keep to time.\n\nWe want you to be at the heart of this so contact us and let us know what you’d like to see and hear on Patreon, and we’ll do our best. \n\nQuick note: If you’re a paid subscriber on Apple or Supporting Cast, those subscriptions aren’t going anywhere, so you can continue as a subscriber there if you’d like. However, we invite you to join us on Patreon to access all of the new content and benefits!\n\nWhat’s included on Patreon?\nThe membership includes two paid tiers — Vanguardista and Ultra Vanguardista.\n\nVanguardista\nWeekly Take Two Bonus Episode (audio-only): Because clearly one dose of us a week isn’t enough. Take Two is our subscriber-only show: a whole extra hour of reviews, tangents, and assorted nonsense. You’ll also get features like One Frame Back, Weekend Watchlist/Notlist, plus Questions Schmestions, where you send in queries and we provide… let’s say “answers.\n\nAd-Free Listening: Both Kermode &amp; Mayo’s Take and Take Two, without the interruptions. Just us. Talking. For longer.\n\nChat Rooms: Access member-only chat rooms to discuss films, telly, and assorted nonsense with fellow fans, the Redactors, and, if we’re feeling reckless, the occasional drop-in from us.\n\nUltra Vanguardista\nEverything from Vangurdista:\n\nWeekly Take Two Bonus Episode (audio-only)\n\nAd-Free Listening\n\nChat Rooms\n\nPLUS…\n\n2 x Take Ultra livestream shows (per month): Our brand-new, fully live show featuring more reviews, recommendations of what to watch, audience opinions, and our take on the internet’s hottest (and coldest) takes. You’ll be part of the action, too — and if you can’t join us live, recordings will be available in both audio and video.\n\nMonthly Newsletter: The Redactor's Roundup provides a round-up of the last month, a glimpse of what’s coming next, and whatever film news caught their eye before we nicked it for ourselves.\n\nVideo Versions of Take Two Episodes: Access video versions of Take Two bonus episodes\n\nBehind-the-Scenes Content: Exclusive photos and videos that we don’t post anywhere else\n\nPolls &amp; Submissions: Be a part of the show —  vote on the films we cover, send us questions to answer, and try your best (or worst) jokes for the Laughter Lift</article>",
      "contentLength": 3140,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/_bTkNsrw4Tc?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "FULL SHOW: Did Mark ‘Louvre’ timely heist movie THE MASTERMIND? + Does SPRINGSTEEN deliver?",
      "url": "https://www.youtube.com/watch?v=oZXTgTGrlaA",
      "date": 1761237030,
      "author": "Kermode and Mayo's Take",
      "guid": 28278,
      "unread": true,
      "content": "<article>This Week on the Show: Josh O’Connor, Kelly Reichardt &amp; the Art of the Heist \n\nFresh off the headlines of a real-life Louvre robbery, indie auteur Kelly Reichardt and breakout star Josh O’Connor join Simon to talk about their buzzy new film, The Mastermind—a stylish 70s-set art-heist drama that’s suddenly feeling very timely. O’Connor plays JB, a slacker dad whose low-stakes gallery theft spirals into something far more chaotic. Expect Nixon-era nostalgia, vintage fashion deep-dives, and awkward ovation etiquette. Plus, Josh spills on his upcoming Spielberg project—yes, that Spielberg. \n\n \n\nMark Reviews: \n\n \n\nThe Mastermind – Does Reichardt’s latest live up to the hype? \nRegretting You – A romantic drama with a title tailor-made for snark. Mark’s rant radar is fully activated. \nSketch – A family film where kids’ drawings come to life. But does the magic hold up? \nSpringsteen: Deliver Me From Nowhere – Jeremy Allen White stars as The Boss in this hotly anticipated biopic. Does it rock or roll off the rails? \n  \n\nWhether you're here for reviews, behind-the-scenes stories, or just want to know what’s worth your cinema ticket this week, we’ve got you covered. \n\nAnd some exciting news: The Take is now on Patreon! Find our page here: www.patreon.com/kermodeandmayo  \n\nYou can now become a Vanguardista—or join the new ranks of the Ultra Vanguardistas, on our Patreon page. Get a whole extra show with Take 2 every week, plus... \n\nAccess to our new member-only Patreon chat rooms \nPolls &amp; submissions — vote on the films we cover, send us questions to answer, and try your best (or worst) jokes for the Laughter Lift. \nBehind-the-scenes photos and videos you won’t find anywhere else. \nVideo versions of ALL upcoming Take Two bonus episodes  \nA new monthly newsletter called The Redactor’s Roundup  \nAnd, most excitingly...  \n\nA whole brand new fortnightly LIVE show from the Good Doctors – and the chance to message on the live chat during the show \nAND Don’t miss our upcoming LIVE Christmas Extravaganza at London’s Prince Edward Theatre on 7th December. Tickets here: fane.co.uk/kermode-mayo   \n \n \nTimecodes (for Vanguardistas listening ad-free) \n\n\nRegretting You Review: 10;51  \n\nBox Office Top Ten: 19;54 \n\nJosh O’Connor &amp; Kelly Reichardt Interview: 33;31 \n\nThe Mastermind Review: 48;15 \n\nLaughter Lift: 57;40 \n\nSpringsteen: Deliver Me From Nowhere Review: 1;01;04  \n\nSketch Review: 01;15;57  \n\n \n\n \n\n\nYou can contact the show by emailing correspondence@kermodeandmayo.com or you can find us on social media, @KermodeandMayo \n\nPlease take our survey and help shape the future of our show: https://www.kermodeandmayo.com/survey  \n\nEXCLUSIVE NordVPN Deal ➼ https://nordvpn.com/take Try it risk-free now with a 30-day money-back guarantee! \n\nA Sony Music Entertainment production.     \n\nFind more great podcasts from Sony Music Entertainment at sonymusic.com/podcasts and follow us @sonypodcasts   \n\nTo advertise on this show contact: podcastadsales@sonymusic.com</article>",
      "contentLength": 3028,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/oZXTgTGrlaA?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "We ❤️ Martin Scorsese | Closet Picks Edition",
      "url": "https://www.youtube.com/shorts/GAbJr5c5OLU",
      "date": 1761181588,
      "author": "CRITERION",
      "guid": 28124,
      "unread": true,
      "content": "<article>Criterion Closet guests pay tribute to their favorite films by the great director. Which Scorsese film will you be adding to your collection?\n\nCheck out the Scorsese films in the Criterion Collection, available on 4K, Blu-ray, and DVD: criterion.com/shop/collection/500-martin-scorsese</article>",
      "contentLength": 285,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/GAbJr5c5OLU?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "The A24 Podcast | Don't Be A Stranger with Jonah Hill & Michael Cera (2019)",
      "url": "https://www.youtube.com/watch?v=6kT0bqzmrTc",
      "date": 1761165439,
      "author": "A24",
      "guid": 28064,
      "unread": true,
      "content": "<article>SUBSCRIBE: http://bit.ly/A24subscribe\n\nJonah Hill and Michael Cera became best friends when they costarred in the generation-defining 2007 comedy Superbad. \n\nWe invited them on the podcast to catch up and reflect on their twelve year friendship. Topics covered include: the surreal experience of overnight fame, Spanish movie marketing, establishing boundaries, theater people, drinking beers with Elaine May, Jonah's fear of winged animals, on-demand pushups, degenerate gambling, and why everyone should own a digital copy of Mid90s.\n------\n\nABOUT A24:\nThe studio behind EVERYTHING EVERYWHERE ALL AT ONCE, UNCUT GEMS, MIDSOMMAR, MOONLIGHT, BEEF on Netflix, EUPHORIA on Max &amp; more.\n\nComing Soon: EDDINGTON, THE SMASHING MACHINE, MARTY SUPREME &amp; more\n\nSubscribe to A24's NEWSLETTER:  http://bit.ly/A24signup\nSign up for A24 MEMBERSHIP: aaa24.com\nVisit A24 WEBSITE: http://bit.ly/A24filmsdotcom\nLike A24 on FACEBOOK: http://bit.ly/FBA24\nFollow A24 on TWITTER: http://bit.ly/TweetA24\nFollow A24 on INSTAGRAM: http://bit.ly/InstaA24</article>",
      "contentLength": 1029,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/6kT0bqzmrTc?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "28 YEARS LATER - with Anthony Dod Mantle",
      "url": "https://teamdeakins.libsyn.com/28-years-later-with-anthony-dod-mantle",
      "date": 1761125400,
      "author": "",
      "guid": 27859,
      "unread": true,
      "content": "<p>SEASON 2 - EPISODE 164 - 28 YEARS LATER - with Anthony Dod Mantle</p><p>In this special episode of the Team Deakins Podcast, cinematographer Anthony Dod Mantle (Season 1, Episode 68) returns to discuss his work on 28 YEARS LATER. The film was shot extensively using modified iPhones, and Anthony shares his early conversations with director Danny Boyle about the film's intended rural setting that informed their decision to commit to using the devices. Anthony later explains how he jailbroke the iPhone's camera system with the help of tech advisors and employees at Apple, and we discuss how the limitations of the phone forced Anthony to adjust the amount of light he used while filming. We also learn how the bar cam system actually works, and Anthony details the type of VFX work done throughout the film. We later investigate why the sequel was shot with an Alexa, and Anthony describes the elaborate build of the Bone Temple location featured prominently in both films.</p><p>Recommended Viewing: 28 YEARS LATER</p><p>This episode is sponsored by Sandstorm &amp; Aputure</p>",
      "contentLength": 1053,
      "flags": null,
      "enclosureUrl": "https://traffic.libsyn.com/secure/teamdeakins/S2-164_ADM_28_YEARS_Final_Sandstorm-Aputure-SPlea.mp3?dest-id=2018942",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Benny Safdie’s Closet Picks",
      "url": "https://www.youtube.com/watch?v=q3aEv64x4Fo",
      "date": 1761066243,
      "author": "CRITERION",
      "guid": 27710,
      "unread": true,
      "content": "<article>The writer, director, and actor returns to the Criterion Closet, where he shares how he and cinematographer Maceo Bishop studied documentaries like THE WAR ROOM when making their new film THE SMASHING MACHINE, shouts out the singular performances in CARNAL KNOWLEDGE, and talks about watching FLOW with his kids and their cat.\n\nYou can watch THE WAR ROOM, WHEN WE WERE KINGS, WIM WENDERS: THE ROAD TRILOGY, THE RED BALLOON on the Criterion Channel.</article>",
      "contentLength": 448,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/q3aEv64x4Fo?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "When an Actor Didn’t Care About Fame - Viggo Mortensen",
      "url": "https://www.youtube.com/watch?v=hWFdhollEss",
      "date": 1760889672,
      "author": "FilmStack",
      "guid": 27235,
      "unread": true,
      "content": "<article>Viggo Mortensen didn’t become an actor to chase fame. He didn’t break out in Hollywood until his forties, and even then he refused to sell out.\n\nThroughout the 80s and 90s he worked in smaller roles and smaller films. But then came The Lord of the Rings. Cast at the last minute as Aragorn, he threw himself into the role, breaking toes on camera, doing nearly all of his own stunts, and even carrying his sword everywhere he went. The trilogy made him a star, but that was never the point.\n\nInstead of cashing in, he turned down other franchises and bigger projects, choosing riskier films instead like A HIstory of Violence, Eastern Promises and Captain Fantastic. He starved himself for The Road, stuffed himself with pizza for Green Book, and earned Oscar nominations along the way.\n\nFor him, fame was never the goal. Acting, painting, writing, and music were all just different ways to express himself, not ways to be seen.\n\nThis is the story of when an actor didn’t care about fame, and only focused on the work itself. This is Viggo Mortensen.\n\nChapters:\n00:00 - Intro\n00:53 - Slow and Steady\n05:28 - A Last Minute Star\n09:16 - Doesn’t Need Fame\n13:45 - Art Above All\n\nViggo Mortensen. Aragorn. The Lord of the Rings. Green Book. Captain Fantastic. A History of Violence. Eastern Promises. GI Jane. Witness. Crimson Tide. Thirteen Lives. David Cronenberg. Peter Jackson. Best Actor Oscar. Daylight. Hidalgo. The Fellowship Of The Ring. The Two Towers. The Return of the King. Appaloosa. A Dangerous Method. Crimes of the Future. Carlito's Way. \n\nIf you like this video don't forget to leave a like, and if you're interested in videos about movies and the film industry in general, make sure to subscribe to FilmStack for more great content.\n\nIf you have any other ideas for videos, leave a comment and I might make a video with your idea.\n\nPatreon: https://patreon.com/FilmStack\nTwitter: https://twitter.com/realFilmStack\nInstagram: https://www.instagram.com/realfilmstack/\n\n#viggomortensen    #actor   #lotr</article>",
      "contentLength": 2023,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/hWFdhollEss?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Tracy Letts's Closet Picks",
      "url": "https://www.youtube.com/watch?v=EQ7jDVdL5Ko",
      "date": 1760801407,
      "author": "CRITERION",
      "guid": 27121,
      "unread": true,
      "content": "<article>The playwright and actor praises DO THE RIGHT THING as the best film of the eighties, talks about the comfort of watching his favorite westerns, and selects Chicago cinema classics like HOOP DREAMS and LOVE JONES.</article>",
      "contentLength": 213,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/EQ7jDVdL5Ko?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Mark Kermode reviews Roofman",
      "url": "https://www.youtube.com/watch?v=wn79uvZ9EOo",
      "date": 1760655677,
      "author": "Kermode and Mayo's Take",
      "guid": 26777,
      "unread": true,
      "content": "<article>#MarkKermode #SimonMayo #FilmReviews\n\nA charismatic criminal, while on the run from the police, hides in a hidden space of a toy store. There, he adopts a new identity and becomes involved with an employee, beginning a relationship as unlikely as it is risky.\n\n\nTo hear more, follow Kermode and Mayo's Take wherever you get your podcasts: https://podfollow.com/1616559297</article>",
      "contentLength": 371,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/wn79uvZ9EOo?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Mark Kermode reviews Black Phone 2",
      "url": "https://www.youtube.com/watch?v=8W6nbeDkBqo",
      "date": 1760655677,
      "author": "Kermode and Mayo's Take",
      "guid": 26778,
      "unread": true,
      "content": "<article>#MarkKermode #SimonMayo #FilmReviews\n\nAs Finn, now 17, struggles with life after his captivity, his sister begins receiving calls in her dreams from the black phone and seeing disturbing visions of three boys being stalked at a winter camp known as Alpine Lake.\n\n\nTo hear more, follow Kermode and Mayo's Take wherever you get your podcasts: https://podfollow.com/1616559297</article>",
      "contentLength": 373,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/8W6nbeDkBqo?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Simon Mayo Interviews Russell Tovey",
      "url": "https://www.youtube.com/watch?v=gdXULyGE7WM",
      "date": 1760655674,
      "author": "Kermode and Mayo's Take",
      "guid": 26774,
      "unread": true,
      "content": "<article>#MarkKermode #SimonMayo #FilmReviews\n\nTo hear more, follow Kermode and Mayo's Take wherever you get your podcasts: https://podfollow.com/1616559297</article>",
      "contentLength": 147,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/gdXULyGE7WM?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Mark Kermode reviews Frankenstein",
      "url": "https://www.youtube.com/watch?v=fXdhDRxosnU",
      "date": 1760655674,
      "author": "Kermode and Mayo's Take",
      "guid": 26775,
      "unread": true,
      "content": "<article>#MarkKermode #SimonMayo #FilmReviews\n\nA brilliant but egotistical scientist brings a creature to life in a monstrous experiment that ultimately leads to the undoing of both the creator and his tragic creation.\n\nTo hear more, follow Kermode and Mayo's Take wherever you get your podcasts: https://podfollow.com/1616559297</article>",
      "contentLength": 320,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/fXdhDRxosnU?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "17/10/2025 Box Office Top Ten",
      "url": "https://www.youtube.com/watch?v=FZDpT4bD3Pg",
      "date": 1760655674,
      "author": "Kermode and Mayo's Take",
      "guid": 26776,
      "unread": true,
      "content": "<article>#MarkKermode #SimonMayo #FilmReviews\n\nMark and Simon Mayo run through this week's box office top 10…\n\nTo hear more, follow Kermode and Mayo's Take wherever you get your podcasts: https://podfollow.com/1616559297</article>",
      "contentLength": 213,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/FZDpT4bD3Pg?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "The best/worst dad jokes from the Laughter Lift 17/10/2025",
      "url": "https://www.youtube.com/watch?v=fXTfcDVaHhc",
      "date": 1760655671,
      "author": "Kermode and Mayo's Take",
      "guid": 26772,
      "unread": true,
      "content": "<article>#MarkKermode #SimonMayo #FilmReviews\n\nMark Kermode and Simon Mayo\n\nTo hear more, follow Kermode and Mayo's Take wherever you get your podcasts: https://podfollow.com/1616559297</article>",
      "contentLength": 176,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/fXTfcDVaHhc?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Mark Kermode reviews After The Hunt",
      "url": "https://www.youtube.com/watch?v=KOsOLjG0CG8",
      "date": 1760655671,
      "author": "Kermode and Mayo's Take",
      "guid": 26773,
      "unread": true,
      "content": "<article>#MarkKermode #SimonMayo #FilmReviews\n\nA college professor finds herself at a personal and professional crossroads when a star pupil levels an accusation against one of her colleagues and a dark secret from her own past threatens to come to light.\n\nTo hear more, follow Kermode and Mayo's Take wherever you get your podcasts: https://podfollow.com/1616559297</article>",
      "contentLength": 357,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/KOsOLjG0CG8?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "FULL SHOW: Has FRANKENSTEIN got Mark (re)animated? + Russell Tovey",
      "url": "https://www.youtube.com/watch?v=g53Helvi37A",
      "date": 1760643007,
      "author": "Kermode and Mayo's Take",
      "guid": 26735,
      "unread": true,
      "content": "<article>Vanguardistas have more fun—so if you don’t already subscribe to the podcast, join the Vanguard today via Apple Podcasts or extratakes.com for non-fruit-related devices. In return you’ll get a whole extra Take 2 alongside Take 1 every week, with bonus reviews, more viewing recommendations from the Good Doctors and whole bonus episodes just for you. And if you’re already a Vanguardista, we salute you. \n\nAnother packed show this week with four movie reviews for your listening pleasure. First up, ‘Black Phone 2’ -- the sequel to 2021’s comms-based chiller, starring Ethan Hawke. Like a lot of horror movies, the fact that his character died in the last film isn’t really a big deal. Speaking of reanimation, we’ve got Guillermo del Toro’s Frankenstein too—a fresh take on the much-adapted classic horror novel, this time starring Jacob Elordi as the monster. ‘Roofman’ sees Channing Tatum hiding in a Toys ‘R’ Us in a crime caper based on a bizarre true story from ‘The Place Beyond The Pines’ director Derek Cianfrance—and finally, a new Luca Guadagnino out this week too. ‘After The Hunt’ stars Julia Roberts as a Yale college professor frustrated by her student’s allegations against a colleague... and it’s ripe to get under Mark’s skin—so buckle up for that one. \n\nPlus, those of you who enjoyed Mark’s review of ‘Plainclothes’ last week will be pleased to hear that this week we’re welcoming the very lovely Russell Tovey to the show. The charged drama follows an undercover cop assigned to arrest gay men at cruising spots—and Russell plays a target who becomes an unexpected love interest. He and Simon unpack the film and how it speaks to today—plus a bit of art chat and a mysterious arty paperback too... \n\nStrap in too for what we think is an especially good Laughter Lift, if we do say so ourselves—and more of your top correspondence answered—including a fascinating neuroscientific take on tearjerkers. Link here to the article mentioned in that one: https://medium.com/@itsanavidreader/why-we-cry-at-movies-but-not-real-life-the-psychology-behind-emotional-processing-de18f2dbf624 \n\nAnd don’t miss our upcoming LIVE Christmas Extravaganza at London’s Prince Edward Theatre. Tickets here: fane.co.uk/kermode-mayo   \n \n \nTimecodes (for Vanguardistas listening ad-free) \n\n\nBlack Phone 2 Review: 00;09;04\n\nBox Office Top Ten: 00;15;35  \n\nRussell Tovey Interview: 00;28;23 \n\nAfter The Hunt Review: 00;43;56 \n\nLaughter Lift: 00;52;30 \n\nRoofman Review: 00;59;31 \n\nFrankenstein Review: 01;08;14 \n\n \n\n \n\nYou can contact the show by emailing correspondence@kermodeandmayo.com or you can find us on social media, @KermodeandMayo \n\nPlease take our survey and help shape the future of our show: https://www.kermodeandmayo.com/survey  \n\nEXCLUSIVE NordVPN Deal ➼ https://nordvpn.com/take Try it risk-free now with a 30-day money-back guarantee! \n\nA Sony Music Entertainment production.     \n\nFind more great podcasts from Sony Music Entertainment at sonymusic.com/podcasts and follow us @sonypodcasts   \n\nTo advertise on this show contact: podcastadsales@sonymusic.com</article>",
      "contentLength": 3142,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/g53Helvi37A?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "IRIS PRIZE LGBTQ+ FILM FESTIVAL - with Lewis Bayley",
      "url": "https://teamdeakins.libsyn.com/iris-prize-lgbtq-film-festival-with-lewis-bayley",
      "date": 1760520600,
      "author": "",
      "guid": 26268,
      "unread": true,
      "content": "<p>SEASON 2 - EPISODE 163 - Iris Prize LGTBQ+ Film Festival - with Lewis Bayley</p><p>In this special episode of the Team Deakins Podcast, we speak with Lewis Bayley, Industry Coordinator for the Iris Prize LGBTQ+ Film Festival. Lewis invited us to speak with him about filmmaking earlier this year, and what you'll hear is that recorded conversation. We had the pleasure of discussing many topics with Lewis, such as the overall importance of film festivals and our longtime efforts giving back to younger generations of filmmakers. Additionally, we share a few work stories from our long careers, Roger gives a preview of what to expect in his upcoming memoir, Reflections, and James reveals the game she played with director Martin Scorsese while we were shooting KUNDUN in the Moroccan desert. The Iris Prize LGBTQ+ Film Festival is hosted annually in Cardiff, Wales with talks, panels, and screenings of shorts and features highlighting the myriad of experiences within the global LGBTQ+ community, and we were happy to be a small part of their 19th edition.&nbsp;</p><p>This episode is sponsored by Aputure &amp; Sandstorm</p>",
      "contentLength": 1103,
      "flags": null,
      "enclosureUrl": "https://traffic.libsyn.com/secure/teamdeakins/S2-163_Iris_Prize_Final_Aputure-Sandstorm-SPlea.mp3?dest-id=2018942",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Ethel Cain’s Closet Picks",
      "url": "https://www.youtube.com/watch?v=ld19PMXUyqg",
      "date": 1760465658,
      "author": "CRITERION",
      "guid": 26112,
      "unread": true,
      "content": "<article>The singer-songwriter shares why THELMA &amp; LOUISE was a North Star when writing her first album, praises the way DAYS OF HEAVEN immerses you in its beauty, and talks about her deep affection for GREY GARDENS.</article>",
      "contentLength": 207,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/ld19PMXUyqg?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "The Criterion Closet: Chicago Edition",
      "url": "https://www.youtube.com/watch?v=ujTba4LsZVs",
      "date": 1760383743,
      "author": "CRITERION",
      "guid": 25881,
      "unread": true,
      "content": "<article>Have you heard? The Criterion Mobile Closet is heading to the Chicago International Film Festival! From October 17-19, join us on NEWCITY Lincoln Park — come in, explore the collection, and make your own Closet video! Head here to sign up and get all the information you'll need to join us and more! We can't wait to meet you. https://bit.ly/4po9hSo\n\nLOCATION\nNEWCITY Lincoln Park\n1457 N. Halsted St.\nChicago, IL 60642\n\nOPENING HOURS\nOctober 17: 3–7 p.m.\nOctober 18–19: 11 a.m.–7 p.m.</article>",
      "contentLength": 492,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/ujTba4LsZVs?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Half in the Bag - Tron: Ares",
      "url": "https://www.youtube.com/watch?v=nTj2n6XytrA",
      "date": 1760224635,
      "author": "RedLetterMedia",
      "guid": 25585,
      "unread": true,
      "content": "<article>Disney decided to make another attempt to make Tron happen. It's morbin' time! If at first you don't succeed, Tron, Tron again.</article>",
      "contentLength": 127,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/nTj2n6XytrA?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Luca Guadagnino’s Closet Picks",
      "url": "https://www.youtube.com/watch?v=fodK93XWLwg",
      "date": 1760121461,
      "author": "CRITERION",
      "guid": 25388,
      "unread": true,
      "content": "<article>The writer and director talks about the influence of Samuel Fuller’s films on his own, shares what makes FAT GIRL so viscerally devastating, and praises the legendary work of Youssef Chahine.</article>",
      "contentLength": 193,
      "flags": null,
      "enclosureUrl": "https://www.youtube.com/v/fodK93XWLwg?version=3",
      "enclosureMime": "",
      "commentsUrl": null
    }
  ],
  "tags": [
    "movies"
  ]
}