{
  "id": "i2nisf4o",
  "title": "Reddit",
  "displayTitle": "Reddit",
  "url": "",
  "feedLink": "",
  "isQuery": true,
  "isEmpty": false,
  "isHidden": false,
  "itemCount": 38,
  "items": [
    {
      "title": "[D] 100 Hallucinated Citations Found in 51 Accepted Papers at NeurIPS 2025",
      "url": "https://www.reddit.com/r/MachineLearning/comments/1qjz88r/d_100_hallucinated_citations_found_in_51_accepted/",
      "date": 1769099546,
      "author": "/u/mgcdot",
      "guid": 37968,
      "unread": true,
      "content": "   submitted by   <a href=\"https://www.reddit.com/user/mgcdot\"> /u/mgcdot </a>",
      "contentLength": 29,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Announcing the Checkpoint/Restore Working Group",
      "url": "https://kubernetes.io/blog/2026/01/21/introducing-checkpoint-restore-wg/",
      "date": 1769091715,
      "author": "/u/dshurupov",
      "guid": 38006,
      "unread": true,
      "content": "<p>The community around Kubernetes includes a number of Special Interest Groups (SIGs) and Working Groups (WGs) facilitating discussions on important topics between interested contributors. Today we would like to announce the new <a href=\"https://github.com/kubernetes/community/tree/master/wg-checkpoint-restore\">Kubernetes Checkpoint Restore WG</a> focusing on the integration of Checkpoint/Restore functionality into Kubernetes.</p><p>There are several high-level scenarios discussed in the working group:</p><ul><li>Optimizing resource utilization for interactive workloads, such as Jupyter notebooks and AI chatbots</li><li>Accelerating startup of applications with long initialization times, including Java applications and <a href=\"https://doi.org/10.1145/3731599.3767354\">LLM inference services</a></li><li>Using periodic checkpointing to enable fault-tolerance for long-running workloads, such as distributed model training</li><li>Providing <a href=\"https://doi.org/10.1007/978-3-032-10507-3_3\">interruption-aware scheduling</a> with transparent checkpoint/restore, allowing lower-priority Pods to be preempted while preserving the runtime state of applications</li><li>Facilitating Pod migration across nodes for load balancing and maintenance, without disrupting workloads.</li><li>Enabling forensic checkpointing to investigate and analyze security incidents such as cyberattacks, data breaches, and unauthorized access.</li></ul><p>Across these scenarios, the goal is to help facilitate discussions of ideas between the Kubernetes community and the growing Checkpoint/Restore in Userspace (CRIU) ecosystem. The CRIU community includes several projects that support these use cases, including:</p><ul><li><a href=\"https://github.com/checkpoint-restore/criu\">CRIU</a> - A tool for checkpointing and restoring running applications and containers</li><li><a href=\"https://github.com/checkpoint-restore/checkpointctl\">checkpointctl</a> - A tool for in-depth analysis of container checkpoints</li><li><a href=\"https://github.com/checkpoint-restore/criu-coordinator\">criu-coordinator</a> - A tool for coordinated checkpoint/restore of distributed applications with CRIU</li></ul><p>More information about the checkpoint/restore integration with Kubernetes is also available <a href=\"https://criu.org/Kubernetes\">here</a>.</p><p>If you are interested in contributing to Kubernetes or CRIU, there are several ways to participate:</p>",
      "contentLength": 1870,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": "https://www.reddit.com/r/kubernetes/comments/1qjvsp5/announcing_the_checkpointrestore_working_group/"
    },
    {
      "title": "Rust 1.93.0 is out",
      "url": "https://blog.rust-lang.org/2026/01/22/Rust-1.93.0/",
      "date": 1769090649,
      "author": "/u/manpacket",
      "guid": 37957,
      "unread": true,
      "content": "<p>The Rust team is happy to announce a new version of Rust, 1.93.0. Rust is a programming language empowering everyone to build reliable and efficient software.</p><p>If you have a previous version of Rust installed via , you can get 1.93.0 with:</p><p>If you'd like to help us out by testing future releases, you might consider updating locally to use the beta channel () or the nightly channel (). Please <a href=\"https://github.com/rust-lang/rust/issues/new/choose\">report</a> any bugs you might come across!</p><h3><a href=\"https://blog.rust-lang.org/2026/01/22/Rust-1.93.0/#update-bundled-musl-to-1-2-5\" aria-hidden=\"true\"></a>\nUpdate bundled musl to 1.2.5</h3><p>The various  targets now all <a href=\"https://github.com/rust-lang/rust/pull/142682\">ship</a> with musl 1.2.5. This primarily affects static musl builds for , , and  which bundled musl 1.2.3. This update comes with <a href=\"https://musl.libc.org/releases.html\">several fixes and improvements</a>, and a breaking change that affects the Rust ecosystem.</p><p>For the Rust ecosystem, the primary motivation for this update is to receive major improvements to\nmusl's DNS resolver which shipped in 1.2.4 and received bug fixes in 1.2.5. When using \ntargets for static linking, this should make portable Linux binaries that do networking more\nreliable, particularly in the face of large DNS records and recursive nameservers.</p><h3><a href=\"https://blog.rust-lang.org/2026/01/22/Rust-1.93.0/#allow-the-global-allocator-to-use-thread-local-storage\" aria-hidden=\"true\"></a>\nAllow the global allocator to use thread-local storage</h3><p>Rust 1.93 adjusts the internals of the standard library to permit global allocators written in Rust\nto use std's <a href=\"https://doc.rust-lang.org/stable/std/macro.thread_local.html\"></a> and\n<a href=\"https://doc.rust-lang.org/stable/std/thread/fn.current.html\"></a> without\nre-entrancy concerns by using the system allocator instead.</p><h3><a href=\"https://blog.rust-lang.org/2026/01/22/Rust-1.93.0/#cfg-attributes-on-asm-lines\" aria-hidden=\"true\"></a> attributes on  lines</h3><p>Previously, if individual parts of a section of inline assembly needed to be 'd, the full \nblock would need to be repeated with and without that section. In 1.93,  can now be applied to\nindividual statements within the  block.</p><pre data-lang=\"rust\"><code data-lang=\"rust\"></code></pre><p>Many people came together to create Rust 1.93.0. We couldn't have done it without all of you. <a href=\"https://thanks.rust-lang.org/rust/1.93.0/\">Thanks!</a></p>",
      "contentLength": 1650,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": "https://www.reddit.com/r/rust/comments/1qjvdd9/rust_1930_is_out/"
    },
    {
      "title": "ZXC: another (too) fast decompressor",
      "url": "https://github.com/hellobertrand/zxc",
      "date": 1769088909,
      "author": "/u/pollop-12345",
      "guid": 37949,
      "unread": true,
      "content": "",
      "contentLength": 0,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": "https://www.reddit.com/r/programming/comments/1qjuogx/zxc_another_too_fast_decompressor/"
    },
    {
      "title": "I made a documentary about Open Source in Ukraine and around the world",
      "url": "https://www.reddit.com/r/linux/comments/1qjujym/i_made_a_documentary_about_open_source_in_ukraine/",
      "date": 1769088591,
      "author": "/u/whit537",
      "guid": 37939,
      "unread": true,
      "content": "",
      "contentLength": 0,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "30 years of ReactOS",
      "url": "https://reactos.org/blogs/30yrs-of-ros/",
      "date": 1769088545,
      "author": "/u/anh0516",
      "guid": 37940,
      "unread": true,
      "content": "<p>Happy Birthday ReactOS! Today marks 30 years since <a href=\"https://github.com/reactos/reactos/commit/0f94427db073a20c24f9d85c8531fbe16490af43\">the first commit to the ReactOS source tree</a>.\nIt’s been such a long journey that many of our contributors today, including myself, were not alive during this event.\nYet our mission to deliver “your favorite Windows apps and drivers in an open-source environment you can trust” continues to bring people together.\nLet’s take a brief look at some of the high and low points throughout our history.</p><h2>1996-2003: The Painful Road to ReactOS 0.1.0</h2><p>ReactOS started from the ashes of the FreeWin95 project, which aimed to provide a free and open-source clone of Windows 95.\nFreeWin95 suffered from analysis paralysis, attempting to plan the whole system before writing any code.\nTired of the lack of progress on the project, Jason Filby took the reins as project coordinator and led a new effort targeting Windows NT.\nThe project was renamed to “ReactOS” as it was a reaction to Microsoft’s monopolistic position in home computer operating systems.</p><p>Progress on ReactOS was very slow at first.\nContributors had to first build a very basic NT-like kernel before they could develop drivers for it, then continue developing the kernel; not too dissimilar to the process of bootstrapping a new programming language.\nOnce a few basic drivers were written, other contributors were able to learn from these examples and develop other drivers.</p><p>While writing this article, I reached out to Eric Kohl. He developed the original storage driver stack for ReactOS (atapi, scsiport, class2, disk, cdrom, cdfs) and has been with the project since 1998. I asked him about his experiences with ReactOS during this time, how he found the project, and what contributing to ReactOS was like during those early days. He wrote:</p><blockquote><p>I think I found ReactOS while searching for example code for my contributions to the WINE project.\nI subscribed to the mailing list and followed the discussions for a few days.\nThe developers were discussing the future of shell.exe, a little command line interpreter that could only change drives and directories and execute programs.\nA few days [later] I had started to convert the FreeDOS command.com into a Win32 console application, because I wanted to extend it to make it 4DOS compatible.\n4DOS was a very powerful command line interpreter.\nOn December 4th, 1998 I introduced myself and suggested to use my converted FreeDOS command.com as the future ReactOS cmd.exe.\nI had a little conversation with Jason Filby and Rex Joliff, the CVS repository maintainer.\nI sent my cmd.exe code to Rex and he applied it to the repository.\nAfter applying a few more cmd-related patches over the next weeks, Rex asked me whether I would like to have write-access to the repository.\nI accepted the offer…</p><p>The first version I downloaded and used was 0.0.8.\nIt was not much more than a DOS-based bootloader, some drivers, and a basic kernel that ran a few test routines after initialization.</p><p>Version 0.0.8 didn’t use PE files, but flat (position independent) binaries.\nThere was no PE loader,  no smss, no csrss, no winlogon, no process heaps, no process environments, no threads, etc.\nEach and every little feature was a milestone.</p><p>Initially there was not a review process at all.\nYou write some code, test it and fix it until it works.\nThen you commit it.\nIf something failed on another machine, you got a reply on the mailing list and discussed a solution.\nYou fixed the issue and committed a fix.\nThat’s how it worked.</p><p>There was always an open and friendly atmosphere.\nIt was and still is always nice to talk to other developers.\nNo fights, no wars, like in some other projects.</p></blockquote><p><em>Editors note: minor errors were corrected.</em></p><p>ReactOS 0.1.0 was released on February 1st, 2003 and received minor updates up until November 2003.\nReactOS 0.1.0 was the first version of ReactOS that could boot from a CD.\nIt had a command line interface and no desktop.\nWatch a demo of it below, provided courtesy of archeYR.</p><a href=\"https://youtu.be/rgRMemZcVoM\" target=\"_blank\" rel=\"noopener noreferrer\"><img src=\"https://reactos.org/img/blogs/30yrs-of-ros/ros-0.1.0-thumbnail.png\" alt=\"See ReactOS 0.1.0 by archeYR\"></a><p>During this period ReactOS saw rapid development.\nNew drivers were being built all the time, a basic desktop was built, and ReactOS became increasingly stable and usable.\nPublic interest grew as ReactOS matured.\nIn October 2005, Jason Filby stepped down as project coordinator, and Steven Edwards was voted to be the next project coordinator.</p><div itemscope=\"\" itemtype=\"http://schema.org/ImageGallery\"><figure itemprop=\"associatedMedia\" itemscope=\"\" itemtype=\"http://schema.org/ImageObject\"><a href=\"https://reactos.org/img/blogs/30yrs-of-ros/ros-0.2.x-boot.png\" itemprop=\"contentUrl\"><img itemprop=\"thumbnail\" src=\"https://reactos.org/img/blogs/30yrs-of-ros/ros-0.2.x-boot.png\" alt=\"ReactOS 0.2.x boot screen\"></a><figcaption><p>ReactOS 0.2.x boot screen</p></figcaption></figure><figure itemprop=\"associatedMedia\" itemscope=\"\" itemtype=\"http://schema.org/ImageObject\"><a href=\"https://reactos.org/img/blogs/30yrs-of-ros/ros-0.2.x-desktop.png\" itemprop=\"contentUrl\"><img itemprop=\"thumbnail\" src=\"https://reactos.org/img/blogs/30yrs-of-ros/ros-0.2.x-desktop.png\" alt=\"ReactOS 0.2.x desktop and file explorer\"></a><figcaption><p>ReactOS 0.2.x desktop and file explorer</p></figcaption></figure><figure itemprop=\"associatedMedia\" itemscope=\"\" itemtype=\"http://schema.org/ImageObject\"><a href=\"https://reactos.org/img/blogs/30yrs-of-ros/ros-0.2.0-desktop.png\" itemprop=\"contentUrl\"><img itemprop=\"thumbnail\" src=\"https://reactos.org/img/blogs/30yrs-of-ros/ros-0.2.0-desktop.png\" alt=\"ReactOS 0.2.0 with VMware video driver for NT 4\"></a><figcaption><p>ReactOS 0.2.0 with VMware video driver for NT 4</p></figcaption></figure></div><p>It wasn’t all sunshine and rainbows though.\nIn January 2006, concerns grew about contributors having access to leaked Windows source code and possibly using this leaked source code in their contributions.\nIn response, Steven Edwards strengthened the project’s intellectual property policy and the project made the difficult decision to audit the existing source code and temporarily freeze contributions.</p><p>The ongoing audit and contribution freeze from the end of the ReactOS 0.2.x era slowed development and momentum considerably for ReactOS 0.3.x.\nFollowing challenges with the audit, Steven Edwards stepped down as project coordinator and Aleksey Bragin assumed the role by August 2006.</p><p>Despite the challenges during this time, ReactOS 0.3.x continued to build upon ReactOS’s legacy.\nReactOS 0.3.0 was released on August 28th, 2006.\nIt introduced networking support and a package manager called “Download!”.\nThis package manager would become the basis for RAPPS, the package manager built into modern versions of ReactOS.\nIn July 2008, the x86_64 port of ReactOS was started.\nOne year later, ReactOS 0.3.10 imported the <a href=\"http://alter.org.ua/soft/win/uni_ata/\">UniATA driver</a>, written by Alexandr Telyatnikov (Alter).\nWhile we run into limitations with the UniATA driver today, UniATA enabled ReactOS to support SATA storage devices and to support partitions greater than 8GB in size.\nOn February 8th, 2012, ReactOS 0.3.14 supported being built using the MSVC compiler and added visual style support.</p><div itemscope=\"\" itemtype=\"http://schema.org/ImageGallery\"><figure itemprop=\"associatedMedia\" itemscope=\"\" itemtype=\"http://schema.org/ImageObject\"><a href=\"https://reactos.org/img/blogs/30yrs-of-ros/ros-0.3.x-desktop.png\" itemprop=\"contentUrl\"><img itemprop=\"thumbnail\" src=\"https://reactos.org/img/blogs/30yrs-of-ros/ros-0.3.x-desktop.png\" alt=\"ReactOS 0.3.x desktop\"></a></figure><figure itemprop=\"associatedMedia\" itemscope=\"\" itemtype=\"http://schema.org/ImageObject\"><a href=\"https://reactos.org/img/blogs/30yrs-of-ros/ros-0.3.x-download.png\" itemprop=\"contentUrl\"><img itemprop=\"thumbnail\" src=\"https://reactos.org/img/blogs/30yrs-of-ros/ros-0.3.x-download.png\" alt=\"Download!, the package manager for ReactOS 0.3.x\"></a><figcaption><p>Download!, the package manager for ReactOS 0.3.x</p></figcaption></figure></div><h2>2016-Today: ReactOS 0.4.x</h2><p>ReactOS 0.4.0 was released on February 16th, 2016.\nIt introduced a new graphical shell that utilized more Windows features and was more similar architecturally to Windows Explorer.\nReactOS 0.4.0 also introduced support for kernel debugging using WinDbg when compiled with MSVC.\nBeing able to use standard Windows tools for kernel debugging has helped us progress considerably.\nReactOS 0.4.0 continued to receive incremental updates every few months up until versions 0.4.14 and 0.4.15 which had years of development updates each.\nToday, the x86_64 port of ReactOS is similarly functional to its x86 counterpart, but with no WoW64 subsystem to run x86 apps its usability is limited.</p><div itemscope=\"\" itemtype=\"http://schema.org/ImageGallery\"><figure itemprop=\"associatedMedia\" itemscope=\"\" itemtype=\"http://schema.org/ImageObject\"><a href=\"https://reactos.org/img/blogs/30yrs-of-ros/explorer-diagram.png\" itemprop=\"contentUrl\"><img itemprop=\"thumbnail\" src=\"https://reactos.org/img/blogs/30yrs-of-ros/explorer-diagram.png\" alt=\"A humorous diagram made in 2015 to explain the complexity of Windows Explorer\"></a><figcaption><p>A humorous diagram made in 2015 to explain the complexity of Windows Explorer</p></figcaption></figure><figure itemprop=\"associatedMedia\" itemscope=\"\" itemtype=\"http://schema.org/ImageObject\"><a href=\"https://reactos.org/img/blogs/30yrs-of-ros/ros-0.4.15-desktop.png\" itemprop=\"contentUrl\"><img itemprop=\"thumbnail\" src=\"https://reactos.org/img/blogs/30yrs-of-ros/ros-0.4.15-desktop.png\" alt=\"ReactOS 0.4.15 desktop, shown with Luna visual style and large taskbar icons applied\"></a><figcaption><p>ReactOS 0.4.15 desktop, shown with Luna visual style and large taskbar icons applied</p></figcaption></figure></div><p>We’re continuing to move ReactOS forward. Behind the scenes there are several out-of-tree projects in development. Some of these exciting projects include a new build environment for developers (RosBE), a new NTFS driver, a new ATA driver, multi-processor (SMP) support, support for class 3 UEFI systems, kernel and usermode address space layout randomization (ASLR), and support for modern GPU drivers built on WDDM.</p><p>The future of ReactOS will be written by the people who believe in the mission and are willing to help carry it forward.</p><p><em>Note: Statistics were calculated at commit f60b1c9</em></p><ul><li>Total unique contributors: 301</li><li>Total lines of code: 14,929,578</li></ul>",
      "contentLength": 7432,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": "https://www.reddit.com/r/linux/comments/1qjujbm/30_years_of_reactos/"
    },
    {
      "title": "[D] AISTATS 2026 Paper Acceptance Result",
      "url": "https://www.reddit.com/r/MachineLearning/comments/1qjuitb/d_aistats_2026_paper_acceptance_result/",
      "date": 1769088509,
      "author": "/u/mathew208",
      "guid": 37947,
      "unread": true,
      "content": "<div><p>AISTATS 2026 acceptance decisions are being released today. This thread is for discussing this year’s outcomes.</p></div>   submitted by   <a href=\"https://www.reddit.com/user/mathew208\"> /u/mathew208 </a>",
      "contentLength": 145,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Prominent Intel Compiler Engineer Heads Off To AMD",
      "url": "https://www.phoronix.com/news/Intel-Compiler-Expert-Now-AMD",
      "date": 1769088297,
      "author": "/u/anh0516",
      "guid": 37941,
      "unread": true,
      "content": "<p>Michael Larabel is the principal author of Phoronix.com and founded the site in 2004 with a focus on enriching the Linux hardware experience. Michael has written more than 20,000 articles covering the state of Linux hardware support, Linux performance, graphics drivers, and other topics. Michael is also the lead developer of the Phoronix Test Suite, Phoromatic, and OpenBenchmarking.org automated benchmarking software. He can be followed via <a href=\"https://twitter.com/MichaelLarabel\">Twitter</a>, <a href=\"https://www.linkedin.com/in/michaellarabel/\">LinkedIn</a>, or contacted via <a href=\"https://www.michaellarabel.com/\">MichaelLarabel.com</a>.</p>",
      "contentLength": 500,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": "https://www.reddit.com/r/linux/comments/1qjufxk/prominent_intel_compiler_engineer_heads_off_to_amd/"
    },
    {
      "title": "[R] CVPR 2026 Reviews today",
      "url": "https://www.reddit.com/r/MachineLearning/comments/1qjub2g/r_cvpr_2026_reviews_today/",
      "date": 1769087937,
      "author": "/u/gentaiscool",
      "guid": 38004,
      "unread": true,
      "content": "<p>waiting for CVPR reviews to be out</p>",
      "contentLength": 34,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Helm + container images across clusters... need better options",
      "url": "https://www.reddit.com/r/kubernetes/comments/1qjscp3/helm_container_images_across_clusters_need_better/",
      "date": 1769082145,
      "author": "/u/Timely-Dinner5772",
      "guid": 37960,
      "unread": true,
      "content": "<p>Running container images via Helm across clusters is a mess. Every small change in image or values can break stuff. Charts get messy fast. Env overrides, tags, versions all pile up. i tried Chainguard for auditing and building images but it feels heavy and rigid for our setup. Any sug for something lighter or more flexible that works at scale? Workflows, tools, whatever. Need ideas.</p>",
      "contentLength": 385,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Do not fall for complex technology",
      "url": "https://rushter.com/blog/complex-tech/",
      "date": 1769081488,
      "author": "/u/f311a",
      "guid": 37952,
      "unread": true,
      "content": "<p>Fifteen years ago, I wanted to set up a note-taking system.\nAt the time, Evernote was the tool everyone was talking about, so choosing it seemed like the right and easy decision.</p><p>After storing around 500 notes for eight years, Evernote became a mess to use.\nIt was bloated, heavily monetized, and slow to work with. So I wanted to switch.</p><p>About that time came Notion. Everyone was talking about it. I jumped on the bandwagon and migrated a few hundred of\nmy notes to it that were still relevant. It did not even occur to me that switching from a bloated and slow app to\na web app would result in a similar outcome later. I followed a popular choice again.</p><p>After struggling for a year, I switched to Markdown notes and a plugin for an editor that renders inline images.\nI'm still using this to this day. It is simple, and I will be able to open my notes 10-20 years later.\nI can edit them in any editor. It works offline and does not depend on commercial products.\nI encrypt my notes locally so they can be stored safely on any cloud service.</p><p>I don't even use images anymore, so this could be simple plain-text files.\nWhy did no one tell me that I can start simple and switch to a complex system if I really need it?</p><p>It took me almost ten years to understand that, don't be like me!</p><p>This process never stops. There are now Roam Research and Obsidian, where people spend more time organizing\nnotes than writing them. Some people become obsessed with documenting everything and never reading it anymore, just\nbecause everyone talks how cool it is.</p><p>Remember the peak of popularity of microservices and the use of GraphQL?\nSmall teams of 3-5 developers used them to build simple web apps\njust because it was cool and big tech was writing about it a lot.</p><p>Simple systems became more complex for no benefit. A complex working system should only grow from a simple one.\nYou need to gather initial knowledge and requirements about your project first. Iterating a simple system is much\nfaster and easier. When a project starts, things change a lot. It's common to rewrite the whole project from scratch 2-3\ntimes in startups just because the initial prototype resulted in so much technical debt and bad decisions. I had experienced this\nmultiple times at my jobs. Not every system should be complex in the first place.</p><p>If you can only start with a complex system, there is a high chance it's broken by design.</p><p>The list of complex technologies is very big and I can go on and on.\nOftentimes, you don't need to use ten cloud services, hundreds of serverless functions and so on.\nNot only can it be simpler, but it can also be faster and cheaper too!\nYou just need to ask yourself why you need a particular technology in this\nproject first. Sometimes the hardest part is to convince the management, though.</p><p>In blogging circles, one of the popular topics is \"I migrated my blog from X to Y\". Some people change\ntheir blog engines 3-4 times and I'm not an exception.</p><p>I started with WordPress, then I migrated to Django, and right now my blog is completely static.</p><p>When I was using Django, I needed a good server with proper caching so that when traffic spikes, it can handle it.</p><p>Right now, I don't need a database. Hosting static HTML files is simple, and you can do it for free.\nThe only dynamic part is  comments. I'm using CloudFlare workers with a simple 50-line script that just\nstores comments in Cloudflare Workers KV.</p><p>They are not loaded dynamically. I just import them to markdown\nfiles and regenerate the blog. There is no database to serve them. They are preserved in markdown forever.</p><p>The whole blog engine is 800 lines of Python code that supports comments, RSS, categories, and so on.\nI know exactly how it works, and adding new features is super easy. There is also nothing to hack.\nInternally, static website generators are pretty complex to handle various use cases.\nBut, if I were using a popular static generator, adding custom features would be still hard.</p><p>A lot of companies are trying to force AI everywhere. Look at Microsoft, they added it everywhere.\nIn most cases, it does not make the life of a user easier. In the case of Microsoft, it actually results in more bugs\nand the worst UI. This time, ignoring complexity is much harder for a user, so the best shot is to switch to Linux where you have full control.</p><p>I think about this a lot. It's easy to spot problems in other products, but the product that you are working on\ncan suffer from the same problems. It's harder to notice, especially when you don't use it.</p><p>Another problem with LLMs is that it is much easier to add new features to your project now.\nIf you use LLMs, keep things simple and the scope of changes limited.\nWhen you aim for big changes, the code quality drops significantly.\nYou stop paying attention to the changes to the point that you stop understanding how things work.</p><p>There is an old tale regarding code reviews. A team lead reviewed 100 lines of code and found three bugs.\nAfter that, he reviewed 1500 lines PR and found zero bugs. This happened because the scope of the changes was so big,\nthat his brain just refused to concentrate on every change.</p><p>The quality of LLM output depends on code size, too.\nTheir context is limited, and the bigger and more complex the codebase, the worse they perform.</p>",
      "contentLength": 5267,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": "https://www.reddit.com/r/programming/comments/1qjs5rf/do_not_fall_for_complex_technology/"
    },
    {
      "title": "A clear visual explanation of what HTTPS protects",
      "url": "https://howhttps.works/why-do-we-need-https/",
      "date": 1769080390,
      "author": "/u/Digitalunicon",
      "guid": 37950,
      "unread": true,
      "content": "<div><div><p>We need HTTPS for 3 reasons.</p></div></div><div><div><p>Privacy, integrity, and identification.</p></div></div><div><div><p>Let's talk about privacy first.</p></div></div><div><div><p>When you browse to a website without HTTPS, I could be eavesdropping on your password.</p></div></div><div><div><p>Reason number 2: integrity.</p></div></div><div><div><p>I am sending another message to Browserbird unencrypted.</p></div></div><div><div><p>But before it reaches Browserbird, I intercept the message.</p></div></div><div><div><p>I update the message to say bad things about Browserbird and forward it to him.</p></div></div><div><div><p>Why would Compugter say such things about me?</p></div></div><div><div><p>And crab-in-the-middle attacks are the worst.</p></div></div><div><div><p>I make sure that your communication is not being tampered with.</p></div></div><div><div><p>Reason number 3: identification.</p></div></div><div><div><p>Identification means that I can check that this message is coming from Compugter.</p></div></div><div><div><p>HTTPS, via SSL certificates, ensures you are connected exactly with the receiver you would expect.</p></div></div><div><div><p>This SSL certificate is valid and has been issued by a legitimate Certificate Authority. You are good to go.</p></div></div><div><div><p>We'll be talking more about SSL certificates and Certificate Authorities soon, so stay tuned.</p></div></div><div><div><h2>Next on HowHTTPS.works...</h2><p>Now that we know the why, the next step is to understand symmetric and asymmetric encryption. Big words, but easy concepts.</p></div><a href=\"https://howhttps.works/the-keys/\"></a></div>",
      "contentLength": 1118,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": "https://www.reddit.com/r/programming/comments/1qjrudc/a_clear_visual_explanation_of_what_https_protects/"
    },
    {
      "title": "[Media] musicfree: a cross-platform music downloader implemented in Rust",
      "url": "https://www.reddit.com/r/rust/comments/1qjqq51/media_musicfree_a_crossplatform_music_downloader/",
      "date": 1769076437,
      "author": "/u/Every_Juggernaut7580",
      "guid": 37956,
      "unread": true,
      "content": "<p>musicfree is a music download tool written in pure Rust. It supports multiple platforms, including Windows, macOS, Unix, and Android. There are two versions available: a CLI version at <a href=\"https://github.com/ahaoboy/musicfree\">musicfree</a> and a Tauri version at <a href=\"https://github.com/ahaoboy/musicfree-tauri\">musicfree-tauri</a>.</p><p>Currently, it supports downloading single videos from YouTube and Bilibili, downloading playlists, and cover images.</p>",
      "contentLength": 350,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Naked Steel: The Deep Tech & Security of Bare Metal",
      "url": "https://v.redd.it/9nal1fg8iveg1",
      "date": 1769076144,
      "author": "/u/Appropriate_Way4135",
      "guid": 38005,
      "unread": true,
      "content": "",
      "contentLength": 0,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": "https://www.reddit.com/r/kubernetes/comments/1qjqnc2/naked_steel_the_deep_tech_security_of_bare_metal/"
    },
    {
      "title": "Making and Scaling a Game Server in Kubernetes using Agones",
      "url": "https://noe-t.dev/posts/making-and-scaling-a-game-server-in-k8s-using-agones/",
      "date": 1769074966,
      "author": "/u/noe__0",
      "guid": 37963,
      "unread": true,
      "content": "<p>If you’re interested in Kubernetes like I am, you’ve probably found yourself exploring related projects on GitHub and you might have stumbled upon a repository called <a href=\"https://github.com/googleforgames/agones\" target=\"_blank\" rel=\"noreferrer\">Agones</a>. If you’ve never heard about it, Agones is a project created by Google to manage and deploy video game servers on Kubernetes.</p><p>Recently, I dipped my toes in the water and tried it out. I had a lot of fun doing so and I want to share everything I learned. In this article, we will go over the following:</p><ul><li>The creation of a basic .</li><li>Integrating it with .</li><li>Its deployment on .</li><li>The making of a <strong>matchmaking service in Go</strong>.</li><li>Setting up and benchmarking  for our infrastructure based on the matchmaking’s player queue.</li></ul><p>I’ll share a lot of relevant code snippets and diagrams, but if you want to get the full picture, you can find the source code and the Kubernetes manifests in this GitHub repository:</p><p>Before going any further, we need to address a question regarding Agones:  That was my first reaction upon discovering Agones because, in theory, anyone can just deploy their game server as a regular deployment on a cluster, right? Well, things are actually a bit more complicated than that.</p><p>If you look into the Agones documentation, you will find <a href=\"https://agones.dev/site/docs/faq/#cant-we-use-a-deployment-or-a-statefulset-for-game-server-workloads\" target=\"_blank\" rel=\"noreferrer\">this section</a> which basically answers the question. To put it simply, game server workloads are <strong>both stateful and stateless</strong>. An empty game server is stateless and can be safely deleted or moved, while a game server with players probably has in-memory state and must not leave the node.</p><p>In other words, Agones allows you to manage and scale game server workloads based not only on CPU, memory, or traffic but also on . Thanks to that, you can update game servers without shutting down servers with active players, reuse a game server on which a game has ended or even set autoscaling based on the number of full game servers. And much more.</p><h2>Developing a game server in Go</h2><p>To start, we obviously need a game to work with. For this purpose, I will be making a quick and simple game of  in Go.</p><p>Since this is just a simple demo, I won’t be trying to make something grandiose. It will just be a <strong>basic HTTP server with a WebSocket</strong> on which two players will connect to battle. For a real game, you would probably want to use UDP connections.</p><p>Both players will be connected to the WebSocket and will have to select their move. The connection stays open for both players until they both selected a move. Once both players chose their moves, the server sends the winner to them.</p><p>To do this, I used standard Go packages such as  and <code>github.com/gorilla/websocket</code>.</p><div><div><pre tabindex=\"0\"><code data-lang=\"go\"></code></pre></div></div><p>The root path () serves the index.html file (which is <a href=\"https://pkg.go.dev/embed\" target=\"_blank\" rel=\"noreferrer\">embedded</a> in the binary) and the  path serves the WebSocket connection.</p><p>The index.html is just a very basic web page with buttons for each move (rock, paper, scissors). It uses JavaScript to send a message to the WebSocket when a button is clicked. Results are displayed in the  div.</p><div><div><pre tabindex=\"0\"><code data-lang=\"html\"></code></pre></div></div><p>I won’t go too much into details about the game logic since, well, it’s just a simple game of rock paper scissors.</p><p>The game loop is fully coded in the WebSocket handler, and it uses methods from the  package located in . Here’s a basic overview of what this handler does:</p><div><div><pre tabindex=\"0\"><code data-lang=\"go\"></code></pre></div></div><p>If you try to make something similar, keep in mind that you have to handle what happens when a player disconnects or leaves the game. In this case, I just made it so the player gets deleted from the game allowing them or someone else to rejoin. You may want to just end the game or kick everyone else if one of the players disappears.</p><p>In order to manage concurrency, I use a simple  to ensure that the player list and moves are not modified at the same time. Before every operation, I lock the mutex and unlock it after the operation is complete. For example:</p><div><div><pre tabindex=\"0\"><code data-lang=\"go\"></code></pre></div></div><p>Upon game end, the WebSocket connections are closed and the game server shuts down.</p><p>The end result looks like this:</p><p>Very impressive, isn’t it? Jokes aside, this simple multiplayer game will be more than enough for us to get started with Agones.</p><h2>Adding Agones to a game server</h2><p>Now that we have a game server ready, we need to make some tweaks in order to deploy it with Agones. If you try to deploy it as of right now, it will just crash as Agones expects your container to send regular ping.</p><p>To explain briefly how things work in Agones, when deploying a game server, we use the well named  resource. You can think of GameServers as the equivalent of Pods in the Agones world. They are what will be running your game server container.</p><p>The main difference with regular Pods is that GameServers run your image alongside an  which is responsible for managing the lifecycle of the game server. This sidecar is responsible for ensuring that the game server is healthy and available for players. It communicates with the Kubernetes API to update the GameServer resource status.</p><pre>---\ntitle: GameServer Architecture\nconfig:\n  look: handDrawn\n---\ngraph TD\n    KubeAPI[\"kube-apiserver\"]\n\n    subgraph GameServer[\"GameServer\"]\n        subgraph Pod[\"Pod\"]\n            GameContainer[\"**Your Game Server** *Container*\"]\n            AgonesSidecar[\"**agones-sdk** <p>*Container*\"]\n\n            GameContainer &lt;--&gt;|SDK gRPC| AgonesSidecar\n        end\n    end\n\n    AgonesSidecar --&gt;|HTTP PATCH GameServer resource| KubeAPI\n</p></pre><p>The bare minimum to get your game server up and running with Agones is to implement a . To do this, we first need to import the <a href=\"https://agones.dev/site/docs/guides/client-sdks/\" target=\"_blank\" rel=\"noreferrer\">Agones Game Server Client SDK</a>. In my case, I will be importing the <a href=\"https://pkg.go.dev/agones.dev/agones/pkg/sdk\" target=\"_blank\" rel=\"noreferrer\">Go package</a> but there are also SDKs for other languages such as Java or C++ and also for game engines such as Unity or Unreal Engine.</p><p>Even if your language or game engine doesn’t have an SDK, you can still use Agones by making and deploying a sidecar container alongside your game server. This sidecar container would be responsible for communicating with Agones and you would just need to communicate with your game binary. Or else, you can just communicate directly with Agones using the <a href=\"https://agones.dev/site/docs/reference/grpc/\" target=\"_blank\" rel=\"noreferrer\">gRPC API</a> or the <a href=\"https://agones.dev/site/docs/reference/api/\" target=\"_blank\" rel=\"noreferrer\">HTTP API</a> which should be supported by most languages.</p><p>Once we have our SDK installed, we need to actually implement the health check. This is usually done by creating a loop that sends a ping to Agones every few seconds. Here’s how you can do it in Go:</p><div><div><pre tabindex=\"0\"><code data-lang=\"go\"></code></pre></div></div><p>Now, we can technically already deploy our game server on a Kubernetes cluster with Agones by creating a  with our game container image. However, we are far from production-ready. We still need to at least implement the following Agones functions:</p><ul><li> - To indicate that the game server is ready to accept connections from players.</li><li> - To tell Agones to shut down the game server.</li></ul><p>Implementing the  function is pretty straightforward. We just need to call it from the SDK when starting the game server:</p><div><div><pre tabindex=\"0\"><code data-lang=\"go\"></code></pre></div></div><p>For the  function, things are a bit more complicated. What we want to do is to implement a graceful shutdown process. Basically, it means that we need our server to handle signals like  by waiting for everything to complete before shutting down. It is especially important in order to avoid loss of player data or of an unsaved game for instance.</p><p>Fortunately, this pattern is pretty easy to implement in Go. We will be using the <a href=\"https://pkg.go.dev/context\" target=\"_blank\" rel=\"noreferrer\">context package</a> to handle cancellation and timeouts coupled with the <a href=\"https://pkg.go.dev/os/signal\" target=\"_blank\" rel=\"noreferrer\">signal package</a> to handle, as its name implies, signals.</p><p>We are first going to need to create a context that will be used all throughout our server. In order to have it be cancellable with Unix signals, we will be creating it using  from the  package. We can then, at the end of our  function, have all of our code for shutting down our server after .</p><div><div><pre tabindex=\"0\"><code data-lang=\"go\"></code></pre></div></div><p>Currently, we handle shutdown from signals correctly, but not necessarily gracefully. In general, when implementing this pattern, we want to ensure that all ongoing operations are <strong>completed before shutting down</strong>. In our case, this isn’t really important as the process of shutting down the client SDK and the HTTP server should be pretty straightforward.</p><p>However, let’s say you’re making an actual game: you may want to save the result of your game to a database, for example. In Kubernetes, Pods getting deleted are first sent a , and have a grace period of 30 seconds. After that, Kubernetes sends a , which you want to avoid if possible. If for some reason the database you’re sending your data to is experiencing issues, you will want to rollback your transaction before being forcefully terminated.</p><p>We can achieve this by having a timeout, and to do that, we’re going to make, once again, a new context, but with  this time around. This way, we will be able to pass down the context with timeout to our different shutdown functions and ensure that our game server is properly shut down in a given amount of time.</p><p>In my case, I set it up with a timeout of 10 seconds. This is more than enough for the Agones client SDK and the HTTP server to shut down gracefully.</p><div><div><pre tabindex=\"0\"><code data-lang=\"go\"></code></pre></div></div><p>With all of this, we now have the lifecycle of our game server fully implemented and ready to be deployed alongside Agones’ SDK sidecars in actual  resources.</p><p>Now that we have our game server ready, we can deploy it on a Kubernetes cluster. I’m using a basic <a href=\"https://kind.sigs.k8s.io/\" target=\"_blank\" rel=\"noreferrer\">kind</a> cluster for this example, but you can use any Kubernetes cluster you want. The only important requirement is to install <a href=\"https://agones.dev/\" target=\"_blank\" rel=\"noreferrer\">Agones</a> on your cluster. To do so, you can simply use <a href=\"https://helm.sh/\" target=\"_blank\" rel=\"noreferrer\">Helm</a> chart like so:</p><div><div><pre tabindex=\"0\"><code data-lang=\"sh\"></code></pre></div></div><p>We will be deploying our game server in the  namespace. If you want to deploy yours in a different one, you may need to change some values in your Helm deployment of Agones.</p><p>Once we have our cluster ready with Agones up and running, we can start by deploying our game server image in a simple <a href=\"https://agones.dev/site/docs/reference/gameserver/\" target=\"_blank\" rel=\"noreferrer\">GameServer</a> resource:</p><div><div><pre tabindex=\"0\"><code data-lang=\"yaml\"></code></pre></div></div><p>You should then be able to see it by running . You should see something like this:</p><div><div><pre tabindex=\"0\"><code data-lang=\"sh\"></code></pre></div></div><p>Notice how Agones picked a <strong>random port between 7000 and 8000</strong> for the game server. This port is exposed on the host node’s network using the <a href=\"https://v1-33.docs.kubernetes.io/docs/reference/generated/kubernetes-api/v1.33/#containerport-v1-core\" target=\"_blank\" rel=\"noreferrer\">hostPort</a> field of Pods. This means that you can access the game server directly from your host machine using the IP address and port number.</p><p>You can even check its events to see the different steps it went through:</p><div><div><pre tabindex=\"0\"><code data-lang=\"sh\"></code></pre></div></div><p>Which should give you something like this:</p><div><div><pre tabindex=\"0\"><code data-lang=\"sh\"></code></pre></div></div><p>You should be able to access the game directly from your web browser by visiting .</p><p>Next, we can deploy the game server in a <a href=\"https://agones.dev/site/docs/reference/fleets/\" target=\"_blank\" rel=\"noreferrer\">Fleet</a>. If GameServers are the equivalent of Pods, you can think of Fleets as the equivalent of Deployments or StatefulSets. They allow us to have replicas of our GameServer and scale them up and down without killing active game servers. We can create one just like so:</p><div><div><pre tabindex=\"0\"><code data-lang=\"yaml\"></code></pre></div></div><p>We can then check the GameServers it created:</p><div><div><pre tabindex=\"0\"><code data-lang=\"sh\"></code></pre></div></div><p>This fleet can easily be scaled up by running :</p><div><div><pre tabindex=\"0\"><code data-lang=\"sh\"></code></pre></div></div><p>But, right now, if you try to scale it down, it could kill active GameServers. What we want to do in order to avoid that is to use a <a href=\"https://agones.dev/site/docs/reference/gameserverallocation/\" target=\"_blank\" rel=\"noreferrer\">GameServerAllocation</a>. This type of resource allows us to set its state from  to , which will prevent Agones from deleting that GameServer. Let’s allocate a random GameServer from our fleet with :</p><div><div><pre tabindex=\"0\"><code data-lang=\"sh\"></code></pre></div></div><p>Now, let’s do something a bit extreme and scale the fleet down to 0 replicas:</p><div><div><pre tabindex=\"0\"><code data-lang=\"sh\"></code></pre></div></div><p>If you look at the list of GameServers, you’ll notice that the one we allocated is still there:</p><div><div><pre tabindex=\"0\"><code data-lang=\"sh\"></code></pre></div></div><p>This is great, as we managed to scale down without stopping a GameServer that has been marked as being allocated for a game. If you go ahead and finish playing a game on this server, you’ll notice that the GameServer gets automatically deleted.</p><p>Of course, in real life, you would probably use the Kubernetes API to allocate our GameServers instead of using kubectl. This way, we can automate the allocation process without manual intervention.</p><h2>Making a matchmaking service</h2><p>So far, we managed to make a game server, hook it up to Agones and deploy it on a Kubernetes cluster. All of this is great but it’s nothing we couldn’t have achieved by simply using regular Kubernetes resources such as Deployments or StatefulSets. But now that we have everything set up, we can actually go a bit further and exploit Agones’ features to have a  which will <strong>scale our game servers automatically based on demand 🚀</strong>.</p><p>Or, at least, that’s what we’re going to do in the next part of this post. For now, we’ll focus on making a matchmaking service that will match 2 players together and will allocate a GameServer to them.</p><p>If you look online, you might find an open-source solution for matchmaking called <a href=\"https://open-match.dev/\" target=\"_blank\" rel=\"noreferrer\">Open Match</a>. It has been made by Google, and it can work with Agones, which is great. However, as of writing this, there hasn’t been any update in over 2 years. A second version of Open Match called <a href=\"https://open-match.dev/site/v2/overview/\" target=\"_blank\" rel=\"noreferrer\">Open Match 2</a> seems to be planned but there are no releases yet and only a single person seems to be working on it.</p><p>Here’s what we’ll be working with:</p><pre>---\nconfig:\n  look: handDrawn\n---\nsequenceDiagram\n    participant Player as 👤 Player\n    participant WebSocketServer as 🌐 HTTP Server\n    participant Topic_matchmaking as 📇 Topic: matchmaking\n    participant Matcher as ⚙️ Matcher\n    participant Topic_match_results as 📇 Topic: match_results_{playerID}\n    participant KubernetesAPI as ☸️ Kubernetes API\n\n    Player-&gt;&gt;WebSocketServer: Connect via WebSocket\n    WebSocketServer-&gt;&gt;WebSocketServer: Generate playerID\n    WebSocketServer-&gt;&gt;Topic_match_results: Subscribe\n    WebSocketServer-&gt;&gt;Topic_matchmaking: Publish playerID\n\n    Topic_matchmaking-&gt;&gt;Matcher: Deliver playerID\n\n    alt No one waiting\n        Matcher-&gt;&gt;Matcher: Store playerID as waiting\n        Note right of Matcher: Wait for next player\n    else Another player waiting\n        Matcher-&gt;&gt;KubernetesAPI: Allocate GameServer\n        KubernetesAPI--&gt;&gt;Matcher: GameServer address\n        Matcher-&gt;&gt;Topic_match_results: Publish match for both players\n        Topic_match_results-&gt;&gt;WebSocketServer: Deliver match result\n        WebSocketServer-&gt;&gt;Player: Redirect to match-ip:port\n    end\n</pre><p>For simplicity’s sake, I copied the base structure of the game server and reused it in the matchmaking service. This is why we are once again working with an HTTP server serving a WebSocket on . This time, we redirect the player by opening the web page the matchmaking service will return.</p><p>The core component of this matchmaking system is the . As you can see on the diagram, we are working with two topics:</p><ul><li>: Player requests for a match.</li><li>: Topics for the response to the player.</li></ul><p>The brain of the operation is named the , and is basically a process that will take a player from the queue and match them with another one. Once a match is made, it will reserve a GameServer by creating a  through the Kubernetes API. It then sends them both the server address they need to join via the match results topic of both player.</p><p>To work with Pub/Sub in Go, we’ll be using a great library called <a href=\"https://github.com/ThreeDotsLabs/watermill\" target=\"_blank\" rel=\"noreferrer\">Watermill</a>, which will simplify the task a lot. What’s great about this library is that it works with a lot of different options, including Kafka, RabbitMQ or even PostgreSQL. To keep things simple, I chose to go with a simple <a href=\"https://watermill.io/pubsubs/gochannel/\" target=\"_blank\" rel=\"noreferrer\">Go Channel</a> which you can also use as a Pub/Sub with Watermill.</p><p>Here’s how the WebSocket handler initiates the matchmaking process and waits for a match result with Watermill:</p><div><div><pre tabindex=\"0\"><code data-lang=\"go\"></code></pre></div></div><p>As you can see, it’s pretty straightforward with functions such as  and .</p><p>That’s basically it for the “frontend” part of the matchmaking service, but there’s a second part which is called the matcher. It runs as a goroutine but it could be run as a separate service if we were to use another Pub/Sub. It’s responsible for matching two players from the  queue.</p><p>To do that, I used a <a href=\"https://watermill.io/docs/messages-router/\" target=\"_blank\" rel=\"noreferrer\">Router</a> from Watermill, which gives a lot of features that are pretty nice to build event-driven systems. In our case, I’m just using it to add a handler for the  topic, which can be done just like this:</p><div><div><pre tabindex=\"0\"><code data-lang=\"go\"></code></pre></div></div><p>Handler functions in Watermill work like you would expect, by taking a message as input to process it.</p><div><div><pre tabindex=\"0\"><code data-lang=\"go\"></code></pre></div></div><p>What’s really important are the parts that are highlighted. You should be able to see the basic matchmaking logic which is to set a player as  if no other player is waiting. And when a second player joins, match them together and publish the result to both players.</p><p>Last but not least, we have to take a look at the  function which allocates a random GameServer and returns its IP and port. To do that, I simply use the Kubernetes API to create a resource like we made earlier.</p><div><div><pre tabindex=\"0\"><code data-lang=\"go\"></code></pre></div></div><p>However, if you try deploying the matchmaking service just like that with a Deployment, it will actually not do anything. This is because by default, we are using the  ServiceAccount to access the Kubernetes API from our Pod. To fix this, we just need to create a new  and a  that grants the necessary permission to create  resources.</p><div><div><pre tabindex=\"0\"><code data-lang=\"yaml\"></code></pre></div></div><div><div><pre tabindex=\"0\"><code data-lang=\"yaml\"></code></pre></div></div><div><div><pre tabindex=\"0\"><code data-lang=\"yaml\"></code></pre></div></div><p>And then, we can use this newly created ServiceAccount in our Deployment:</p><div><div><pre tabindex=\"0\"><code data-lang=\"yaml\"></code></pre></div></div><p>Now, we can just create a Service for this Deployment and access it using port-forwarding like that:</p><div><div><pre tabindex=\"0\"><code data-lang=\"text\"></code></pre></div></div><p>If we access the matchmaking service at  and try to play a game, we get this:</p><p>As you can see from the screen briefly flashing to black, the matchmaking service indeed redirects to a game server once a match is found.</p><p>Something to keep in mind is that in its current state, the matchmaking is not scalable. You can’t really run multiple instances of the matchmaking as you could end up with players stuck in different matcher’s instances.</p><p>However, it shouldn’t really matter as you can shard the matchmaking service by region (eu, us, etc.) or skill-level (<a href=\"https://en.wikipedia.org/wiki/Elo_rating_system\" target=\"_blank\" rel=\"noreferrer\">Elo</a>, rank). Then, you can have an instance of the matchmaking service for each shard. For example, you could have an instance running only on <code>eu.elo100-200.matchmaking</code> and one on <code>us.elo100-200.matchmaking</code>.</p><p>Also, I used a WebSocket again because I shamelessly copy-pasted the code from the game server as the base for the matchmaking service. However, you would be better off using an HTTP API where you issue a ticket and poll the match result. Or, maybe even <a href=\"https://developer.mozilla.org/en-US/docs/Web/API/Server-sent_events\" target=\"_blank\" rel=\"noreferrer\">SSE</a>?</p><h2>Setting up autoscaling of game servers</h2><p>Everything works pretty well so far, right? Well, there’s still a problem that remains to be solved. If you’ve followed along until now, so far we have a game running on Agones. There are multiple instances and a matchmaking service that routes each player to one of them. However, if we have 6 players all playing at the same time, we’ll end up with our 3 games instances being allocated, making it impossible for the matchmaking service to find a game for any new players.</p><p>To solve this issue, we have to set up  for our fleet of game servers. To do that, we need to create a <a href=\"https://agones.dev/site/docs/reference/fleetautoscaler/\" target=\"_blank\" rel=\"noreferrer\">FleetAutoscaler</a>:</p><div><div><pre tabindex=\"0\"><code data-lang=\"yaml\"></code></pre></div></div><p>I set it up with a  which ensures that there’s always a buffer of ready game servers available. In this case, I set it to 10 instances which are checked every 5 seconds.</p><p>There are other policies which are also interesting to look at such as:</p><ul><li>The <a href=\"https://agones.dev/site/docs/reference/fleetautoscaler/#counter-and-list-autoscaling\" target=\"_blank\" rel=\"noreferrer\">counter policy</a> which scales based on a GameServer counter. It can be useful if you set up multiple rooms in a single game instance like I mentioned earlier.</li><li>The <a href=\"https://agones.dev/site/docs/reference/fleetautoscaler/#webhook-autoscaling\" target=\"_blank\" rel=\"noreferrer\">webhook policy</a> which allows us to scale based on a custom logic we can implement as a webhook handler. We can, for instance, scale it based on the number of players waiting in the matchmaking system.</li><li>The <a href=\"https://agones.dev/site/docs/reference/fleetautoscaler/#wasm-autoscaling\" target=\"_blank\" rel=\"noreferrer\">WASM policy</a> which as its name implies, allows us to scale based on a custom logic using WebAssembly modules. I have yet to find a use case for it, but it’s definitely interesting to explore.</li><li>The <a href=\"https://agones.dev/site/docs/reference/fleetautoscaler/#schedule-and-chain-autoscaling\" target=\"_blank\" rel=\"noreferrer\">Schedule policy</a> which is pretty neat as it allows us to set a policy for a specific time period. It can be useful to scale up during an event or for the release of a game, for example.</li></ul><p>For simplicity’s sake, we’ll continue with the buffer policy as it works decently well if we set the sync interval to a low value.</p><p>Now, for the fun part, let’s put this autoscaling to the test!</p><p>There’s a tool called <a href=\"https://k6.io/\" target=\"_blank\" rel=\"noreferrer\">k6</a> which is a load testing tool made by Grafana that can be used to simulate a large number of users connecting to our game server. We can use it to test our autoscaling policy and see how it performs under load. It simulates users with a custom script that can be written in JavaScript.</p><p>Here’s the one I made for this project:</p><div><div><pre tabindex=\"0\"><code data-lang=\"js\"></code></pre></div></div><p>As you can see, this script  opens the WebSocket connection with the matchmaking service and just sends a GET request to the game server.</p><p>We’ll be running this script in k6 with 100 virtual users for a duration of 30 seconds.</p><p>As you can see, the autoscaler has a hard time keeping up with the load. To avoid that, we can increase the buffer size and decrease the sync interval. Or even better, switch to the webhook policy and implement a webhook endpoint which exposes the number of players currently waiting for a game server allocation.</p><p>This little experiment with Agones took longer than I first expected it to be, but I learned a lot and had quite some fun. Overall, I would say that Agones is very interesting in the way it transforms how we work with Kubernetes.</p><p>I think making a game and a matchmaking system from scratch to work with Agones really helped me understand better how concepts would work together. I understood so much more about Agones doing it this way than I did at first when going through the documentation.</p><p>Still, there are many things I haven’t tried, such as the other autoscaling policies, using counters and lists, or just working with an actual game server with real-time communication in UDP. There are also related projects such as <a href=\"https://github.com/embarkstudios/quilkin\" target=\"_blank\" rel=\"noreferrer\">Quilkin</a> which is a UDP proxy that can be used to route traffic to game servers and seems to work well with Agones.</p><p>I hope this article has been helpful for you and that you have learned something new about Agones and Kubernetes. I would appreciate any feedback you might have on this article. Thank you for reading!</p>",
      "contentLength": 21445,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": "https://www.reddit.com/r/kubernetes/comments/1qjqbsx/making_and_scaling_a_game_server_in_kubernetes/"
    },
    {
      "title": "Using Go Workspaces? Stop scripting loops and use the work pattern",
      "url": "https://www.reddit.com/r/golang/comments/1qjngob/using_go_workspaces_stop_scripting_loops_and_use/",
      "date": 1769064413,
      "author": "/u/jayp0521",
      "guid": 37935,
      "unread": true,
      "content": "<p>​I haven't seen this discussed much in articles or tutorials, so I wanted to share a massive quality-of-life feature I stumbled across while digging through PRs.</p><p>If you use Go Workspaces, you have probably tried running `go generate ./...` from the root, only to find it fails or ignores your modules. Usually, the \"fix\" is searching online and finding hacky scripts involving sed, xargs, or manually iterating through every module one by one. It is annoying and brittle.</p><p>It turns out there is a native, elegant way to run commands against every module in your go.work file simultaneously. You simply use work as the package target.</p><p>Even AI assistants seem to hallucinate or get confused when I ask about this, likely because it’s a newer pattern that hasn't made it into the training data yet. Hopefully, this saves you some scripting time! Believe you need 1.25+</p>",
      "contentLength": 865,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "[D] Which data design patterns have held up for you in production?",
      "url": "https://www.reddit.com/r/MachineLearning/comments/1qjmqy8/d_which_data_design_patterns_have_held_up_for_you/",
      "date": 1769062021,
      "author": "/u/Aggravating_Map_2493",
      "guid": 37946,
      "unread": true,
      "content": "<p>I came across this article on <a href=\"https://medium.com/aws-in-plain-english/data-engineering-design-patterns-you-must-learn-in-2026-c25b7bd0b9a7\">data design patterns </a>and found it grounded in real system behavior rather than tools. It walks through patterns that show up when supporting ML and AI workloads at scale. After reading this , I was curious to hear from others here: which patterns you rely on most, which ones failed under scale and patterns you think are overused. I am keen on hearing more about failures and lessons learned than success stories from people who have been there and done that.</p>",
      "contentLength": 490,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "High cardinality explained with interactive examples",
      "url": "https://signoz.io/blog/high-cardinality-data/",
      "date": 1769059391,
      "author": "/u/ankit01-oss",
      "guid": 37951,
      "unread": true,
      "content": "",
      "contentLength": 0,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": "https://www.reddit.com/r/programming/comments/1qjlwk5/high_cardinality_explained_with_interactive/"
    },
    {
      "title": "Essay: Performance Reviews in Big Tech: Why “Fair” Systems Still Fail",
      "url": "https://medium.com/@dmitrytrifonov/big-tech-performance-review-01fff2c5924d",
      "date": 1769057863,
      "author": "/u/NoVibeCoding",
      "guid": 37953,
      "unread": true,
      "content": "",
      "contentLength": 0,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": "https://www.reddit.com/r/programming/comments/1qjleer/essay_performance_reviews_in_big_tech_why_fair/"
    },
    {
      "title": "Satya Nadella at Davos: a masterclass in saying everything while promising nothing",
      "url": "https://jpcaparas.medium.com/satya-nadella-at-davos-a-masterclass-in-saying-everything-while-promising-nothing-8495c75c5ba3?sk=a6efaf2b6a15adefcf82403ff62ef8da",
      "date": 1769056742,
      "author": "/u/jpcaparas",
      "guid": 37954,
      "unread": true,
      "content": "",
      "contentLength": 0,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": "https://www.reddit.com/r/programming/comments/1qjl0r5/satya_nadella_at_davos_a_masterclass_in_saying/"
    },
    {
      "title": "Job Applicants Sue A.I. Recruitment Tool Company. A recently filed lawsuit claims the ratings assigned by A.I. screening software are similar to those of a credit agency and should be subject to the same laws.",
      "url": "https://www.nytimes.com/2026/01/21/business/ai-hiring-tools-lawsuit-eightfold-fcra.html?unlocked_article_code=1.GFA.9XQK.n_nH_2Z3omQR",
      "date": 1769053978,
      "author": "/u/esporx",
      "guid": 37945,
      "unread": true,
      "content": "",
      "contentLength": 0,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": "https://www.reddit.com/r/artificial/comments/1qjk1us/job_applicants_sue_ai_recruitment_tool_company_a/"
    },
    {
      "title": "MLFS 12.4(musl LFS)",
      "url": "https://www.reddit.com/r/linux/comments/1qjiei6/mlfs_124musl_lfs/",
      "date": 1769049473,
      "author": "/u/Intelligent_Comb_338",
      "guid": 37938,
      "unread": true,
      "content": "",
      "contentLength": 0,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Redhat Openshift vs. Suse Rancher Enterprise Support",
      "url": "https://www.reddit.com/r/kubernetes/comments/1qjhowq/redhat_openshift_vs_suse_rancher_enterprise/",
      "date": 1769047599,
      "author": "/u/Open-Ask-1918",
      "guid": 37962,
      "unread": true,
      "content": "<p>Looking for real world feedback from people who have had to utilize the enterprise support offerings from Redhat and Suse for OpenShift and Ranchers on premise solutions.</p><p>Who do you think provides better support?</p><p>I’m looking to create multiple downstream clusters integrated VMWare and want centralized management, monitoring, and deployments. I’m thinking Rancher is better suited for this purpose but value the feedback of others more experienced and haven’t had a chance to poke around at ACM from Redhat.</p><p>Also curious about which product you think is better for this job?</p>",
      "contentLength": 578,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Human Intelligence, AI, and the Problem I Think We're Missing",
      "url": "https://www.reddit.com/r/artificial/comments/1qjfapw/human_intelligence_ai_and_the_problem_i_think/",
      "date": 1769041308,
      "author": "/u/tony_24601",
      "guid": 37943,
      "unread": true,
      "content": "<p>I can vividly remember teaching my AP English class in 1999 when I first heard of “Turnitin.com”; my first thought was “how am I going to scan all of these pages into that thing?” Back then I graded papers on a first pass with my trusty No. 2 Dixon Ticonderoga pencil. Now what was I going to do?</p><p>For years I used my pencil as a key aid in the writing process with my students. It was collaborative because we worked together – I would suggest ideas an reframe sentences and thoughts to model writing in line with whatever rubric my assignment called for. Often times students adopted my suggestions whole-cloth, other times we would workshop different stylistic choices. My students and I shared in the rhetorical process. If they chose to use my margin note “try something like this,” are they not able to claim ownership because the original words were mine and not theirs?</p><p>I was the human intelligence that helped guide my students. They took my advice and incorporated it often. Other times they vehemently opposed my suggestions. I was their personal ChatGPT and I enjoyed that work immensely. But it was often brief and temporal, because I only had so much time to visit individually with 75 students. Can we really now castigate a tool that students can have beside them during every moment of their learning journey?</p><p>The ethical dilemma is this: students could accept, reject, argue with, or ignore me. Today, institutions now assume AI outputs are automatically suspect while often students see them as automatically authoritative. Agency is the key issue. When I suggested phrasing, students exercised their agency to decide whether to adopt or reject my suggestions. My authority was negotiable and if they accepted my suggestions, even verbatim, authorship was never in question.</p><p>Students are struggling today with teachers making them think AI is a “forbidden oracle,” whereas teachers are also short-sighted in thinking Turnitin is an infallible detector. The problem is in both cases human judgment is being “outsourced.” In 1999, I trusted my students negotiate my (human) guidance; now we pretend that same negotiation between students and AI itself is the problem. What mattered was not that I was always right; but that my authority was provisional.</p><p>Fast forward almost 30 years and now we not only have a tool for students to generate a decent five-paragraph essay, but a second tool that claims it can detect the use of the first. And that tool is the same one I struggled to understand in 1999: Turnitin. Although this time Turnitin is losing the battle against this newer tool, and students all over academia are suffering from that loss.</p><p>Academia now is forced to embrace a structure that rewards certainty over caution. Boom: you get the AI-cheating accusation era. We’re living in a time where a student can be treated like they robbed a bank because a dashboard lit up yellow. Is this how math teachers felt about calculators when they first entered the scene? Can you today imagine any high-level mathematics course that didn’t somehow incorporate this tool? Is ChatGPT the “writing calculator” that in decades will sit beside every student in an English class along with that No. 2 Dixon Ticonderoga? Or will pencils continue to suffer a slow extinction?</p><p>I’m not writing this because I think academic dishonesty is cute. Students absolutely can use AI to outsource thinking, and pretending otherwise is naïve. I’m writing this because the process of accusing students is an ethical problem now. It’s not just “Are people cheating?” It’s “What evidence counts, who bears the burden, and how much harm are we willing to cause to catch some portion of cases?” When a school leans on AI detectors as objective arbiters, the ethics get ugly fast: false positives, biased outcomes, coerced confessions, and a general atmosphere of suspicion that corrodes learning.</p><p>I believe it is ethically wrong to treat AI-detection scores as dispositive evidence of misconduct; accusations should require due process and corroborating evidence. current detectors are error-prone and easy to game, and the harms of false accusations are severe. If institutions want integrity, they should design integrity—through assessment design, and clear AI-use policies, not outsource judgment to probabilistic software and call it “accountability.” MIT’s teaching-and-learning guidance says this bluntly: AI detection has high error rates and can lead to false accusations; educators should focus on policy clarity and assessment design instead of policing with detectors. (MIT Sloan Teaching &amp; Learning Technologies).</p><p>MA in Composition--AI Integrated Writing </p>",
      "contentLength": 4706,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "I have released dodo pdf reader v0.6.0",
      "url": "https://github.com/dheerajshenoy/dodo",
      "date": 1769039165,
      "author": "/u/dheerajshenoy22",
      "guid": 37937,
      "unread": true,
      "content": "<p>Hello everyone, wanted to share my pdf reader dodo that I have been working for a while. it's based on MuPDF and Qt6. I started developing it because I wanted some niche features that I could not find in others, and also wanted it to be minimal and not reduce screen real-estate.</p><p>Its still in alpha, I'm open to suggestions, feature requests etc.</p>",
      "contentLength": 345,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": "https://www.reddit.com/r/linux/comments/1qjefp8/i_have_released_dodo_pdf_reader_v060/"
    },
    {
      "title": "Problemo: Yet another error handling library for Rust",
      "url": "https://www.reddit.com/r/rust/comments/1qjcus5/problemo_yet_another_error_handling_library_for/",
      "date": 1769035422,
      "author": "/u/emblemparade",
      "guid": 38003,
      "unread": true,
      "content": "<p>The biggest problem with Rust is that there are not enough error handling libraries... ha!</p><p>But, seriously, after trying all the popular ones and some of the niche ones in large, complex projects I found myself unsatisfied (and tired). However, the process did help me clarify what my specific needs are and identify common patterns and pain points. So I rolled my own library, and at this point I think it's Good Enough™ to share with those who are interested:</p><p>The main documentation page is quite long, but the point is to explain the goals and solutions as clearly as possible. Towards the end there is a FAQ that will hopefully answer your most burning questions. Also included are examples that showcase some basic and advanced usage.</p><p>The main differentiator is that Problemo intends not to replace std  but to make working with it easier. It takes a, shall we say, compositional approach to constructing your errors. It also features a rather innovative way to accumulate errors (which you don't have to use).</p><p>Problemo is deliberately straightforward in its implementation and it should be very easy to understand the code.</p><p>I hope you would find it interesting even if you decide not to use it. I'm here to answer questions (check the FAQ first, maybe?), hoping you will be kind and constructive.</p>",
      "contentLength": 1298,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "\"proposal: spec: type inferred composite literals\" has been added to the active column of the proposals project",
      "url": "https://www.reddit.com/r/golang/comments/1qjbwth/proposal_spec_type_inferred_composite_literals/",
      "date": 1769033236,
      "author": "/u/theclapp",
      "guid": 37932,
      "unread": true,
      "content": "<p>Excerpt from the proposal:</p><blockquote><p>Composite literals construct values for structs, arrays, slices, and maps. They consist of a type followed by a brace-bound list of elements. e.g.,</p></blockquote><pre><code>x := []string{\"a\", \"b\", \"c\"} </code></pre><blockquote><p>I propose adding untyped composite literals, which omit the type. Untyped composite literals are assignable to any composite type. They do not have a default type, and it is an error to use one as the right-hand-side of an assignment where the left-hand-side does not have an explicit type specified.</p></blockquote><pre><code>var x []string = {\"a\", \"b\", \"c\"} var m map[string]int = {\"a\": 1} type T struct { V int } var s []*T = {{0}, {1}, {2}} a := {1, 2, 3} // error: left-hand-type has no type specified </code></pre><blockquote><p>Go already allows the elision of the type of a composite literal under certain circumstances. This proposal extends that permission to all occasions when the literal type can be derived.</p></blockquote>",
      "contentLength": 868,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Sysinfo next release needs some help",
      "url": "https://www.reddit.com/r/rust/comments/1qjbpbx/sysinfo_next_release_needs_some_help/",
      "date": 1769032782,
      "author": "/u/imperioland",
      "guid": 37955,
      "unread": true,
      "content": "<p>As a reminder, the <a href=\"https://crates.io/crates/sysinfo\">sysinfo</a> crate gathers System's information such as processes, memory usage, etc.</p><p>Next <a href=\"https://crates.io/crates/sysinfo\">sysinfo</a> release is kinda stuck at the moment as I'm trying to get the missing parts for the NetBSD support. Currently I'm missing:</p><p>If anyone knows how to get the missing information, it'd be awesome!</p><p>Otherwise, well, I'll just release an incomplete support.</p>",
      "contentLength": 359,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Why json/v2 remains experimental in 1.26?",
      "url": "https://www.reddit.com/r/golang/comments/1qjb1n7/why_jsonv2_remains_experimental_in_126/",
      "date": 1769031308,
      "author": "/u/alpako70",
      "guid": 37934,
      "unread": true,
      "content": "<div><p>This is unpleasant surprise. I assume it is still not ready for production. But would appreciate to learn what concerns lead authors to postpone it to later.</p></div>   submitted by   <a href=\"https://www.reddit.com/user/alpako70\"> /u/alpako70 </a>",
      "contentLength": 188,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Results from the 2025 Go Developer Survey",
      "url": "https://go.dev/blog/survey2025",
      "date": 1769030943,
      "author": "/u/Bomgar85",
      "guid": 37936,
      "unread": true,
      "content": "<p>Hello! In this article we’ll discuss the results of the 2025 Go Developer\nSurvey, conducted during September 2025.</p><p>Thank you to the 5,379 Go developers who responded to our survey invitation\nthis year. Your feedback helps both the Go team at Google and the wider Go\ncommunity understand the current state of the Go ecosystem and prioritize\nprojects for the year ahead.</p><p>Our three biggest findings are:</p><ul><li>Broadly speaking, Go developers asked for help with identifying and applying\nbest practices, making the most of the standard library, and expanding the\nlanguage and built-in tooling with more modern capabilities.</li><li>Most Go developers are now using AI-powered development tools when seeking\ninformation (e.g., learning how to use a module) or toiling (e.g., writing\nrepetitive blocks of similar code), but their satisfaction with these tools\nis middling due, in part, to quality concerns.</li><li>A surprisingly high proportion of respondents said they frequently need to\nreview documentation for core  subcommands, including , , and , suggesting meaningful room for improvement with the \ncommand’s help system.</li></ul><p>Read on for the details about these findings, and much more.</p><p>Most survey respondents self-identified as professional developers (87%) who\nuse Go for their primary job (82%). A large majority also uses Go for personal\nor open-source projects (72%). Most respondents were between 25 – 45\nyears old (68%) with at least six years of professional development experience\n(75%). Going deeper, 81% of respondents told us they had more professional\ndevelopment experience than Go-specific experience, strong evidence that Go is\nusually not the first language developers work with. In fact, one of the\nthemes that repeatedly surfaced during this year’s survey analysis seems to\nstem from this fact: when the way to do a task in Go is substantially\ndifferent from a more familiar language, it creates friction for developers to\nfirst learn the new (to them) idiomatic Go pattern, and then to consistently\nrecall these differences as they continue to work with multiple languages.\nWe’ll return to this theme later.</p><p>The single most common industry respondents work in was “Technology” (46%),\nbut a majority of respondents work outside of the tech industry (54%). We saw\nrepresentation of all sizes of organizations, with a bare majority working\nsomewhere with 2 – 500 employees (51%), 9% working alone, and 30%\nworking at enterprises of over 1,000 employees. As in prior years, a majority\nof responses come from North America and Europe.</p><p>This year we observed a decrease in the proportion of respondents who said\nthey were fairly new to Go, having worked with it for less than one year\n(13%, vs. 21% in 2024). We suspect this is related to <a href=\"https://digitaleconomy.stanford.edu/wp-content/uploads/2025/08/Canaries_BrynjolfssonChandarChen.pdf\">industry-wide\ndeclines in entry-level software engineering roles</a>; we commonly hear from\npeople that they learned Go for a specific job, so a downturn in hiring would\nbe expected to reduce the number of developers learning Go in that year. This\nhypothesis is further supported by our finding that over 80% of respondents\nlearned Go  beginning their professional career.</p><p>Other than the above, we found no significant changes in other demographics\nsince our 2024 survey.</p><h2>How do people feel about Go?</h2><p>The vast majority of respondents (91%) said they felt satisfied while working\nwith Go. Almost ⅔ were “very satisfied”, the highest rating. Both of these\nmetrics are incredibly positive, and have been stable since we began asking\nthis question in 2019. The stability over time is really what we monitor from\nthis metric — we view it as a lagging indicator, meaning by the time\nthis satisfaction metric shows a meaningful change, we would expect to already\nhave seen earlier signals from issue reports, mailing lists, or other\ncommunity feedback.</p><p>Why were respondents so positive about Go? Looking at open-text responses to\nseveral different survey questions suggests that it’s the gestalt, rather than\nany one thing. These folks are telling us that they find tremendous value in\nGo as a holistic platform. That doesn’t mean it supports all programming\ndomains equally well (it surely does not), but that developers’ value the\ndomains it  nicely support via stdlib and built-in tooling.</p><p>Below are some representative quotations from respondents. To provide context\nfor each quote, we also identify the satisfaction level, years of experience\nwith Go, and industry of the respondent.</p><blockquote><p>“Go is by far my favorite language; other languages feel far too complex and\nunhelpful. The fact that Go is comparatively small, simple, with fewer bells\nand whistles plays a massive role in making it such a good long-lasting\nfoundation for building programs with it. I love that it scales well to\nbeing used by a single programmer and in large teams.” </p></blockquote><blockquote><p>“The entire reason I use Go is the great tooling and standard library.  I’m\nvery thankful to the team for focusing on great HTTP, crypto, math, sync,\nand other tools that make developing service-oriented applications easy and\nreliable.” </p></blockquote><blockquote><p>“[The] Go ecosystem is the reason why I really like the programming\nlanguage. There are a lot of npm issues lately but not with Go.” </p></blockquote><p>This year we also asked about the other languages that people use. Survey\nrespondents said that besides Go, they enjoy working with Python, Rust, and\nTypeScript, among a long tail of other languages. Some shared characteristics\nof these languages align with common points of friction reported by Go\ndevelopers, including  areas like error handling, enums, and object-oriented\ndesign patterns. For example, when we sum the proportion of respondents who\nsaid their next-favorite language included one of the following factors, we\nfound that majorities of respondents enjoy using languages with inheritance,\ntype-safe enums, and exceptions, with only a bare majority of these languages\nincluding a static type system by default.</p><table><thead><tr><th>Proportion of respondents</th></tr></thead><tbody></tbody></table><p>We think this is important because it reveals the larger environment in which\ndevelopers operate — it suggests that people need to use different\ndesign patterns for fairly mundane tasks, depending on the language of the\ncodebase they’re currently working on. This leads to additional cognitive load\nand confusion, not only among developers new to Go (who must learn idiomatic\nGo design patterns), but also among the many developers who work in multiple\ncodebases or projects. One way to alleviate this additional load is\ncontext-specific guidance, such as a tutorial on “Error handling in Go for\nJava developers”. There may even be opportunities to build some of this\nguidance into code analyzers, making it easier to surface directly in an IDE.</p><p>This year we asked the Go community to share their sentiment towards the Go\nproject itself. These results were quite different from the 91% satisfaction\nrate we discussed above, and point to areas the Go Team plans to invest our\nenergy during 2026. In particular, we want to encourage more contributors to\nget involved, and ensure the Go Team accurately understands the challenges Go\ndevelopers currently face. We hope this focus, in turn, will help to increase\ndeveloper trust in both the Go project and the Go Team leadership. As one\nrespondent explained the problem:</p><blockquote><p>“Now that the founding first generation of Go Team members [are] not\ninvolved much anymore in the decision making, I am a bit worried about the\nfuture of Go in terms of quality of maintenance, and its balanced decisions\nso far wrt to changes in the language and std lib. More presence in form of\ntalks [by] the new core team members about the current state and future\nplans might be helpful to strengthen trust.” </p></blockquote><h2>What are people building with Go?</h2><p>We revised this list of “what types of things do you build with Go?” from 2024\nwith the intent of more usefully teasing apart what people are building with\nGo, and avoid confusion around evolving terms like “agents”. Respondent’s top\nuse cases remain CLIs and API services, with no meaningful change in either\nsince 2024. In fact, a majority of respondents (55%) said they build \nCLIs and API services with Go. Over ⅓ of respondents specifically build cloud\ninfrastructure tooling (a new category), and 11% work with ML models, tools,\nor agents (an expanded category). Unfortunately embedded use cases were left\noff of the revised list, but we’ll fix this for next year’s survey.</p><p>Most respondents said they are not currently building AI-powered features into\nthe Go software they work on (78%), with ⅔ reporting that their software does\nnot use AI functionality at all (66%). This appears to be a decrease in\nproduction-related AI usage year-over-year; in 2024, 59% of respondents were\nnot involved in AI feature work, while 39% indicated some level of\ninvolvement. That marks a shift of 14 points away from building AI-powered\nsystems among survey respondents, and may reflect some natural pullback from\nthe early hype around AI-powered applications: it’s plausible that lots of\nfolks tried to see what they could do with this technology during its initial\nrollout, with some proportion deciding against further exploration (at least\nat this time).</p><p>Among respondents who are building AI- or LLM-powered functionality, the most\ncommon use case was to create summaries of existing content (45%). Overall,\nhowever, there was little difference between most uses, with between 28%\n– 33% of respondents adding AI functionality to support classification,\ngeneration, solution identification, chatbots, and software development.</p><h2>What are the biggest challenges facing Go developers?</h2><p>One of the most helpful types of feedback we receive from developers are\ndetails about the challenges people run into while working with Go. The Go\nTeam considers this information holistically and over long time horizons,\nbecause there is often tension between improving Go’s rougher edges and\nkeeping the language and tooling consistent for developers. Beyond technical\nfactors, every change also incurs some cost in terms of developer attention\nand cognitive disruption. Minimizing disruption may sound a bit dull or\nboring, but we view this as an important strength of Go. As Russ Cox wrote in\n2023, <a href=\"https://go.dev/blog/compat\">“Boring is good… Boring means being able to focus on your work, not\non what’s different about Go.”</a>.</p><p>In that spirit, this year’s top challenges are not radically different from\nlast year’s. The top three frustrations respondents reported were “Ensuring\nour Go code follows best practices / Go idioms” (33% of respondents), “A\nfeature I value from another language isn’t part of Go” (28%), and “Finding\ntrustworthy Go modules and packages” (26%). We examined open-text responses to\nbetter understand what people meant. Let’s take a minute to dig into each.</p><p>Respondents who were most frustrated by writing idiomatic Go were often\nlooking for more official guidance, as well as tooling support to help enforce\nthis guidance in their codebase. As in prior surveys, questions about how to\nstructure Go projects were also a common theme. For example:</p><blockquote><p>“The simplicity of go helps to read and understand code from other\ndevelopers, but there are still some aspects that can differ quite a lot\nbetween programmers. Especially if developers come from other languages,\ne.g. Java.” </p></blockquote><blockquote><p>“More opinionated way to write go code. Like how to structure a Go project\nfor services/cli tool.” </p></blockquote><blockquote><p>“It’s hard to figure out what are good idioms. Especially since the core\nteam doesn’t keep Effective Go up-to-date.” </p></blockquote><p>The second major category of frustrations were language features that\ndevelopers enjoyed working with in other ecosystems. These open-text comments\nlargely focused on error handling and reporting patterns, enums and sum types,\nnil pointer safety, and general expressivity / verbosity:</p><blockquote><p>“Still not sure what is the best way to do error handling.” </p></blockquote><blockquote><p>“Rust’s enums are great, and lead to writing great type safe code.” </p></blockquote><blockquote><p>“There is nothing (in the compiler) that stops me from using a maybe nil\npointer, or using a value without checking the err first. That should be\n[baked into] the type system.” </p></blockquote><blockquote><p>“I like [Go] but I didn’t expect it to have nil pointer exceptions :)” </p></blockquote><blockquote><p>“I often find it hard to build abstractions and to provide clear intention\nto the future readers of my code.” </p></blockquote><p>The third major frustration was finding trustworthy Go modules. Respondents\noften described two aspects to this problem. One is that they considered many\n3rd-party modules to be of marginal quality, making it hard for really good\nmodules to stand out. The second is identifying which modules are commonly\nused and under which types of conditions (including recent trends over time).\nThese are both problems that could be addressed by showing what we’ll vaguely\ncall “quality signals” on pkg.go.dev. Respondents provided helpful\nexplanations of the signals they use to identify trustworthy modules,\nincluding project activity, code quality, recent adoption trends, or the\nspecific organizations that support or rely upon the module.</p><blockquote><p>“Being able to filter by criteria like stable version, number of users and\nlast update age at pkg.go.dev could make things a bit easier.” </p></blockquote><blockquote><p>“Many pacakges are just clones/forks or one-off pojects with no\nhistory/maintenance. [sic]” </p></blockquote><blockquote><p>“Maybe flagging trustworthy packages based on experience, maturity and\ncommunity feedback?” </p></blockquote><p>We agree that these are all areas where the developer experience with Go could\nbe improved. The challenge, as discussed earlier, is doing so in such a way\nthat doesn’t lead to breaking changes, increased confusion among Go\ndevelopers, or otherwise gets in the way of people trying to get their work\ndone with Go. Feedback from this survey is a major source of information we\nuse when discussing proposals, but if you’d like to get involved more directly\nor follow along with other contributors, visit the <a href=\"https://github.com/golang/go/issues?q=state%3Aopen%20label%3AProposal\" rel=\"noreferrer\" target=\"_blank\">Go proposals on\nGitHub</a>;\nplease be sure to <a href=\"https://github.com/golang/proposal\" rel=\"noreferrer\" target=\"_blank\">follow this process</a> if\nyou’d like to add a new proposal.</p><p>In addition to these (potentially) ecosystem-wide challenges, this year we\nalso asked specifically about working with the  command. We’ve informally\nheard from developers that this tool’s help system can be confusing to\nnavigate, but we haven’t had a great sense of how frequently people find\nthemselves reviewing this documentation.</p><p>Respondents told us that except for , between 15% – 25% of them\nfelt they “often needed to review documentation” with working with these\ntools. This was surprising, especially for commonly-used subcommands like\n and . Common reasons included remembering specific flags,\nunderstanding what different options do, and navigating the help system\nitself. Participants also confirmed that infrequent use was one reason for\nfrustration, but navigating and parsing command help appears to be the\nunderlying cause. In other words, we all expect to need to review\ndocumentation sometimes, but we don’t expect to need help navigating the\ndocumentation system itself. As on respondent described their journey:</p><blockquote><p>“Accessing the help is painful. go test –help # didn’t work, but tell[s] me\nto type  instead… go help test # oh, actually, the info I’m\nlooking for is in  go help testflag # visually parsing through\ntext that looks all the same without much formatting… I just lack time to\ndig into this rabbit hole.” </p></blockquote><h2>What does their development environment look like?</h2><h3>Operating systems and architectures</h3><p>Generally, respondents told us their development platforms are UNIX-like. Most\nrespondents develop on macOS (60%) or Linux (58%) and deploy to Linux-based\nsystems, including containers (96%). The largest year-over-year change was\namong “embedded devices / IoT” deployments, which increased from 2% -&gt; 8% of\nrespondents; this was the only meaningful change in deployment platforms since\n2024.</p><p>The vast majority of respondents develop on x86-64 or ARM64 architectures,\nwith a sizable group (25%) still potentially working on 32-bit x86 systems.\nHowever, we believe the wording of this question was confusing to respondents;\nnext year we’ll clarify the 32-bit vs. 64-bit distinction for each\narchitecture.</p><p>Several new code editors have become available in the past two years, and we\nexpanded our survey question to include the most popular ones. While we saw\nsome evidence of early adoption, most respondents continued to favor <a href=\"https://code.visualstudio.com/\" rel=\"noreferrer\" target=\"_blank\">VS\nCode</a> (37%) or\n<a href=\"https://www.jetbrains.com/go/\" rel=\"noreferrer\" target=\"_blank\">GoLand</a> (28%). Of the newer editors, Zed and\nCursor were the highest ranked, each becoming the preferred editor of 4% of\nrespondents. To put those numbers in context, we looked back at when VS Code\nand GoLand were first introduced. VS Code (released in 2015) was favored by\n16% of respondents one year after its release. IntelliJ has had a\ncommunity-led Go plugin longer than we’ve been surveying Go developers (💙),\nbut if we look at when JetBrains began officially supporting Go in IntelliJ\n(2016), within one year IntelliJ was preferred by 20% of respondents.</p><p>Note: This analysis of code editors does not include respondents who were\nreferred to the survey directly from VS Code or GoLand.</p><p>The most common deployment environments for Go continue to be Amazon Web\nServices (AWS) at 46% of respondents, company-owned servers (44%), and Google\nCloud Platform (GCP) at 26%. These numbers show minor shifts since 2024, but\nnothing statistically significant. We found that the “Other” category\nincreased to 11% this year, and this was primarily driven by Hetzner (20% of\nOther responses); we plan to include Hetzner as a response choice in next\nyear’s survey.</p><p>We also asked respondents about their development experience of working with\ndifferent cloud providers. The most common responses, however, showed that\nrespondents weren’t really sure (46%) or don’t directly interact with public\ncloud providers (21%). The biggest driver behind these responses was a theme\nwe’ve heard often before: with containers, it’s possible to abstract many\ndetails of the cloud environment away from the developer, so that they don’t\nmeaningfully interact with most provider-specific technologies. This result\nsuggests that even developers whose work is  to clouds may have\nlimited experience with the larger suite of tools and technology associated\nwith each cloud provider. For example:</p><blockquote><p>“Kinda abstract to the platform, Go is very easy to put in a container and\nso pretty easy to deploy anywhere: one of its big strength[s].” </p></blockquote><blockquote><p>“The cloud provider really doesn’t make much difference to me. I write code\nand deploy it to containers, so whether that’s AWS or GCP I don’t really\ncare.” </p></blockquote><p>We suspect this level of abstraction is dependant on the use case and\nrequirements of the service that’s being deployed — it may not always\nmake sense or be possible to keep it highly abstracted. In the future, we plan\nto further investigate how Go developers tend to interact with the platforms\nwhere their software is ultimately deployed.</p><p>Finally, we can’t discuss development environments in 2025 without also\nmentioning AI-powered software development tools. Our survey suggests\nbifurcated adoption — while a majority of respondents (53%) said they\nuse such tools daily, there is also a large group (29%) who do not use these\nat all, or only used them a few times during the past month. We expected this\nto negatively correlate with age or development experience, but were unable to\nfind strong evidence supporting this theory except for  new developers:\nrespondents with less than one year of professional development experience\n(not specific to Go) did report more AI use than every other cohort, but this\ngroup only represented 2% of survey respondents.</p><p>At this time, agentic use of AI-powered tools appears nascent among Go\ndevelopers, with only 17% of respondents saying this is their primary way of\nusing such tools, though a larger group (40%) are occasionally trying agentic\nmodes of operation.</p><p>The most commonly used AI assistants remain ChatGPT, GitHub Copilot, and\nClaude. Most of these agents show lower usage numbers <a href=\"https://go.dev/blog/survey2024-h2-results#ai-assistance\">compared with our 2024\nsurvey</a> (Claude and Cursor are\nnotable exceptions), but due to a methodology change, this is not an\napples-to-apples comparison. It is, however, plausible that developers are\n“shopping around” less than they were when these tools were first released,\nresulting in more people using a single assistant for most of their work.</p><p>We also asked about overall satisfaction with AI-powered development tools. A\nmajority (55%) reported being satisfied, but this was heavily weighted towards\nthe “Somewhat satisfied” category (42%) vs. the “Very satisfied” group (13%).\nRecall that Go itself consistently shows a 90%+ satisfaction rate each year;\nthis year, 62% of respondents said they are “Very satisfied” with Go. We add\nthis context to show that while AI-powered tooling is starting to see adoption\nand finding some successful use cases, developer sentiment  towards them\nremains much softer than towards more established tooling (among Go\ndevelopers, at least).</p><p>What is driving this lower rate of satisfaction? In a word: quality. We asked\nrespondents to tell us something good they’ve accomplished with these tools,\nas well as something that didn’t work out well. A majority said that creating\nnon-functional code was their primary problem with AI developer tools (53%),\nwith 30% lamenting that even working code was of poor quality. The most\nfrequently cited benefits, conversely, were generating unit tests, writing\nboilerplate code, enhanced autocompletion, refactoring, and documentation\ngeneration. These appear to be cases where code quality is perceived as less\ncritical, tipping the balance in favor of letting AI take the first pass at a\ntask. That said, respondents also told us the AI-generated code in these\nsuccessful cases still required careful review (and often, corrections), as it\ncan be buggy, insecure, or lack context.</p><blockquote><p>“I’m never satisfied with code quality or consistency, it never follows the\npractices I want to.” </p></blockquote><blockquote><p>“All AI tools tend to hallucinate quickly when working with medium-to-large\ncodebases (10k+ lines of code). They can explain code effectively but\nstruggle to generate new, complex features” </p></blockquote><blockquote><p>“Despite numerous efforts to make it write code in an established codebase,\nit would take too much effort to steer it to follow the practices in the\nproject, and it would add subtle behaviour paths - i.e. if it would miss\nsome method it would try to find its way around it or rely on some side\neffect. Sometimes those things are hard to recognize during code review. I\nalso found it mentally taxing to review ai generated code and that overhead\nkills the productivity potential in writing code.” </p></blockquote><p>When we asked developers what they used these tools for, a pattern emerged\nthat is consistent with these quality concerns. The tasks with most adoption\n(green in the chart below) and least resistance (red) deal with bridging\nknowledge gaps, improving local code, and avoiding toil. The frustrations that\ndevelopers talk about with code-generating tools were much less evident when\nthey’re seeking information, like how to use a specific API or configure test\ncoverage, and perhaps as a result, we see higher usage of AI in these areas.\nAnother spot that stood out was  code review and related suggestions\n— people were less interested in using AI to review other people’s code\nthan in reviewing their own. Surprisingly, “testing code” showed lower AI\nadoption than other toilsome tasks, though we don’t yet have strong\nunderstanding of why.</p><p>Of all the tasks we asked about, “Writing code” was the most bifurcated, with\n66% of respondents already or hoping to soon use AI for this, while ¼ of\nrespondents didn’t want AI involved at all. Open-ended responses suggest\ndevelopers primarily use this for toilsome, repetitive code, and continue to\nhave concerns about the quality of AI-generated code.</p><p>Once again, a tremendous thank-you to everyone who responded to this year’s Go\nDeveloper Survey!</p><p>We plan to share the raw survey dataset in Q1 2026, so the larger community\ncan also explore the data underlying these findings. This will only include\nresponses from people who opted in to share this data (82% of all\nrespondents), so there may be some differences from the numbers we reference\nin this post.</p><p>This survey was conducted between Sept 9 - Sept 30, 2025. Participants were\npublicly invited to respond via the Go Blog, invitations on social media\nchannels (including Bluesky, Mastodon, Reddit, and X), as well as randomized\nin-product invitations to people using VS Code and GoLand to write Go\nsoftware. We received a total of 7,070 responses. After data cleaning to\nremove bots and other very low quality responses, 5,379 were used for the\nremainder of our analysis. The median survey response time was between 12\n– 13 minutes.</p><p>Throughout this report we use charts of survey responses to provide supporting\nevidence for our findings. All of these charts use a similar format. The title\nis the exact question that survey respondents saw. Unless otherwise noted,\nquestions were multiple choice and participants could only select a single\nresponse choice; each chart’s subtitle will tell the reader if the question\nallowed multiple response choices or was an open-ended text box instead of a\nmultiple choice question. For charts of open-ended text responses, a Go team\nmember read and manually categorized all of the responses. Many open-ended\nquestions elicited a wide variety of responses; to keep the chart sizes\nreasonable, we condensed them to a maximum of the top 10-12 themes, with\nadditional themes all grouped under “Other”. The percentage labels shown in\ncharts are rounded to the nearest integer (e.g., 1.4% and 0.8% will both be\ndisplayed as 1%), but the length of each bar and row ordering are based on the\nunrounded values.</p><p>To help readers understand the weight of evidence underlying each finding, we\nincluded error bars showing the 95% <a href=\"https://en.wikipedia.org/wiki/Confidence_interval\" rel=\"noreferrer\" target=\"_blank\">confidence\ninterval</a> for responses;\nnarrower bars indicate increased confidence. Sometimes two or more responses\nhave overlapping error bars, which means the relative order of those responses\nis not statistically meaningful (i.e., the responses are effectively tied).\nThe lower right of each chart shows the number of people whose responses are\nincluded in the chart, in the form “n = [number of respondents]”.</p>",
      "contentLength": 26365,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": "https://www.reddit.com/r/golang/comments/1qjavpe/results_from_the_2025_go_developer_survey/"
    },
    {
      "title": "Is agentless container security effective for Kubernetes workloads at scale?",
      "url": "https://www.reddit.com/r/kubernetes/comments/1qja0wg/is_agentless_container_security_effective_for/",
      "date": 1769029054,
      "author": "/u/amylanky",
      "guid": 37959,
      "unread": true,
      "content": "<p>We're running hundreds of Kubernetes workloads across multiple clusters, and the idea of deploying agents into every container feels unsustainable. Performance overhead, image bloat, and operational complexity are all concerns.</p><p>Is agentless container security actually viable, or is it just marketing? anyone actually secured container workloads at scale without embedding agents everywhere?</p>",
      "contentLength": 390,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "What are the top 5 safe, high-paying jobs that AI is unlikely to replace over the next few decades?",
      "url": "https://www.reddit.com/r/artificial/comments/1qj91oh/what_are_the_top_5_safe_highpaying_jobs_that_ai/",
      "date": 1769026875,
      "author": "/u/Curious_Suchit",
      "guid": 37944,
      "unread": true,
      "content": "<p>As AI continues to automate routine and analytical tasks, many roles will evolve or disappear. This raises an important question about which careers can offer long-term security, meaningful work, and strong earning potential in an AI-driven world</p>",
      "contentLength": 246,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "The NexPhone is an upcoming phone that can boot desktop Linux along with Android (and Microslop Windows 11) - made for USB-C docking to monitors",
      "url": "https://nexphone.com/",
      "date": 1769025334,
      "author": "/u/HiGuysImNewToReddit",
      "guid": 37942,
      "unread": true,
      "content": "",
      "contentLength": 0,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": "https://www.reddit.com/r/linux/comments/1qj8cfo/the_nexphone_is_an_upcoming_phone_that_can_boot/"
    },
    {
      "title": "Backpressure Patterns in Go: From Channels to Queues to Load Shedding",
      "url": "https://medium.com/@Realblank/backpressure-patterns-in-go-from-channels-to-queues-to-load-shedding-0841c9fe5607",
      "date": 1769024325,
      "author": "/u/Real_Blank",
      "guid": 37933,
      "unread": true,
      "content": "",
      "contentLength": 0,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": "https://www.reddit.com/r/golang/comments/1qj7w1x/backpressure_patterns_in_go_from_channels_to/"
    },
    {
      "title": "Belgrade Go meetup - Thursday, Jan 29",
      "url": "https://www.meetup.com/golang-serbia/events/312819083/",
      "date": 1769023724,
      "author": "/u/GaussCarl",
      "guid": 37931,
      "unread": true,
      "content": "<p>Join us for the next Golang meetup on January 29th! We have two great talks:\nWe will explore how testing multiple variables can identify meaningful improvements in any project. As an example, we will see how it can inform game design decisions and identify most optimal game variation. At the end we will see how a testing framework can be implemented in Go.<p>\n🇬🇧 The presentation will be in English.</p><strong>Desktop Applications with Go and Fyne</strong>\nHow to build a desktop application using Fyne. Pros and cons of UI development in Go, beginner-friendly, with practical demos. If you're interested in building Desktop applications in Go, this meetup is for you!<p>\n🇷🇸 The presentation will be in Serbian.</p><p>\nLocation: Finbet Belgrade Office, Južni bulevar 10, Belgrade</p>\nPlease RSVP to help us with planning.\nPozivamo vas na naredni Golang meetup koji će se održati 29.01. Imamo dva sjajna predavanja:<strong>Multivarijantno testiranje</strong>\nIstražićemo kako testiranje više promenljivih može da pomogne u otkrivanju značajnih poboljšanja u bilo kom projektu. Kao primer, videćemo kako se ovaj pristup može koristiti za donošenje odluka u dizajnu igara i za identifikovanje najoptimalnije varijante igre. Na kraju ćemo videti kako se testing framework može implementirati u Go-u.<p>\n🇬🇧 Prezentacija će biti na engleskom jeziku.</p><strong>Desktop aplikacije sa Go i Fyne</strong>\nKako razviti desktop aplikaciju koristeći Fyne. Prednosti i mane UI developmenta u Go-u, beginner-friendly, sa praktičnim demo primerima. Ako vas zanima pravljenje Desktop aplikacija u Go-u, ovo je meetup koji ne smete propustiti!<p>\n🇷🇸 Prezentacija će biti na srpskom jeziku.</p><p>\nLokacija: Prostorije Finbet-a, Južni bulevar 10, Beograd</p>\nMolimo vas za RSVP kako bismo lakše isplanirali događaj.</p>",
      "contentLength": 1752,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": "https://www.reddit.com/r/golang/comments/1qj7m7f/belgrade_go_meetup_thursday_jan_29/"
    },
    {
      "title": "RISC-V Kubernetes cluster with Jenkins on 3x StarFive VisionFive 2 (Lite)",
      "url": "https://youtube.com/watch?v=641TnJyHt4g&amp;si=AqXuJ3-A5M7PkQjS",
      "date": 1769018031,
      "author": "/u/Opvolger",
      "guid": 37958,
      "unread": true,
      "content": "",
      "contentLength": 0,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": "https://www.reddit.com/r/kubernetes/comments/1qj4xul/riscv_kubernetes_cluster_with_jenkins_on_3x/"
    },
    {
      "title": "ArgoCD / Kargo + GitOps Help/Suggestions",
      "url": "https://www.reddit.com/r/kubernetes/comments/1qj4dyt/argocd_kargo_gitops_helpsuggestions/",
      "date": 1769016832,
      "author": "/u/pixel-pusher-coder",
      "guid": 37961,
      "unread": true,
      "content": "<p>I've been running an argocd setup that seems to work pretty well. The main issue I had with it was that testing a deployment on say staging involves pushing to git main in order to get argo to apply my changes. </p><p>I'm trying to avoid using labels. I know there's patterns that use that, but if the data is not in git to me that defeats the point. </p><p>So I looked and a few GitOps solutions and Kargo seemed to be the most interesting one. The basic flow seems to be pretty slick. </p><p>Watch for changes (Warehouse), creates a change-set (Freight) and Promote the change to the given Stage. </p><p>The main thing that seems to be missing is applying a diff for a given environment that has both a version change AND a config change. </p><p>So say I have a new helm chart with some breaking changes. I'd like to configure some values.yaml changes for say staging and update to version 2.x and promote those together to staging. If that works, It would be nice to apply the diff to prod, then staging, etc. </p><p>It feels like Kargo only supports artifacts without say git/config changes. How do people manage this? If I have to do a PR for each env that won't be reflected till they get merged, then you might as well just update the version in your PR. The value add of kargo seems pretty minor at that point.</p><p>Am I missing something? How to you take a change and promote it through various stages? Right now I'm just committing to main since everything is staging still but that doesn't seem like a proper pattern. </p>",
      "contentLength": 1481,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "[D] Do you feel like companies are scooping / abusing researchers for ideas during hiring for researcher roles?",
      "url": "https://www.reddit.com/r/MachineLearning/comments/1qj3t98/d_do_you_feel_like_companies_are_scooping_abusing/",
      "date": 1769015604,
      "author": "/u/quasiproductive",
      "guid": 37948,
      "unread": true,
      "content": "<p>After having gone through at least 3 rounds where I had to present research solutions for problems, I get the feeling that I'm doing free labour for these guys. They usually give you a week and given the current glut of candidates, it feels like this could easily be happening in the background. This includes Mid tech companies (not FAANG) and startups. Is there some truth to this suspicion?</p><p>For the most recent one, I purposefully chose not to dive into the advanced literature heavy stuff even though I did do the work. The scope of the task was pretty vague (\"design an ML system blah blah\") and as soon as I started my presentation, one of my interviewers immediately questioned me about whether I had read the literature and wasn't interested in older approaches to the same problem. The rest of the interview was spent getting grilled, as is usual. My motivation was to work bottom up and demonstrate strong fundamentals. Perhaps, I'm missing something here</p>",
      "contentLength": 964,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    }
  ],
  "tags": [
    "reddit"
  ]
}