{
  "id": "PyU9",
  "title": "Dev",
  "displayTitle": "Dev",
  "url": "",
  "feedLink": "",
  "isQuery": true,
  "isEmpty": false,
  "isHidden": false,
  "itemCount": 12,
  "items": [
    {
      "title": "Headlamp in 2025: Project Highlights",
      "url": "https://kubernetes.io/blog/2026/01/22/headlamp-in-2025-project-highlights/",
      "date": 1769047200,
      "author": "",
      "guid": 37766,
      "unread": true,
      "content": "<p><em>This announcement is a recap from a post originally <a href=\"https://headlamp.dev/blog/2025/11/13/headlamp-in-2025\">published</a> on the Headlamp blog.</em></p><p><a href=\"https://headlamp.dev/\">Headlamp</a> has come a long way in 2025. The project has continued to grow – reaching more teams across platforms, powering new workflows and integrations through plugins, and seeing increased collaboration from the broader community.</p><p>We wanted to take a moment to share a few updates and highlight how Headlamp has evolved over the past year.</p><h3>Joining Kubernetes SIG UI</h3><p>This year marked a big milestone for the project: Headlamp is now officially part of Kubernetes <a href=\"https://github.com/kubernetes/community/blob/master/sig-ui/README.md\">SIG UI</a>. This move brings roadmap and design discussions even closer to the core Kubernetes community and reinforces Headlamp’s role as a modern, extensible UI for the project.</p><h3>Linux Foundation mentorship</h3><p>This year, we were excited to work with several students through the Linux Foundation’s Mentorship program, and our mentees have already left a visible mark on Headlamp:</p><ul><li><a href=\"https://github.com/adwait-godbole\"></a> built the KEDA plugin, adding a UI in Headlamp to view and manage KEDA resources like ScaledObjects and ScaledJobs.</li><li><a href=\"https://github.com/DhairyaMajmudar\"></a> set up an OpenTelemetry-based observability stack for Headlamp, wiring up metrics, logs, and traces so the project is easier to monitor and debug.</li><li><a href=\"https://www.linkedin.com/in/aishwarya-ghatole-506745231/\"></a> led a UX audit of Headlamp plugins, identifying usability issues and proposing design improvements and personas for plugin users.</li><li><a href=\"https://github.com/SinghaAnirban005\"></a> developed the Karpenter plugin, giving Headlamp a focused view into Karpenter autoscaling resources and decisions.</li><li><a href=\"https://github.com/useradityaa\"></a> improved Gateway API support, so you can see networking relationships on the resource map, as well as improved support for many of the new Gateway API resources.</li><li><a href=\"https://github.com/upsaurav12\"></a> worked on backend caching for Kubernetes API calls, reducing load on the API server and improving performance in Headlamp.</li></ul><p>Managing multiple clusters is challenging: teams often switch between tools and lose context when trying to see what runs where. Headlamp solves this by giving you a single view to compare clusters side-by-side. This makes it easier to understand workloads across environments and reduces the time spent hunting for resources.</p><img src=\"https://kubernetes.io/blog/2026/01/22/headlamp-in-2025-project-highlights/multi-cluster-view.png\" alt=\"Multi-cluster view\"><em>View of multi-cluster workloads</em><p>Kubernetes apps often span multiple namespaces and resource types, which makes troubleshooting feel like piecing together a puzzle. We’ve added  to give you an application-centric view that groups related resources across multiple namespaces – and even clusters. This allows you to reduce sprawl, troubleshoot faster, and collaborate without digging through YAML or cluster-wide lists.</p><img src=\"https://kubernetes.io/blog/2026/01/22/headlamp-in-2025-project-highlights/projects-feature.png\" alt=\"Projects feature\"><em>View of the new Projects feature</em><ul><li>New “Projects” feature for grouping namespaces into app- or team-centric projects</li><li>Extensible Projects details view that plugins can customize with their own tabs and actions</li></ul><h3>Navigation and Activities</h3><p>Day-to-day ops in Kubernetes often means juggling logs, terminals, YAML, and dashboards across clusters. We redesigned Headlamp’s navigation to treat these as first-class “activities” you can keep open and come back to, instead of one-off views you lose as soon as you click away.</p><img src=\"https://kubernetes.io/blog/2026/01/22/headlamp-in-2025-project-highlights/new-task-bar.png\" alt=\"New task bar\"><ul><li>A new task bar/activities model lets you pin logs, exec sessions, and details as ongoing activities</li><li>An activity overview with a “Close all” action and cluster information</li><li>Multi-select and global filters in tables</li></ul><p>When something breaks in production, the first two questions are usually “where is it?” and “what is it connected to?” We’ve upgraded both search and the map view so you can get from a high-level symptom to the right set of objects much faster.</p><img src=\"https://kubernetes.io/blog/2026/01/22/headlamp-in-2025-project-highlights/advanced-search.png\" alt=\"Advanced search\"><em>View of the new Advanced Search feature</em><ul><li>An Advanced search view that supports rich, expression-based queries over Kubernetes objects</li><li>Improved global search that understands labels and multiple search items, and can even update your current namespace based on what you find</li><li>EndpointSlice support in the Network section</li><li>A richer map view that now includes Custom Resources and Gateway API objects</li></ul><p>We’ve put real work into making OIDC setup clearer and more resilient, especially for in-cluster deployments.</p><img src=\"https://kubernetes.io/blog/2026/01/22/headlamp-in-2025-project-highlights/user-info.png\" alt=\"User info\"><em>View of user information for OIDC clusters</em><ul><li>User information displayed in the top bar for OIDC-authenticated users</li><li>PKCE support for more secure authentication flows, as well as hardened token refresh handling</li><li>Documentation for using the access token using <code>-oidc-use-access-token=true</code></li><li>Improved support for public OIDC clients like AKS and EKS</li></ul><p>We’ve broadened how you deploy and source apps via Headlamp, specifically supporting vanilla Helm repos.</p><ul><li>A more capable Helm chart with optional backend TLS termination, PodDisruptionBudgets, custom pod labels, and more</li><li>Improved formatting and added missing access token arg in the Helm chart</li><li>New in-cluster Helm support with an  flag and a service proxy</li></ul><p>Finally, we’ve spent a lot of time on the things you notice every day but don’t always make headlines: startup time, list views, log viewers, accessibility, and small network UX details. A continuous accessibility self-audit has also helped us identify key issues and make Headlamp easier for everyone to use.</p><img src=\"https://kubernetes.io/blog/2026/01/22/headlamp-in-2025-project-highlights/learn-section.png\" alt=\"Learn section\"><em>View of the Learn section in docs</em><ul><li>Significant desktop improvements, with up to 60% faster app loads and much quicker dev-mode reloads for contributors</li><li>Numerous table and log viewer refinements: persistent sort order, consistent row actions, copy-name buttons, better tooltips, and more forgiving log inputs</li><li>Accessibility and localization improvements, including fixes for zoom-related layout issues, better color contrast, improved screen reader support, and expanded language coverage</li><li>More control over resources, with live pod CPU/memory metrics, richer pod details, and inline editing for secrets and CRD fields</li><li>A refreshed documentation and plugin onboarding experience, including a “Learn” section and plugin showcase</li><li>A more complete NetworkPolicy UI and network-related polish</li><li>Nightly builds available for early testing</li></ul><h2>Plugins and extensibility</h2><p>Discovering plugins is simpler now – no more hopping between Artifact Hub and assorted GitHub repos. Browse our dedicated <a href=\"https://headlamp.dev/plugins\">Plugins page</a> for a curated catalog of Headlamp-endorsed plugins, along with a showcase of featured plugins.</p><img src=\"https://kubernetes.io/blog/2026/01/22/headlamp-in-2025-project-highlights/plugins-page.png\" alt=\"Plugins page\"><em>View of the Plugins showcase</em><p>Managing Kubernetes often means memorizing commands and juggling tools. Headlamp’s new AI Assistant changes this by adding a natural-language interface built into the UI. Now, instead of typing  or digging through YAML you can ask, “Is my app healthy?” or “Show logs for this deployment,” and get answers in context, speeding up troubleshooting and smoothing onboarding for new users. Learn more about it <a href=\"https://headlamp.dev/blog/2025/08/07/introducing-the-headlamp-ai-assistant/\">here</a>.</p><p>Alongside the new AI Assistant, we’ve been growing Headlamp’s plugin ecosystem so you can bring more of your workflows into a single UI, with integrations like Minikube, Karpenter, and more.</p><p>Highlights from the latest plugin releases:</p><ul><li>Minikube plugin, providing a locally stored single node Minikube cluster</li><li>Karpenter plugin, with support for Azure Node Auto-Provisioning (NAP)</li><li>KEDA plugin, which you can learn more about <a href=\"https://headlamp.dev/blog/2025/07/25/enabling-event-driven-autoscaling-with-the-new-keda-plugin-for-headlamp/\">here</a></li></ul><p>Alongside new additions, we’ve also spent time refining plugins that many of you already use, focusing on smoother workflows and better integration with the core UI.</p><img src=\"https://kubernetes.io/blog/2026/01/22/headlamp-in-2025-project-highlights/backstage-plugin.png\" alt=\"Backstage plugin\"><em>View of the Backstage plugin</em><ul><li>: Updated for Flux v2.7, with support for newer CRDs, navigation fixes so it works smoothly on recent clusters</li><li>: Now supports Helm repos in addition to Artifact Hub, can run in-cluster via /serviceproxy, and shows both current and latest app versions</li><li>: Improved card layout and accessibility, plus dependency and Storybook test updates</li><li>: Dependency and build updates, more info <a href=\"https://headlamp.dev/blog/2025/11/05/strengthening-backstage-and-headlamp-integration/\">here</a></li></ul><p>We’ve focused on making it faster and clearer to build, test, and ship Headlamp plugins, backed by improved documentation and lighter tooling.</p><img src=\"https://kubernetes.io/blog/2026/01/22/headlamp-in-2025-project-highlights/plugin-development.png\" alt=\"Plugin development\"><em>View of the Plugin Development guide</em><ul><li>Improved type checking for Headlamp APIs, restored Storybook support for component testing, and reduced dependencies for faster installs and fewer updates</li><li>Documented plugin install locations, UI signifiers in Plugin Settings, and labels that differentiated shipped, UI-installed, and dev-mode plugins</li></ul><p>We've also been investing in keeping Headlamp secure – both by tightening how authentication works and by staying on top of upstream vulnerabilities and tooling.</p><ul><li>We've been keeping up with security updates, regularly updating dependencies and addressing upstream security issues.</li><li>We tightened the Helm chart's default security context and fixed a regression that broke the plugin manager.</li><li>We've improved OIDC security with PKCE support, helping unblock more secure and standards-compliant OIDC setups when deploying Headlamp in-cluster.</li></ul><p>Thank you to everyone who has contributed to Headlamp this year – whether through pull requests, plugins, or simply sharing how you're using the project. Seeing the different ways teams are adopting and extending the project is a big part of what keeps us moving forward. If your organization uses Headlamp, consider adding it to our <a href=\"https://github.com/kubernetes-sigs/headlamp/blob/main/ADOPTERS.md\">adopters list</a>.</p><p>If you haven't tried Headlamp recently, all these updates are available today. Check out the latest Headlamp release, explore the new views, plugins, and docs, and share your feedback with us on Slack or GitHub – your feedback helps shape where Headlamp goes next.</p>",
      "contentLength": 9105,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Announcing Rust 1.93.0",
      "url": "https://blog.rust-lang.org/2026/01/22/Rust-1.93.0/",
      "date": 1769040000,
      "author": "The Rust Release Team",
      "guid": 37856,
      "unread": true,
      "content": "<p>The Rust team is happy to announce a new version of Rust, 1.93.0. Rust is a programming language empowering everyone to build reliable and efficient software.</p><p>If you have a previous version of Rust installed via , you can get 1.93.0 with:</p><p>If you'd like to help us out by testing future releases, you might consider updating locally to use the beta channel () or the nightly channel (). Please <a href=\"https://github.com/rust-lang/rust/issues/new/choose\">report</a> any bugs you might come across!</p><h3><a href=\"https://blog.rust-lang.org/2026/01/22/Rust-1.93.0/#update-bundled-musl-to-1-2-5\" aria-hidden=\"true\"></a>\nUpdate bundled musl to 1.2.5</h3><p>The various  targets now all <a href=\"https://github.com/rust-lang/rust/pull/142682\">ship</a> with musl 1.2.5. This primarily affects static musl builds for , , and  which bundled musl 1.2.3. This update comes with <a href=\"https://musl.libc.org/releases.html\">several fixes and improvements</a>, and a breaking change that affects the Rust ecosystem.</p><p>For the Rust ecosystem, the primary motivation for this update is to receive major improvements to\nmusl's DNS resolver which shipped in 1.2.4 and received bug fixes in 1.2.5. When using \ntargets for static linking, this should make portable Linux binaries that do networking more\nreliable, particularly in the face of large DNS records and recursive nameservers.</p><h3><a href=\"https://blog.rust-lang.org/2026/01/22/Rust-1.93.0/#allow-the-global-allocator-to-use-thread-local-storage\" aria-hidden=\"true\"></a>\nAllow the global allocator to use thread-local storage</h3><p>Rust 1.93 adjusts the internals of the standard library to permit global allocators written in Rust\nto use std's <a href=\"https://doc.rust-lang.org/stable/std/macro.thread_local.html\"></a> and\n<a href=\"https://doc.rust-lang.org/stable/std/thread/fn.current.html\"></a> without\nre-entrancy concerns by using the system allocator instead.</p><h3><a href=\"https://blog.rust-lang.org/2026/01/22/Rust-1.93.0/#cfg-attributes-on-asm-lines\" aria-hidden=\"true\"></a> attributes on  lines</h3><p>Previously, if individual parts of a section of inline assembly needed to be 'd, the full \nblock would need to be repeated with and without that section. In 1.93,  can now be applied to\nindividual statements within the  block.</p><pre data-lang=\"rust\"><code data-lang=\"rust\"></code></pre><p>Many people came together to create Rust 1.93.0. We couldn't have done it without all of you. <a href=\"https://thanks.rust-lang.org/rust/1.93.0/\">Thanks!</a></p>",
      "contentLength": 1650,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Announcing the Checkpoint/Restore Working Group",
      "url": "https://kubernetes.io/blog/2026/01/21/introducing-checkpoint-restore-wg/",
      "date": 1769018400,
      "author": "",
      "guid": 37746,
      "unread": true,
      "content": "<p>The community around Kubernetes includes a number of Special Interest Groups (SIGs) and Working Groups (WGs) facilitating discussions on important topics between interested contributors. Today we would like to announce the new <a href=\"https://github.com/kubernetes/community/tree/master/wg-checkpoint-restore\">Kubernetes Checkpoint Restore WG</a> focusing on the integration of Checkpoint/Restore functionality into Kubernetes.</p><p>There are several high-level scenarios discussed in the working group:</p><ul><li>Optimizing resource utilization for interactive workloads, such as Jupyter notebooks and AI chatbots</li><li>Accelerating startup of applications with long initialization times, including Java applications and <a href=\"https://doi.org/10.1145/3731599.3767354\">LLM inference services</a></li><li>Using periodic checkpointing to enable fault-tolerance for long-running workloads, such as distributed model training</li><li>Providing <a href=\"https://doi.org/10.1007/978-3-032-10507-3_3\">interruption-aware scheduling</a> with transparent checkpoint/restore, allowing lower-priority Pods to be preempted while preserving the runtime state of applications</li><li>Facilitating Pod migration across nodes for load balancing and maintenance, without disrupting workloads.</li><li>Enabling forensic checkpointing to investigate and analyze security incidents such as cyberattacks, data breaches, and unauthorized access.</li></ul><p>Across these scenarios, the goal is to help facilitate discussions of ideas between the Kubernetes community and the growing Checkpoint/Restore in Userspace (CRIU) ecosystem. The CRIU community includes several projects that support these use cases, including:</p><ul><li><a href=\"https://github.com/checkpoint-restore/criu\">CRIU</a> - A tool for checkpointing and restoring running applications and containers</li><li><a href=\"https://github.com/checkpoint-restore/checkpointctl\">checkpointctl</a> - A tool for in-depth analysis of container checkpoints</li><li><a href=\"https://github.com/checkpoint-restore/criu-coordinator\">criu-coordinator</a> - A tool for coordinated checkpoint/restore of distributed applications with CRIU</li></ul><p>More information about the checkpoint/restore integration with Kubernetes is also available <a href=\"https://criu.org/Kubernetes\">here</a>.</p><p>If you are interested in contributing to Kubernetes or CRIU, there are several ways to participate:</p>",
      "contentLength": 1870,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Results from the 2025 Go Developer Survey",
      "url": "https://go.dev/blog/survey2025",
      "date": 1768953600,
      "author": "Todd Kulesza, on behalf of the Go team",
      "guid": 37674,
      "unread": true,
      "content": "<p>Hello! In this article we’ll discuss the results of the 2025 Go Developer\nSurvey, conducted during September 2025.</p><p>Thank you to the 5,379 Go developers who responded to our survey invitation\nthis year. Your feedback helps both the Go team at Google and the wider Go\ncommunity understand the current state of the Go ecosystem and prioritize\nprojects for the year ahead.</p><p>Our three biggest findings are:</p><ul><li>Broadly speaking, Go developers asked for help with identifying and applying\nbest practices, making the most of the standard library, and expanding the\nlanguage and built-in tooling with more modern capabilities.</li><li>Most Go developers are now using AI-powered development tools when seeking\ninformation (e.g., learning how to use a module) or toiling (e.g., writing\nrepetitive blocks of similar code), but their satisfaction with these tools\nis middling due, in part, to quality concerns.</li><li>A surprisingly high proportion of respondents said they frequently need to\nreview documentation for core  subcommands, including , , and , suggesting meaningful room for improvement with the \ncommand’s help system.</li></ul><p>Read on for the details about these findings, and much more.</p><p>Most survey respondents self-identified as professional developers (87%) who\nuse Go for their primary job (82%). A large majority also uses Go for personal\nor open-source projects (72%). Most respondents were between 25 – 45\nyears old (68%) with at least six years of professional development experience\n(75%). Going deeper, 81% of respondents told us they had more professional\ndevelopment experience than Go-specific experience, strong evidence that Go is\nusually not the first language developers work with. In fact, one of the\nthemes that repeatedly surfaced during this year’s survey analysis seems to\nstem from this fact: when the way to do a task in Go is substantially\ndifferent from a more familiar language, it creates friction for developers to\nfirst learn the new (to them) idiomatic Go pattern, and then to consistently\nrecall these differences as they continue to work with multiple languages.\nWe’ll return to this theme later.</p><p>The single most common industry respondents work in was “Technology” (46%),\nbut a majority of respondents work outside of the tech industry (54%). We saw\nrepresentation of all sizes of organizations, with a bare majority working\nsomewhere with 2 – 500 employees (51%), 9% working alone, and 30%\nworking at enterprises of over 1,000 employees. As in prior years, a majority\nof responses come from North America and Europe.</p><p>This year we observed a decrease in the proportion of respondents who said\nthey were fairly new to Go, having worked with it for less than one year\n(13%, vs. 21% in 2024). We suspect this is related to <a href=\"https://digitaleconomy.stanford.edu/wp-content/uploads/2025/08/Canaries_BrynjolfssonChandarChen.pdf\">industry-wide\ndeclines in entry-level software engineering roles</a>; we commonly hear from\npeople that they learned Go for a specific job, so a downturn in hiring would\nbe expected to reduce the number of developers learning Go in that year. This\nhypothesis is further supported by our finding that over 80% of respondents\nlearned Go  beginning their professional career.</p><p>Other than the above, we found no significant changes in other demographics\nsince our 2024 survey.</p><h2>How do people feel about Go?</h2><p>The vast majority of respondents (91%) said they felt satisfied while working\nwith Go. Almost ⅔ were “very satisfied”, the highest rating. Both of these\nmetrics are incredibly positive, and have been stable since we began asking\nthis question in 2019. The stability over time is really what we monitor from\nthis metric — we view it as a lagging indicator, meaning by the time\nthis satisfaction metric shows a meaningful change, we would expect to already\nhave seen earlier signals from issue reports, mailing lists, or other\ncommunity feedback.</p><p>Why were respondents so positive about Go? Looking at open-text responses to\nseveral different survey questions suggests that it’s the gestalt, rather than\nany one thing. These folks are telling us that they find tremendous value in\nGo as a holistic platform. That doesn’t mean it supports all programming\ndomains equally well (it surely does not), but that developers’ value the\ndomains it  nicely support via stdlib and built-in tooling.</p><p>Below are some representative quotations from respondents. To provide context\nfor each quote, we also identify the satisfaction level, years of experience\nwith Go, and industry of the respondent.</p><blockquote><p>“Go is by far my favorite language; other languages feel far too complex and\nunhelpful. The fact that Go is comparatively small, simple, with fewer bells\nand whistles plays a massive role in making it such a good long-lasting\nfoundation for building programs with it. I love that it scales well to\nbeing used by a single programmer and in large teams.” </p></blockquote><blockquote><p>“The entire reason I use Go is the great tooling and standard library.  I’m\nvery thankful to the team for focusing on great HTTP, crypto, math, sync,\nand other tools that make developing service-oriented applications easy and\nreliable.” </p></blockquote><blockquote><p>“[The] Go ecosystem is the reason why I really like the programming\nlanguage. There are a lot of npm issues lately but not with Go.” </p></blockquote><p>This year we also asked about the other languages that people use. Survey\nrespondents said that besides Go, they enjoy working with Python, Rust, and\nTypeScript, among a long tail of other languages. Some shared characteristics\nof these languages align with common points of friction reported by Go\ndevelopers, including  areas like error handling, enums, and object-oriented\ndesign patterns. For example, when we sum the proportion of respondents who\nsaid their next-favorite language included one of the following factors, we\nfound that majorities of respondents enjoy using languages with inheritance,\ntype-safe enums, and exceptions, with only a bare majority of these languages\nincluding a static type system by default.</p><table><thead><tr><th>Proportion of respondents</th></tr></thead><tbody></tbody></table><p>We think this is important because it reveals the larger environment in which\ndevelopers operate — it suggests that people need to use different\ndesign patterns for fairly mundane tasks, depending on the language of the\ncodebase they’re currently working on. This leads to additional cognitive load\nand confusion, not only among developers new to Go (who must learn idiomatic\nGo design patterns), but also among the many developers who work in multiple\ncodebases or projects. One way to alleviate this additional load is\ncontext-specific guidance, such as a tutorial on “Error handling in Go for\nJava developers”. There may even be opportunities to build some of this\nguidance into code analyzers, making it easier to surface directly in an IDE.</p><p>This year we asked the Go community to share their sentiment towards the Go\nproject itself. These results were quite different from the 91% satisfaction\nrate we discussed above, and point to areas the Go Team plans to invest our\nenergy during 2026. In particular, we want to encourage more contributors to\nget involved, and ensure the Go Team accurately understands the challenges Go\ndevelopers currently face. We hope this focus, in turn, will help to increase\ndeveloper trust in both the Go project and the Go Team leadership. As one\nrespondent explained the problem:</p><blockquote><p>“Now that the founding first generation of Go Team members [are] not\ninvolved much anymore in the decision making, I am a bit worried about the\nfuture of Go in terms of quality of maintenance, and its balanced decisions\nso far wrt to changes in the language and std lib. More presence in form of\ntalks [by] the new core team members about the current state and future\nplans might be helpful to strengthen trust.” </p></blockquote><h2>What are people building with Go?</h2><p>We revised this list of “what types of things do you build with Go?” from 2024\nwith the intent of more usefully teasing apart what people are building with\nGo, and avoid confusion around evolving terms like “agents”. Respondent’s top\nuse cases remain CLIs and API services, with no meaningful change in either\nsince 2024. In fact, a majority of respondents (55%) said they build \nCLIs and API services with Go. Over ⅓ of respondents specifically build cloud\ninfrastructure tooling (a new category), and 11% work with ML models, tools,\nor agents (an expanded category). Unfortunately embedded use cases were left\noff of the revised list, but we’ll fix this for next year’s survey.</p><p>Most respondents said they are not currently building AI-powered features into\nthe Go software they work on (78%), with ⅔ reporting that their software does\nnot use AI functionality at all (66%). This appears to be a decrease in\nproduction-related AI usage year-over-year; in 2024, 59% of respondents were\nnot involved in AI feature work, while 39% indicated some level of\ninvolvement. That marks a shift of 14 points away from building AI-powered\nsystems among survey respondents, and may reflect some natural pullback from\nthe early hype around AI-powered applications: it’s plausible that lots of\nfolks tried to see what they could do with this technology during its initial\nrollout, with some proportion deciding against further exploration (at least\nat this time).</p><p>Among respondents who are building AI- or LLM-powered functionality, the most\ncommon use case was to create summaries of existing content (45%). Overall,\nhowever, there was little difference between most uses, with between 28%\n– 33% of respondents adding AI functionality to support classification,\ngeneration, solution identification, chatbots, and software development.</p><h2>What are the biggest challenges facing Go developers?</h2><p>One of the most helpful types of feedback we receive from developers are\ndetails about the challenges people run into while working with Go. The Go\nTeam considers this information holistically and over long time horizons,\nbecause there is often tension between improving Go’s rougher edges and\nkeeping the language and tooling consistent for developers. Beyond technical\nfactors, every change also incurs some cost in terms of developer attention\nand cognitive disruption. Minimizing disruption may sound a bit dull or\nboring, but we view this as an important strength of Go. As Russ Cox wrote in\n2023, <a href=\"https://go.dev/blog/compat\">“Boring is good… Boring means being able to focus on your work, not\non what’s different about Go.”</a>.</p><p>In that spirit, this year’s top challenges are not radically different from\nlast year’s. The top three frustrations respondents reported were “Ensuring\nour Go code follows best practices / Go idioms” (33% of respondents), “A\nfeature I value from another language isn’t part of Go” (28%), and “Finding\ntrustworthy Go modules and packages” (26%). We examined open-text responses to\nbetter understand what people meant. Let’s take a minute to dig into each.</p><p>Respondents who were most frustrated by writing idiomatic Go were often\nlooking for more official guidance, as well as tooling support to help enforce\nthis guidance in their codebase. As in prior surveys, questions about how to\nstructure Go projects were also a common theme. For example:</p><blockquote><p>“The simplicity of go helps to read and understand code from other\ndevelopers, but there are still some aspects that can differ quite a lot\nbetween programmers. Especially if developers come from other languages,\ne.g. Java.” </p></blockquote><blockquote><p>“More opinionated way to write go code. Like how to structure a Go project\nfor services/cli tool.” </p></blockquote><blockquote><p>“It’s hard to figure out what are good idioms. Especially since the core\nteam doesn’t keep Effective Go up-to-date.” </p></blockquote><p>The second major category of frustrations were language features that\ndevelopers enjoyed working with in other ecosystems. These open-text comments\nlargely focused on error handling and reporting patterns, enums and sum types,\nnil pointer safety, and general expressivity / verbosity:</p><blockquote><p>“Still not sure what is the best way to do error handling.” </p></blockquote><blockquote><p>“Rust’s enums are great, and lead to writing great type safe code.” </p></blockquote><blockquote><p>“There is nothing (in the compiler) that stops me from using a maybe nil\npointer, or using a value without checking the err first. That should be\n[baked into] the type system.” </p></blockquote><blockquote><p>“I like [Go] but I didn’t expect it to have nil pointer exceptions :)” </p></blockquote><blockquote><p>“I often find it hard to build abstractions and to provide clear intention\nto the future readers of my code.” </p></blockquote><p>The third major frustration was finding trustworthy Go modules. Respondents\noften described two aspects to this problem. One is that they considered many\n3rd-party modules to be of marginal quality, making it hard for really good\nmodules to stand out. The second is identifying which modules are commonly\nused and under which types of conditions (including recent trends over time).\nThese are both problems that could be addressed by showing what we’ll vaguely\ncall “quality signals” on pkg.go.dev. Respondents provided helpful\nexplanations of the signals they use to identify trustworthy modules,\nincluding project activity, code quality, recent adoption trends, or the\nspecific organizations that support or rely upon the module.</p><blockquote><p>“Being able to filter by criteria like stable version, number of users and\nlast update age at pkg.go.dev could make things a bit easier.” </p></blockquote><blockquote><p>“Many pacakges are just clones/forks or one-off pojects with no\nhistory/maintenance. [sic]” </p></blockquote><blockquote><p>“Maybe flagging trustworthy packages based on experience, maturity and\ncommunity feedback?” </p></blockquote><p>We agree that these are all areas where the developer experience with Go could\nbe improved. The challenge, as discussed earlier, is doing so in such a way\nthat doesn’t lead to breaking changes, increased confusion among Go\ndevelopers, or otherwise gets in the way of people trying to get their work\ndone with Go. Feedback from this survey is a major source of information we\nuse when discussing proposals, but if you’d like to get involved more directly\nor follow along with other contributors, visit the <a href=\"https://github.com/golang/go/issues?q=state%3Aopen%20label%3AProposal\" rel=\"noreferrer\" target=\"_blank\">Go proposals on\nGitHub</a>;\nplease be sure to <a href=\"https://github.com/golang/proposal\" rel=\"noreferrer\" target=\"_blank\">follow this process</a> if\nyou’d like to add a new proposal.</p><p>In addition to these (potentially) ecosystem-wide challenges, this year we\nalso asked specifically about working with the  command. We’ve informally\nheard from developers that this tool’s help system can be confusing to\nnavigate, but we haven’t had a great sense of how frequently people find\nthemselves reviewing this documentation.</p><p>Respondents told us that except for , between 15% – 25% of them\nfelt they “often needed to review documentation” with working with these\ntools. This was surprising, especially for commonly-used subcommands like\n and . Common reasons included remembering specific flags,\nunderstanding what different options do, and navigating the help system\nitself. Participants also confirmed that infrequent use was one reason for\nfrustration, but navigating and parsing command help appears to be the\nunderlying cause. In other words, we all expect to need to review\ndocumentation sometimes, but we don’t expect to need help navigating the\ndocumentation system itself. As on respondent described their journey:</p><blockquote><p>“Accessing the help is painful. go test –help # didn’t work, but tell[s] me\nto type  instead… go help test # oh, actually, the info I’m\nlooking for is in  go help testflag # visually parsing through\ntext that looks all the same without much formatting… I just lack time to\ndig into this rabbit hole.” </p></blockquote><h2>What does their development environment look like?</h2><h3>Operating systems and architectures</h3><p>Generally, respondents told us their development platforms are UNIX-like. Most\nrespondents develop on macOS (60%) or Linux (58%) and deploy to Linux-based\nsystems, including containers (96%). The largest year-over-year change was\namong “embedded devices / IoT” deployments, which increased from 2% -&gt; 8% of\nrespondents; this was the only meaningful change in deployment platforms since\n2024.</p><p>The vast majority of respondents develop on x86-64 or ARM64 architectures,\nwith a sizable group (25%) still potentially working on 32-bit x86 systems.\nHowever, we believe the wording of this question was confusing to respondents;\nnext year we’ll clarify the 32-bit vs. 64-bit distinction for each\narchitecture.</p><p>Several new code editors have become available in the past two years, and we\nexpanded our survey question to include the most popular ones. While we saw\nsome evidence of early adoption, most respondents continued to favor <a href=\"https://code.visualstudio.com/\" rel=\"noreferrer\" target=\"_blank\">VS\nCode</a> (37%) or\n<a href=\"https://www.jetbrains.com/go/\" rel=\"noreferrer\" target=\"_blank\">GoLand</a> (28%). Of the newer editors, Zed and\nCursor were the highest ranked, each becoming the preferred editor of 4% of\nrespondents. To put those numbers in context, we looked back at when VS Code\nand GoLand were first introduced. VS Code (released in 2015) was favored by\n16% of respondents one year after its release. IntelliJ has had a\ncommunity-led Go plugin longer than we’ve been surveying Go developers (💙),\nbut if we look at when JetBrains began officially supporting Go in IntelliJ\n(2016), within one year IntelliJ was preferred by 20% of respondents.</p><p>Note: This analysis of code editors does not include respondents who were\nreferred to the survey directly from VS Code or GoLand.</p><p>The most common deployment environments for Go continue to be Amazon Web\nServices (AWS) at 46% of respondents, company-owned servers (44%), and Google\nCloud Platform (GCP) at 26%. These numbers show minor shifts since 2024, but\nnothing statistically significant. We found that the “Other” category\nincreased to 11% this year, and this was primarily driven by Hetzner (20% of\nOther responses); we plan to include Hetzner as a response choice in next\nyear’s survey.</p><p>We also asked respondents about their development experience of working with\ndifferent cloud providers. The most common responses, however, showed that\nrespondents weren’t really sure (46%) or don’t directly interact with public\ncloud providers (21%). The biggest driver behind these responses was a theme\nwe’ve heard often before: with containers, it’s possible to abstract many\ndetails of the cloud environment away from the developer, so that they don’t\nmeaningfully interact with most provider-specific technologies. This result\nsuggests that even developers whose work is  to clouds may have\nlimited experience with the larger suite of tools and technology associated\nwith each cloud provider. For example:</p><blockquote><p>“Kinda abstract to the platform, Go is very easy to put in a container and\nso pretty easy to deploy anywhere: one of its big strength[s].” </p></blockquote><blockquote><p>“The cloud provider really doesn’t make much difference to me. I write code\nand deploy it to containers, so whether that’s AWS or GCP I don’t really\ncare.” </p></blockquote><p>We suspect this level of abstraction is dependant on the use case and\nrequirements of the service that’s being deployed — it may not always\nmake sense or be possible to keep it highly abstracted. In the future, we plan\nto further investigate how Go developers tend to interact with the platforms\nwhere their software is ultimately deployed.</p><p>Finally, we can’t discuss development environments in 2025 without also\nmentioning AI-powered software development tools. Our survey suggests\nbifurcated adoption — while a majority of respondents (53%) said they\nuse such tools daily, there is also a large group (29%) who do not use these\nat all, or only used them a few times during the past month. We expected this\nto negatively correlate with age or development experience, but were unable to\nfind strong evidence supporting this theory except for  new developers:\nrespondents with less than one year of professional development experience\n(not specific to Go) did report more AI use than every other cohort, but this\ngroup only represented 2% of survey respondents.</p><p>At this time, agentic use of AI-powered tools appears nascent among Go\ndevelopers, with only 17% of respondents saying this is their primary way of\nusing such tools, though a larger group (40%) are occasionally trying agentic\nmodes of operation.</p><p>The most commonly used AI assistants remain ChatGPT, GitHub Copilot, and\nClaude. Most of these agents show lower usage numbers <a href=\"https://go.dev/blog/survey2024-h2-results#ai-assistance\">compared with our 2024\nsurvey</a> (Claude and Cursor are\nnotable exceptions), but due to a methodology change, this is not an\napples-to-apples comparison. It is, however, plausible that developers are\n“shopping around” less than they were when these tools were first released,\nresulting in more people using a single assistant for most of their work.</p><p>We also asked about overall satisfaction with AI-powered development tools. A\nmajority (55%) reported being satisfied, but this was heavily weighted towards\nthe “Somewhat satisfied” category (42%) vs. the “Very satisfied” group (13%).\nRecall that Go itself consistently shows a 90%+ satisfaction rate each year;\nthis year, 62% of respondents said they are “Very satisfied” with Go. We add\nthis context to show that while AI-powered tooling is starting to see adoption\nand finding some successful use cases, developer sentiment  towards them\nremains much softer than towards more established tooling (among Go\ndevelopers, at least).</p><p>What is driving this lower rate of satisfaction? In a word: quality. We asked\nrespondents to tell us something good they’ve accomplished with these tools,\nas well as something that didn’t work out well. A majority said that creating\nnon-functional code was their primary problem with AI developer tools (53%),\nwith 30% lamenting that even working code was of poor quality. The most\nfrequently cited benefits, conversely, were generating unit tests, writing\nboilerplate code, enhanced autocompletion, refactoring, and documentation\ngeneration. These appear to be cases where code quality is perceived as less\ncritical, tipping the balance in favor of letting AI take the first pass at a\ntask. That said, respondents also told us the AI-generated code in these\nsuccessful cases still required careful review (and often, corrections), as it\ncan be buggy, insecure, or lack context.</p><blockquote><p>“I’m never satisfied with code quality or consistency, it never follows the\npractices I want to.” </p></blockquote><blockquote><p>“All AI tools tend to hallucinate quickly when working with medium-to-large\ncodebases (10k+ lines of code). They can explain code effectively but\nstruggle to generate new, complex features” </p></blockquote><blockquote><p>“Despite numerous efforts to make it write code in an established codebase,\nit would take too much effort to steer it to follow the practices in the\nproject, and it would add subtle behaviour paths - i.e. if it would miss\nsome method it would try to find its way around it or rely on some side\neffect. Sometimes those things are hard to recognize during code review. I\nalso found it mentally taxing to review ai generated code and that overhead\nkills the productivity potential in writing code.” </p></blockquote><p>When we asked developers what they used these tools for, a pattern emerged\nthat is consistent with these quality concerns. The tasks with most adoption\n(green in the chart below) and least resistance (red) deal with bridging\nknowledge gaps, improving local code, and avoiding toil. The frustrations that\ndevelopers talk about with code-generating tools were much less evident when\nthey’re seeking information, like how to use a specific API or configure test\ncoverage, and perhaps as a result, we see higher usage of AI in these areas.\nAnother spot that stood out was  code review and related suggestions\n— people were less interested in using AI to review other people’s code\nthan in reviewing their own. Surprisingly, “testing code” showed lower AI\nadoption than other toilsome tasks, though we don’t yet have strong\nunderstanding of why.</p><p>Of all the tasks we asked about, “Writing code” was the most bifurcated, with\n66% of respondents already or hoping to soon use AI for this, while ¼ of\nrespondents didn’t want AI involved at all. Open-ended responses suggest\ndevelopers primarily use this for toilsome, repetitive code, and continue to\nhave concerns about the quality of AI-generated code.</p><p>Once again, a tremendous thank-you to everyone who responded to this year’s Go\nDeveloper Survey!</p><p>We plan to share the raw survey dataset in Q1 2026, so the larger community\ncan also explore the data underlying these findings. This will only include\nresponses from people who opted in to share this data (82% of all\nrespondents), so there may be some differences from the numbers we reference\nin this post.</p><p>This survey was conducted between Sept 9 - Sept 30, 2025. Participants were\npublicly invited to respond via the Go Blog, invitations on social media\nchannels (including Bluesky, Mastodon, Reddit, and X), as well as randomized\nin-product invitations to people using VS Code and GoLand to write Go\nsoftware. We received a total of 7,070 responses. After data cleaning to\nremove bots and other very low quality responses, 5,379 were used for the\nremainder of our analysis. The median survey response time was between 12\n– 13 minutes.</p><p>Throughout this report we use charts of survey responses to provide supporting\nevidence for our findings. All of these charts use a similar format. The title\nis the exact question that survey respondents saw. Unless otherwise noted,\nquestions were multiple choice and participants could only select a single\nresponse choice; each chart’s subtitle will tell the reader if the question\nallowed multiple response choices or was an open-ended text box instead of a\nmultiple choice question. For charts of open-ended text responses, a Go team\nmember read and manually categorized all of the responses. Many open-ended\nquestions elicited a wide variety of responses; to keep the chart sizes\nreasonable, we condensed them to a maximum of the top 10-12 themes, with\nadditional themes all grouped under “Other”. The percentage labels shown in\ncharts are rounded to the nearest integer (e.g., 1.4% and 0.8% will both be\ndisplayed as 1%), but the length of each bar and row ordering are based on the\nunrounded values.</p><p>To help readers understand the weight of evidence underlying each finding, we\nincluded error bars showing the 95% <a href=\"https://en.wikipedia.org/wiki/Confidence_interval\" rel=\"noreferrer\" target=\"_blank\">confidence\ninterval</a> for responses;\nnarrower bars indicate increased confidence. Sometimes two or more responses\nhave overlapping error bars, which means the relative order of those responses\nis not statistically meaningful (i.e., the responses are effectively tied).\nThe lower right of each chart shows the number of people whose responses are\nincluded in the chart, in the form “n = [number of respondents]”.</p>",
      "contentLength": 26365,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "crates.io: development update",
      "url": "https://blog.rust-lang.org/2026/01/21/crates-io-development-update/",
      "date": 1768953600,
      "author": "Tobias Bieniek",
      "guid": 37429,
      "unread": true,
      "content": "<p>Time flies! Six months have passed since our last crates.io development update, so it's time for another one. Here's a summary of the most notable changes and improvements made to <a href=\"https://crates.io/\">crates.io</a> over the past six months.</p><p>Crate pages now have a new \"Security\" tab that displays security advisories from the <a href=\"https://rustsec.org/\">RustSec</a> database. This allows you to quickly see if a crate has known vulnerabilities before adding it as a dependency.</p><p>The tab shows known vulnerabilities for the crate along with the affected version ranges.</p><p>This feature is still a work in progress, and we plan to add more functionality in the future. We would like to thank the <a href=\"https://openssf.org/\">OpenSSF</a> (Open Source Security Foundation) for funding this work and <a href=\"https://github.com/djc\">Dirkjan Ochtman</a> for implementing it.</p><h2><a href=\"https://blog.rust-lang.org/2026/01/21/crates-io-development-update/#trusted-publishing-enhancements\" aria-hidden=\"true\"></a>\nTrusted Publishing Enhancements</h2><p>In our July 2025 update, we announced Trusted Publishing support for GitHub Actions. Since then, we have made several enhancements to this feature.</p><p>Trusted Publishing now supports <a href=\"https://docs.gitlab.com/ee/ci/\">GitLab CI/CD</a> in addition to GitHub Actions. This allows GitLab users to publish crates without managing API tokens, using the same OIDC-based authentication flow.</p><p>Note that this currently only works with GitLab.com. Self-hosted GitLab instances are not supported yet. The crates.io implementation has been refactored to support multiple CI providers, so adding support for other platforms like Codeberg/Forgejo in the future should be straightforward. Contributions are welcome!</p><h3><a href=\"https://blog.rust-lang.org/2026/01/21/crates-io-development-update/#trusted-publishing-only-mode\" aria-hidden=\"true\"></a>\nTrusted Publishing Only Mode</h3><p>Crate owners can now enforce Trusted Publishing for their crates. When enabled in the crate settings, traditional API token-based publishing is disabled, and only Trusted Publishing can be used to publish new versions. This reduces the risk of unauthorized publishes from leaked API tokens.</p><p>The  and  GitHub Actions triggers are now blocked from Trusted Publishing. These triggers have been responsible for multiple security incidents in the GitHub Actions ecosystem and are not worth the risk.</p><p>Crate pages now display source lines of code (SLOC) metrics, giving you insight into the size of a crate before adding it as a dependency. This metric is calculated in a background job after publishing using the <a href=\"https://github.com/XAMPPRocky/tokei\">tokei</a> crate. It is also shown on OpenGraph images:</p><h2><a href=\"https://blog.rust-lang.org/2026/01/21/crates-io-development-update/#publication-time-in-index\" aria-hidden=\"true\"></a>\nPublication Time in Index</h2><p>A new  field has been added to crate index entries, recording when each version was published. This enables several use cases:</p><ul><li>Cargo can implement cooldown periods for new versions in the future</li><li>Cargo can replay dependency resolution as if it were a past date, though yanked versions remain yanked</li><li>Services like <a href=\"https://github.com/renovatebot/renovate\">Renovate</a> can determine release dates without additional API requests</li></ul><h2><a href=\"https://blog.rust-lang.org/2026/01/21/crates-io-development-update/#svelte-frontend-migration\" aria-hidden=\"true\"></a>\nSvelte Frontend Migration</h2><p>At the end of 2025, the crates.io team evaluated several options for modernizing our frontend and decided to experiment with porting the website to <a href=\"https://svelte.dev/\">Svelte</a>. The goal is to create a one-to-one port of the existing functionality before adding new features.</p><p>This migration is still considered experimental and is a work in progress. Using a more mainstream framework should make it easier for new contributors to work on the frontend. The new Svelte frontend uses TypeScript and generates type-safe API client code from our <a href=\"https://crates.io/api/openapi.json\">OpenAPI description</a>, so types flow from the Rust backend to the TypeScript frontend automatically.</p><p>Thanks to <a href=\"https://github.com/eth3lbert\">eth3lbert</a> for the helpful reviews and guidance on Svelte best practices. We'll share more details in a future update.</p><p>These were some of the more visible changes to crates.io over the past six months, but a lot has happened \"under the hood\" as well.</p><ul><li><p><strong>Cargo user agent filtering</strong>: We noticed that download graphs were showing a constant background level of downloads even for unpopular crates due to bots, scrapers, and mirrors. Download counts are now filtered to only include requests from Cargo, providing more accurate statistics.</p></li><li><p>: Emails from crates.io now support HTML formatting.</p></li><li><p>: OAuth access tokens from GitHub are now encrypted at rest in the database. While we have no evidence of any abuse, we decided to improve our security posture. The tokens were never included in the daily database dump, and the old unencrypted column has been removed.</p></li><li><p>: Crate pages now display a \"Browse source\" link in the sidebar that points to the corresponding docs.rs page. Thanks to <a href=\"https://github.com/carols10cents\">Carol Nichols</a> for implementing this feature.</p></li><li><p>: The sparse index at index.crates.io is now served primarily via Fastly to conserve our AWS credits for other use cases. In the past month, static.crates.io served approximately 1.6 PB across 11 billion requests, while index.crates.io served approximately 740 TB across 19 billion requests. A big thank you to Fastly for providing free CDN services through their <a href=\"https://www.fastly.com/fast-forward\">Fast Forward program</a>!</p></li><li><p><strong>OpenGraph image improvements</strong>: We fixed emoji and CJK character rendering in OpenGraph images, which was caused by missing fonts on our server.</p></li><li><p><strong>Background worker performance</strong>: Database indexes were optimized to improve background job processing performance.</p></li><li><p><strong>CloudFront invalidation improvements</strong>: Invalidation requests are now batched to avoid hitting AWS rate limits when publishing large workspaces.</p></li></ul><p>We hope you enjoyed this update on the development of crates.io. If you have any feedback or questions, please let us know on <a href=\"https://rust-lang.zulipchat.com/#narrow/stream/318791-t-crates-io\">Zulip</a> or <a href=\"https://github.com/rust-lang/crates.io/discussions\">GitHub</a>. We are always happy to hear from you and are looking forward to your feedback!</p>",
      "contentLength": 5278,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Uniform API server access using clientcmd",
      "url": "https://kubernetes.io/blog/2026/01/19/clientcmd-apiserver-access/",
      "date": 1768845600,
      "author": "",
      "guid": 37083,
      "unread": true,
      "content": "<p>If you've ever wanted to develop a command line client for a Kubernetes API,\nespecially if you've considered making your client usable as a  plugin,\nyou might have wondered how to make your client feel familiar to users of .\nA quick glance at the output of  might put a damper on that:\n\"Am I really supposed to implement all those options?\"</p><p>Fear not, others have done a lot of the work involved for you.\nIn fact, the Kubernetes project provides two libraries to help you handle\n-style command line arguments in Go programs:\n<a href=\"https://pkg.go.dev/k8s.io/client-go/tools/clientcmd\"></a> and\n<a href=\"https://pkg.go.dev/k8s.io/cli-runtime\"></a>\n(which uses ).\nThis article will show how to use the former.</p><p>As might be expected since it's part of ,\n's ultimate purpose is to provide an instance of\n<a href=\"https://pkg.go.dev/k8s.io/client-go/rest#Config\"></a>\nthat can issue requests to an API server.</p><p>It follows  semantics:</p><ul><li>defaults are taken from  or equivalent;</li><li>files can be specified using the  environment variable;</li><li>all of the above settings can be further overridden using command line arguments.</li></ul><p>It doesn't set up a  command line argument,\nwhich you might want to do to align with ;\nyou'll see how to do this\nin the <a href=\"https://kubernetes.io/blog/2026/01/19/clientcmd-apiserver-access/#bind-the-flags\">\"Bind the flags\"</a> section.</p><p> allows programs to handle</p><ul><li> selection (using );</li><li>client certificates and private keys;</li><li>HTTP Basic authentication support (username/password).</li></ul><p>In various scenarios,  supports  configuration settings:\n can specify multiple files whose contents are combined.\nThis can be confusing, because settings are merged in different directions\ndepending on how they are implemented.\nIf a setting is defined in a map, the first definition wins,\nsubsequent definitions are ignored.\nIf a setting is not defined in a map, the last definition wins.</p><p>When settings are retrieved using ,\nmissing files result in warnings only.\nIf the user explicitly specifies a path (in  style),\nthere must be a corresponding file.</p><p>If  isn't defined,\nthe default configuration file, , is used instead,\nif present.</p><p>The general usage pattern is succinctly expressed in\nthe <a href=\"https://pkg.go.dev/k8s.io/client-go/tools/clientcmd\"></a> package documentation:</p><div><pre tabindex=\"0\"><code data-lang=\"go\"></code></pre></div><p>In the context of this article, there are six steps:</p><h3>Configure the loading rules</h3><p><code>clientcmd.NewDefaultClientConfigLoadingRules()</code> builds loading rules which will use either the contents of the  environment variable,\nor the default configuration file name ().\nIn addition, if the default configuration file is used,\nit is able to migrate settings from the (very) old default configuration file\n().</p><p>You can build your own ,\nbut in most cases the defaults are fine.</p><p><code>clientcmd.ConfigOverrides</code> is a  storing overrides which will be applied over the settings loaded from the configuration derived using the loading rules.\nIn the context of this article,\nits primary purpose is to store values obtained from command line arguments.\nThese are handled using the <a href=\"https://github.com/spf13/pflag\">pflag</a> library,\nwhich is a drop-in replacement for Go's <a href=\"https://pkg.go.dev/flag\"></a> package,\nadding support for double-hyphen arguments with long names.</p><p>In most cases there's nothing to set in the overrides;\nI will only bind them to flags.</p><p>In this context, a flag is a representation of a command line argument,\nspecifying its long name (such as ),\nits short name if any (such as ),\nits default value,\nand a description shown in the usage information.\nFlags are stored in instances of\nthe <a href=\"https://pkg.go.dev/k8s.io/client-go/tools/clientcmd#FlagInfo\"></a> struct.</p><p>Three sets of flags are available,\nrepresenting the following command line arguments:</p><ul><li>authentication arguments (certificates, tokens, impersonations, username/password);</li><li>cluster arguments (API server, certificate authority, TLS configuration, proxy, compression)</li><li>context arguments (cluster name,  user name, namespace)</li></ul><p>The recommended selection includes all three with a named context selection argument and a timeout argument.</p><p>These are all available using the  functions.\nThe functions take a prefix, which is prepended to all the argument long names.</p><p>So calling\n<a href=\"https://pkg.go.dev/k8s.io/client-go/tools/clientcmd#RecommendedConfigOverrideFlags\"><code>clientcmd.RecommendedConfigOverrideFlags(\"\")</code></a>\nresults in command line arguments such as , , and so on.\nThe  argument is given a default value of 0,\nand the  argument has a corresponding short variant, .\nAdding a prefix, such as , results in command line arguments such as\n, , etc.\nThis might not seem particularly useful on commands involving a single API server,\nbut they come in handy when multiple API servers are involved,\nsuch as in multi-cluster scenarios.</p><p>There's a potential gotcha here: prefixes don't modify the short name,\nso  needs some care if multiple prefixes are used:\nonly one of the prefixes can be associated with the  short name.\nYou'll have to clear the short names associated with the other prefixes'\n , or perhaps all prefixes if there's no sensible\n association.\nShort names can be cleared as follows:</p><div><pre tabindex=\"0\"><code data-lang=\"go\"></code></pre></div><p>In a similar fashion, flags can be disabled entirely by clearing their long name:</p><div><pre tabindex=\"0\"><code data-lang=\"go\"></code></pre></div><p>Once a set of flags has been defined,\nit can be used to bind command line arguments to overrides using\n<a href=\"https://pkg.go.dev/k8s.io/client-go/tools/clientcmd#BindOverrideFlags\"><code>clientcmd.BindOverrideFlags</code></a>.\nThis requires a\n<a href=\"https://pkg.go.dev/github.com/spf13/pflag\"></a>\nrather than one from Go's  package.</p><p>If you also want to bind , you should do so now,\nby binding  in the loading rules:</p><div><pre tabindex=\"0\"><code data-lang=\"go\"></code></pre></div><h3>Build the merged configuration</h3><p>Two functions are available to build a merged configuration:</p><p>As the names suggest, the difference between the two is that the first\ncan ask for authentication information interactively,\nusing a provided reader,\nwhereas the second only operates on the information given to it by the caller.</p><p>The \"deferred\" mention in these function names refers to the fact that\nthe final configuration will be determined as late as possible.\nThis means that these functions can be called before the command line arguments are parsed,\nand the resulting configuration will use whatever values have been parsed\nby the time it's actually constructed.</p><p>The merged configuration is returned as a\n<a href=\"https://pkg.go.dev/k8s.io/client-go/tools/clientcmd#ClientConfig\"></a> instance.\nAn API client can be obtained from that by calling the  method.</p><p>If no configuration is given\n( is empty or points to non-existent files,\n doesn't exist,\nand no configuration is given using command line arguments),\nthe default setup will return an obscure error referring to .\nThis is legacy behaviour;\nseveral attempts have been made to get rid of it,\nbut it is preserved for the  and  command line arguments in .\nYou should check for \"empty configuration\" errors by calling <code>clientcmd.IsEmptyConfig()</code>\nand provide a more explicit error message.</p><p>The  method is also useful:\nit returns the namespace that should be used.\nIt also indicates whether the namespace was overridden by the user\n(using ).</p><p>Here's a complete example.</p><div><pre tabindex=\"0\"><code data-lang=\"go\"></code></pre></div><p>Happy coding, and thank you for your interest in implementing tools with\nfamiliar usage patterns!</p>",
      "contentLength": 6381,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Python 3.15.0 alpha 5 (yes, another alpha!)",
      "url": "https://pythoninsider.blogspot.com/2026/01/python-3150-alpha-5-yes-another-alpha.html",
      "date": 1768412280,
      "author": "Hugo",
      "guid": 35961,
      "unread": true,
      "content": "<p><i>Note: 3.15.0a4 was accidentally built against  from\n2025-12-23 instead of 2026-01-13, so this 3.15.0a5 is an extra release\ncorrectly built against 2026-01-14.</i></p><p><strong>This is an early developer preview of Python\n3.15</strong></p><p>Python 3.15 is still in development. This release, 3.15.0a5, is the\nfifth of  eight planned alpha releases.</p><p>Alpha releases are intended to make it easier to test the current\nstate of new features and bug fixes and to test the release process.</p><p>During the alpha phase, features may be added up until the start of\nthe beta phase (2026-05-05) and, if necessary, may be modified or\ndeleted up until the release candidate phase (2026-07-28). Please keep\nin mind that this is a preview release and its use is\n recommended for production environments.</p><p>Many new features for Python 3.15 are still being planned and\nwritten. Among the new major new features and changes so far:</p><ul><li><a href=\"https://docs.python.org/3.15/whatsnew/3.15.html#whatsnew315-sampling-profiler\">PEP\n799</a>: A new high-frequency, low-overhead, statistical sampling\nprofiler and dedicated profiling package</li><li><a href=\"https://docs.python.org/3.15/whatsnew/3.15.html#whatsnew315-utf8-default\">PEP\n686</a>: Python now uses UTF-8 as the default encoding</li><li><a href=\"https://docs.python.org/3.15/whatsnew/3.15.html#whatsnew315-pep782\">PEP\n782</a>: A new  C API to create a Python bytes\nobject</li><li>The <a href=\"https://docs.python.org/3.15/whatsnew/3.15.html#whatsnew315-jit\">JIT\ncompiler</a> has been significantly upgraded, with 4-5% geometric mean\nperformance improvement on x86-64 Linux over the standard interpreter,\nand 7-8% speedup on AArch64 macOS over the tail-calling interpreter</li><li><small>(Hey,  if a feature\nyou find important is missing from this list, let Hugo\nknow.)</small></li></ul><p>The next pre-release of Python 3.15 will be 3.15.0a6, currently\nscheduled for 2026-02-10.</p><blockquote><p>At last it was given out that some time next day the ship would\ncertainly sail. So next morning, Queequeg and I took a very early\nstart.</p></blockquote><p>Thanks to all of the many volunteers who help make Python Development\nand these releases possible! Please consider supporting our efforts by\nvolunteering yourself or through organisation contributions to the <a href=\"https://www.python.org/psf/donations/\">Python Software\nFoundation</a>.</p><p>Regards from a still snowfully subzero Helsinki,</p><p>Your release team,\n  Hugo van Kemenade\n  Steve Dower\n  </p>",
      "contentLength": 1941,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "What does it take to ship Rust in safety-critical?",
      "url": "https://blog.rust-lang.org/2026/01/14/what-does-it-take-to-ship-rust-in-safety-critical/",
      "date": 1768348800,
      "author": "Pete LeVasseur",
      "guid": 35952,
      "unread": true,
      "content": "<p><em>This is another post in our series covering what we learned through the Vision Doc process. In <a href=\"https://blog.rust-lang.org/2025/12/03/lessons-learned-from-the-rust-vision-doc-process/\">our first post</a>, we described the overall approach and what we learned about doing user research. In <a href=\"https://blog.rust-lang.org/2025/12/19/what-do-people-love-about-rust/\">our second post</a>, we explored what people love about Rust. This post goes deep on one domain: safety-critical software.</em></p><p>When we set out on the Vision Doc work, one area we wanted to explore in depth was safety-critical systems: software where malfunction can result in injury, loss of life, or environmental harm. Think vehicles, airplanes, medical devices, industrial automation. We spoke with engineers at OEMs, integrators, and suppliers across automotive (mostly), industrial, aerospace, and medical contexts.</p><p>What we found surprised us a bit. The conversations kept circling back to a single tension: Rust's compiler-enforced guarantees support much of what Functional Safety Engineers and Software Engineers in these spaces spend their time preventing, but once you move beyond prototyping into the higher-criticality parts of a system, the ecosystem support thins out fast. There is no MATLAB/Simulink Rust code generation. There is no OSEK or AUTOSAR Classic-compatible RTOS written in Rust or with first-class Rust support. The tooling for qualification and certification is still maturing.</p><h2><a href=\"https://blog.rust-lang.org/2026/01/14/what-does-it-take-to-ship-rust-in-safety-critical/#quick-context-what-makes-software-safety-critical\" aria-hidden=\"true\"></a>\nQuick context: what makes software \"safety-critical\"</h2><p>If you've never worked in these spaces, here's the short version. Each safety-critical domain has standards that define a ladder of integrity levels: ISO 26262 in automotive, IEC 61508 in industrial, IEC 62304 in medical devices, DO-178C in aerospace. The details differ, but the shape is similar: as you climb the ladder toward higher criticality, the demands on your development process, verification, and evidence all increase, and so do the costs.</p><p>This creates a strong incentive for : isolate the highest-criticality logic into the smallest surface area you can, and keep everything else at lower levels where costs are more manageable and you can move faster.</p><p>We'll use automotive terminology in this post (QM through ASIL D) since that's where most of our interviews came from, but the patterns generalize. These terms represent increasing levels of safety-criticality, with QM being the lowest and ASIL D being the highest. The story at low criticality looks very different from the story at high criticality, regardless of domain.</p><h2><a href=\"https://blog.rust-lang.org/2026/01/14/what-does-it-take-to-ship-rust-in-safety-critical/#rust-is-already-in-production-for-safety-critical-systems\" aria-hidden=\"true\"></a>\nRust is already in production for safety-critical systems</h2><p>Before diving into the challenges, it is worth noting that Rust is not just being evaluated in these domains. It is deployed and running in production.</p><p>We spoke with a principal firmware engineer working on mobile robotics systems certified to IEC 61508 SIL 2:</p><blockquote><p>\"We had a new project coming up that involved a safety system. And in the past, we'd always done these projects in C using third party stack analysis and unit testing tools that were just generally never very good, but you had to do them as part of the safety rating standards. Rust presented an opportunity where 90% of what the stack analysis stuff had to check for is just done by the compiler. That combined with the fact that now we had a safety qualified compiler to point to was kind of a breakthrough.\" -- Principal Firmware Engineer (mobile robotics)</p></blockquote><p>We also spoke with an engineer at a medical device company deploying IEC 62304 Class B software to intensive care units:</p><blockquote><p>\"All of the product code that we deploy to end users and customers is currently in Rust. We do EEG analysis with our software and that's being deployed to ICUs, intensive care units, and patient monitors.\" -- Rust developer at a medical device company</p></blockquote><blockquote><p>\"We changed from this Python component to a Rust component and I think that gave us a 100-fold speed increase.\" -- Rust developer at a medical device company</p></blockquote><p>These are not proofs of concept. They are shipping systems in regulated environments, going through audits and certification processes. The path is there. The question is how to make it easier for the next teams coming through.</p><h2><a href=\"https://blog.rust-lang.org/2026/01/14/what-does-it-take-to-ship-rust-in-safety-critical/#rust-adoption-is-easiest-at-qm-and-the-constraints-sharpen-fast\" aria-hidden=\"true\"></a>\nRust adoption is easiest at QM, and the constraints sharpen fast</h2><p>At low criticality, teams described a pragmatic approach: use Rust and the crates ecosystem to move quickly, then harden what you ship. One architect at an automotive OEM told us:</p><blockquote><p>\"We can use any crate [from crates.io] [..] we have to take care to prepare the software components for production usage.\" -- Architect at Automotive OEM</p></blockquote><p>But at higher levels, third-party dependencies become difficult to justify. Teams either rewrite, internalize, or strictly constrain what they use. An embedded systems engineer put it bluntly:</p><blockquote><p>\"We tend not to use 3rd party dependencies or nursery crates [..] solutions become kludgier as you get lower in the stack.\" -- Firmware Engineer</p></blockquote><p>Some teams described building escape hatches, abstraction layers designed for future replacement:</p><blockquote><p>\"We create an interface that we'd eventually like to have to simplify replacement later on [..] sometimes rewrite, but even if re-using an existing crate we often change APIs, write more tests.\" -- Team Lead at Automotive Supplier (ASIL D target)</p></blockquote><p>Even teams that do use crates from crates.io described treating that as a temporary accelerator, something to track carefully and remove from critical paths before shipping:</p><blockquote><p>\"We use crates mainly for things in the beginning where we need to set up things fast, proof of concept, but we try to track those dependencies very explicitly and for the critical parts of the software try to get rid of them in the long run.\" -- Team lead at an automotive software company developing middleware in Rust</p></blockquote><p>In aerospace, the \"control the whole stack\" instinct is even stronger:</p><blockquote><p>\"In aerospace there's a notion of we must own all the code ourselves. We must have control of every single line of code.\" -- Engineering lead in aerospace</p></blockquote><p>This is the first big takeaway: <strong>a lot of \"Rust in safety-critical\" is not just about whether Rust compiles for a target. It is about whether teams can assemble an evidence-friendly software stack and keep it stable over long product lifetimes.</strong></p><p>Many interviewees framed Rust's value in terms of work shifted earlier and made more repeatable by the compiler. This is not just \"nice,\" it changes how much manual review you can realistically afford. Much of what was historically process-based enforcement through coding standards like MISRA C and CERT C becomes a language-level concern in Rust, checked by the compiler rather than external static analysis or manual review.</p><blockquote><p>\"Roughly 90% of what we used to check with external tools is built into Rust's compiler.\" -- Principal Firmware Engineer (mobile robotics)</p></blockquote><p>We heard variations of this from teams dealing with large codebases and varied skill levels:</p><blockquote><p>\"We cannot control the skill of developers from end to end. We have to check the code quality. Rust by checking at compile time, or Clippy tools, is very useful for our domain.\" -- Engineer at a major automaker</p></blockquote><p>Even on smaller teams, the review load matters:</p><blockquote><p>\"I usually tend to work on teams between five and eight. Even so, it's too much code. I feel confident moving faster, a certain class of flaws that you aren't worrying about.\" -- Embedded systems engineer (mobile robotics)</p></blockquote><p>Closely related: people repeatedly highlighted Rust's consistency around error handling:</p><blockquote><p>\"Having a single accepted way of handling errors used throughout the ecosystem is something that Rust did completely right.\" -- Automotive Technical Lead</p></blockquote><p>For teams building products with 15-to-20-year lifetimes and \"teams of teams,\" compiler-enforced invariants scale better than \"we will just review harder.\"</p><p>A common pattern in safety-critical environments is conservative toolchain selection. But engineers pointed out a tension: older toolchains carry their own defect history.</p><blockquote><p>\"[..] traditional wisdom is that after something's been around and gone through motions / testing then considered more stable and safer [..] older compilers used tend to have more bugs [and they become] hard to justify\" -- Software Engineer at an Automotive supplier</p></blockquote><p>Rust's edition system was described as a real advantage here, especially for incremental migration strategies that are common in automotive programs:</p><blockquote><p>\"[The edition system is] golden for automotive, where incremental migration is essential.\" -- Software Engineer at major Automaker</p></blockquote><p>In practice, \"stability\" is also about managing the mismatch between what the platform supports and what the ecosystem expects. Teams described pinning Rust versions, then fighting dependency drift:</p><blockquote><p>\"We can pin the Rust toolchain, but because almost all crates are implemented for the latest versions, we have to downgrade. It's very time-consuming.\" -- Engineer at a major automaker</p></blockquote><p>For safety-critical adoption, \"stability\" is operational. Teams need to answer questions like: What does a Rust upgrade change, and what does it not change? What are the bounds on migration work? How do we demonstrate we have managed upgrade risk?</p><h2><a href=\"https://blog.rust-lang.org/2026/01/14/what-does-it-take-to-ship-rust-in-safety-critical/#target-support-matters-in-practical-ways\" aria-hidden=\"true\"></a>\nTarget support matters in practical ways</h2><p>Safety-critical software often runs on long-lived platforms and RTOSs. Even when \"support exists,\" there can be caveats. Teams described friction around targets like QNX, where upstream Rust support exists but with limitations (for example, QNX 8.0 support is currently  only).</p><p>This connects to Rust's target tier policy: the policy itself is clear, but regulated teams still need to map \"tier\" to \"what can I responsibly bet on for this platform and this product lifetime.\"</p><blockquote><p>\"I had experiences where all of a sudden I was upgrading the compiler and my toolchain and dependencies didn't work anymore for the Tier 3 target we're using. That's simply not acceptable. If you want to invest in some technology, you want to have a certain reliability.\" -- Senior software engineer at a major automaker</p></blockquote><h2><a href=\"https://blog.rust-lang.org/2026/01/14/what-does-it-take-to-ship-rust-in-safety-critical/#core-is-the-spine-and-it-sets-expectations\" aria-hidden=\"true\"></a> is the spine, and it sets expectations</h2><p>In  environments,  becomes the spine of Rust. Teams described it as both rich enough to build real products and small enough to audit.</p><p>A lot of Rust's safety leverage lives there:  and , slices, iterators,  and , atomics, , . But we also heard a consistent shape of gaps: many embedded and safety-critical projects want -friendly building blocks (fixed-size collections, queues) and predictable math primitives, but do not want to rely on \"just any\" third-party crate at higher integrity levels.</p><blockquote><p>\"Most of the math library stuff is not in core, it's in std. Sin, cosine... the workaround for now has been the libm crate. It'd be nice if it was in core.\" -- Principal Firmware Engineer (mobile robotics)</p></blockquote><h2><a href=\"https://blog.rust-lang.org/2026/01/14/what-does-it-take-to-ship-rust-in-safety-critical/#async-is-appealing-but-the-long-run-story-is-not-settled\" aria-hidden=\"true\"></a>\nAsync is appealing, but the long-run story is not settled</h2><p>Some safety-critical-adjacent systems are already heavily asynchronous: daemons, middleware frameworks, event-driven architectures. That makes Rust's async story interesting.</p><p>But people also expressed uncertainty about ecosystem lock-in and what it would take to use async in higher-criticality components. One team lead developing middleware told us:</p><blockquote><p>\"We're not sure how async will work out in the long-run [in Rust for safety-critical]. [..] A lot of our software is highly asynchronous and a lot of our daemons in the AUTOSAR Adaptive Platform world are basically following a reactor pattern. [..] [C++14] doesn't really support these concepts, so some of this is lack of familiarity.\" -- Team lead at an automotive software company developing middleware in Rust</p></blockquote><p>And when teams look at async through an ISO 26262 lens, the runtime question shows up immediately:</p><blockquote><p>\"If we want to make use of async Rust, of course you need some runtime which is providing this with all the quality artifacts and process artifacts for ISO 26262.\" -- Team lead at an automotive software company developing middleware in Rust</p></blockquote><p>Async is not \"just a language feature\" in safety-critical contexts. It pulls in runtime choices, scheduling assumptions, and, at higher integrity levels, the question of what it would mean to certify or qualify the relevant parts of the stack.</p><p><strong>Find ways to help the safety-critical community support their own needs.</strong> Open source helps those who help themselves. The Ferrocene Language Specification (FLS) shows this working well: it started as an industry effort to create a specification suitable for safety-qualification of the Rust compiler, companies invested in the work, and it now has a sustainable home under the Rust Project with a team actively maintaining it.</p><p>Contrast this with MC/DC coverage support in rustc. Earlier efforts stalled due to lack of sustained engagement from safety-critical companies. The technical work was there, but without industry involvement to help define requirements, validate the implementation, and commit to maintaining it, the effort lost momentum. A major concern was that the MC/DC code added maintenance burden to the rest of the coverage infrastructure without a clear owner. Now in 2026, there is renewed interest in doing this the right way: companies are working through the Safety-Critical Rust Consortium to create a Rust Project Goal in 2026 to collaborate with the Rust Project on MC/DC support. The model is shared ownership of requirements, with primary implementation and maintenance done by companies with a vested interest in safety-critical, done in a way that does not impede maintenance of the rest of the coverage code.</p><p>The remaining recommendations follow this pattern: the Safety-Critical Rust Consortium can help the community organize requirements and drive work, with the Rust Project providing the deep technical knowledge of Rust Project artifacts needed for successful collaboration. The path works when both sides show up.</p><p><strong>Establish ecosystem-wide MSRV conventions.</strong> The dependency drift problem is real: teams pin their Rust toolchain for stability, but crates targeting the latest compiler make this difficult to sustain. An LTS release scheme, combined with encouraging libraries to maintain MSRV compatibility with LTS releases, could reduce this friction. This would require coordination between the Rust Project (potentially the release team) and the broader ecosystem, with the Safety-Critical Rust Consortium helping to articulate requirements and adoption patterns.</p><p><strong>Turn \"target tier policy\" into a safety-critical onramp.</strong> The friction we heard is not about the policy being unclear, it is about translating \"tier\" into practical decisions. A short, target-focused readiness checklist would help: Which targets exist? Which ones are  only? What is the last known tested OS version? What are the top blockers? The raw ingredients exist in rustc docs, release notes, and issue trackers, but pulling them together in one place would lower the barrier. Clearer, consolidated information also makes it easier for teams who depend on specific targets to contribute to maintaining them. The Safety-Critical Rust Consortium could lead this effort, working with compiler team members and platform maintainers to keep the information accurate.</p><p><strong>Document \"dependency lifecycle\" patterns teams are already using.</strong> The QM story is often: use crates early, track carefully, shrink dependencies for higher-criticality parts. The ASIL B+ story is often: avoid third-party crates entirely, or use abstraction layers and plan to replace later. Turning those patterns into a reusable playbook would help new teams make the same moves with less trial and error. This seems like a natural fit for the Safety-Critical Rust Consortium's liaison work.</p><p><strong>Define requirements for a safety-case friendly async runtime.</strong> Teams adopting async in safety-critical contexts need runtimes with appropriate quality and process artifacts for standards like ISO 26262. Work is already happening in this space. The Safety-Critical Rust Consortium could lead the effort to define what \"safety-case friendly\" means in concrete terms, working with the async working group and libs team on technical feasibility and design.</p><p><strong>Treat interop as part of the safety story.</strong> Many teams are not going to rewrite their world in Rust. They are going to integrate Rust into existing C and C++ systems and carry that boundary for years. Guidance and tooling to keep interfaces correct, auditable, and in sync would help. The compiler team and lang team could consider how FFI boundaries are surfaced and checked, informed by requirements gathered through the Safety-Critical Rust Consortium.</p><blockquote><p>\"We rely very heavily on FFI compatibility between C, C++, and Rust. In a safety-critical space, that's where the difficulty ends up being, generating bindings, finding out what the problem was.\" -- Embedded systems engineer (mobile robotics)</p></blockquote><p>To sum up the main points in this post:</p><ul><li>Rust is already deployed in production for safety-critical systems, including mobile robotics (IEC 61508 SIL 2) and medical devices (IEC 62304 Class B). The path exists.</li><li>Rust's defaults (memory safety, thread safety, strong typing) map directly to much of what Functional Safety Engineers spend their time preventing. But ecosystem support thins out as you move toward higher-criticality software.</li><li>At low criticality (QM), teams use crates freely and harden later. At higher levels (ASIL B+), third-party dependencies become difficult to justify, and teams rewrite, internalize, or build abstraction layers for future replacement.</li><li>The compiler is doing work that used to require external tools and manual review. Much of what was historically process-based enforcement through standards like MISRA C and CERT C becomes a language-level concern, checked by the compiler. That can scale better than \"review harder\" for long-lived products with large teams and supports engineers in these domains feeling more secure in the systems they ship.</li><li>Stability is operational: teams need to explain what upgrades change, manage dependency drift, and map target tier policies to their platform reality.</li><li>Async is appealing for middleware and event-driven systems, but the runtime and qualification story is not settled for higher-criticality use.</li></ul><p>We make six recommendations: find ways to help the safety-critical community support their own needs, establish ecosystem-wide MSRV conventions, create target-focused readiness checklists, document dependency lifecycle patterns, define requirements for safety-case friendly async runtimes, and treat C/C++ interop as part of the safety story.</p><p>Hearing concrete constraints, examples of assessor feedback, and what \"evidence\" actually looks like in practice is incredibly helpful. The goal is to make Rust's strengths more accessible in environments where correctness and safety are not optional.</p>",
      "contentLength": 18462,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Python 3.15.0 alpha 4",
      "url": "https://pythoninsider.blogspot.com/2026/01/python-3150-alpha-4.html",
      "date": 1768335840,
      "author": "Hugo",
      "guid": 35960,
      "unread": true,
      "content": "<i>Edit: This 3.15.0a4 was accidentally built against `main` from 2025-12-23 instead of 2026-01-13, so <a href=\"https://discuss.python.org/t/python-3-15-0-alpha-5-yes-another-alpha/105721/1\">3.15.0a5</a> is an extra release correctly built against 2026-01-14.</i><p><strong>This is an early developer preview of Python\n3.15</strong></p><p>Python 3.15 is still in development. This release, 3.15.0a4, is the\nfourth of seven planned alpha releases.</p><p>Alpha releases are intended to make it easier to test the current\nstate of new features and bug fixes and to test the release process.</p><p>During the alpha phase, features may be added up until the start of\nthe beta phase (2026-05-05) and, if necessary, may be modified or\ndeleted up until the release candidate phase (2026-07-28). Please keep\nin mind that this is a preview release and its use is\n recommended for production environments.</p><p>Many new features for Python 3.15 are still being planned and\nwritten. Among the new major new features and changes so far:</p><ul><li><a href=\"https://docs.python.org/3.15/whatsnew/3.15.html#whatsnew315-sampling-profiler\">PEP\n799</a>: A new high-frequency, low-overhead, statistical sampling\nprofiler and dedicated profiling package</li><li><a href=\"https://docs.python.org/3.15/whatsnew/3.15.html#whatsnew315-utf8-default\">PEP\n686</a>: Python now uses UTF-8 as the default encoding</li><li><a href=\"https://docs.python.org/3.15/whatsnew/3.15.html#whatsnew315-pep782\">PEP\n782</a>: A new  C API to create a Python bytes\nobject</li><li>The <a href=\"https://docs.python.org/3.15/whatsnew/3.15.html#whatsnew315-jit\">JIT\ncompiler</a> has been significantly upgraded, with 3-4% geometric mean\nperformance improvement on x86-64 Linux over the standard interpreter,\nand 7-8% speedup on AArch64 macOS over the tail-calling interpreter</li><li><small>(Hey,  if a feature\nyou find important is missing from this list, let Hugo\nknow.)</small></li></ul><p>The next pre-release of Python 3.15 will be 3.15.0a5, currently\nscheduled for 2026-02-10.</p><blockquote><p>Upon this every soul was confounded; for the phenomenon just then\nobserved by Ahab had unaccountably escaped every one else; but its very\nblinding palpableness must have been the cause.</p><p>Thrusting his head half way into the binnacle, Ahab caught one\nglimpse of the compasses; his uplifted arm slowly fell; for a moment he\nalmost seemed to stagger. Standing behind him Starbuck looked, and lo!\nthe two compasses pointed East, and the Pequod was as infallibly going\nWest.</p><p>But ere the first wild alarm could get out abroad among the crew, the\nold man with a rigid laugh exclaimed, “I have it! It has happened\nbefore. Mr.&nbsp;Starbuck, last night’s thunder turned our compasses—that’s\nall. Thou hast before now heard of such a thing, I take it.”</p><p>“Aye; but never before has it happened to me, sir,” said the pale\nmate, gloomily.</p></blockquote><p>Thanks to all of the many volunteers who help make Python Development\nand these releases possible! Please consider supporting our efforts by\nvolunteering yourself or through organisation contributions to the <a href=\"https://www.python.org/psf/donations/\">Python Software\nFoundation</a>.</p><p>Regards from a snowfully subzero Helsinki,</p><p>Your release team,\n  Hugo van Kemenade\n  Steve Dower\n  </p>",
      "contentLength": 2635,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Kubernetes v1.35: Restricting executables invoked by kubeconfigs via exec plugin allowList added to kuberc",
      "url": "https://kubernetes.io/blog/2026/01/09/kubernetes-v1-35-kuberc-credential-plugin-allowlist/",
      "date": 1767983400,
      "author": "",
      "guid": 36409,
      "unread": true,
      "content": "<p>Did you know that  can run arbitrary executables, including shell\nscripts, with the full privileges of the invoking user, and without your\nknowledge? Whenever you download or auto-generate a , the\n field can specify an executable to fetch credentials on\nyour behalf. Don't get me wrong, this is an incredible feature that allows you\nto authenticate to the cluster with external identity providers. Nevertheless,\nyou probably see the problem: Do you know exactly what executables your \nis running on your system? Do you trust the pipeline that generated your ?\nIf there has been a supply-chain attack on the code that generates the kubeconfig,\nor if the generating pipeline has been compromised, an attacker might well be\ndoing unsavory things to your machine by tricking your  into running\narbitrary code.</p><p>To give the user more control over what gets run on their system, <a href=\"https://git.k8s.io/community/sig-auth\">SIG-Auth</a> and <a href=\"https://git.k8s.io/community/sig-cli\">SIG-CLI</a> added the credential plugin policy and allowlist as a beta feature to\nKubernetes 1.35. This is available to all clients using the  library,\nby filling out the <a href=\"https://github.com/kubernetes/client-go/blob/master/tools/clientcmd/api/types.go#L290\">ExecProvider.PluginPolicy</a> struct on a REST config. To\nbroaden the impact of this change, Kubernetes v1.35 also lets you manage this without\nwriting a line of application code. You can configure  to enforce\nthe policy and allowlist by adding two fields to the  configuration\nfile:  and <code>credentialPluginAllowlist</code>. Adding one or\nboth of these fields restricts which credential plugins  is allowed to execute.</p><p>A full description of this functionality is available in our <a href=\"https://kubernetes.io/docs/reference/kubectl/kuberc/\">official documentation</a> for kuberc,\nbut this blog post will give a brief overview of the new security knobs. The new\nfeatures are in beta and available without using any feature gates.</p><p>The following example is the simplest one: simply don't specify the new fields.</p><div><pre tabindex=\"0\"><code data-lang=\"yaml\"></code></pre></div><p>This will keep  acting as it always has, and all plugins will be\nallowed.</p><p>The next example is functionally identical, but it is more explicit and\ntherefore preferred if it's actually what you want:</p><div><pre tabindex=\"0\"><code data-lang=\"yaml\"></code></pre></div><p>If you  whether or not you're using exec credential plugins, try\nsetting your policy to :</p><div><pre tabindex=\"0\"><code data-lang=\"yaml\"></code></pre></div><p>If you  using credential plugins, you'll quickly find out what  is\ntrying to execute. You'll get an error like the following.</p><blockquote><p>Unable to connect to the server: getting credentials: plugin \"cloudco-login\" not allowed: policy set to \"DenyAll\"</p></blockquote><p>If there is insufficient information for you to debug the issue, increase the\nlogging verbosity when you run your next command. For example:</p><div><pre tabindex=\"0\"><code data-lang=\"bash\"></code></pre></div><h3>Selectively allowing plugins</h3><p>What if you need the  plugin to do your daily work? That is why\nthere's a third option for your policy, . To allow a specific plugin,\nset the policy and add the <code>credentialPluginAllowlist</code>:</p><div><pre tabindex=\"0\"><code data-lang=\"yaml\"></code></pre></div><p>You'll notice that there are two entries in the allowlist. One of them is\nspecified by full path, and the other,  is just a basename. When\nyou specify just the basename, the full path will be looked up using\n, which does not expand globbing or handle wildcards.\nGlobbing is not supported at this time. Both forms\n(basename and full path) are acceptable, but the full path is preferable because\nit narrows the scope of allowed binaries even further.</p><p>Currently, an allowlist entry has only one field, . In the future, we\n(Kubernetes SIG CLI) want to see other requirements added. One idea that seems\nuseful is checksum verification whereby, for example, a binary would only be allowed\nto run if it has the sha256 sum\n<code>b9a3fad00d848ff31960c44ebb5f8b92032dc085020f857c98e32a5d5900ff9c</code>\nexists at the path .</p><p>Another possibility is only allowing binaries that have been signed by one of a\nset of a trusted signing keys.</p><p>The credential plugin policy is still under development and we are very interested\nin your feedback. We'd love to hear what you like about it and what problems\nyou'd like to see it solve. Or, if you have the cycles to contribute one of the\nabove enhancements, they'd be a great way to get started contributing to\nKubernetes. Feel free to join in the discussion on slack:</p>",
      "contentLength": 3936,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Kubernetes v1.35: Mutable PersistentVolume Node Affinity (alpha)",
      "url": "https://kubernetes.io/blog/2026/01/08/kubernetes-v1-35-mutable-pv-nodeaffinity/",
      "date": 1767897000,
      "author": "",
      "guid": 36408,
      "unread": true,
      "content": "<p>The PersistentVolume <a href=\"https://kubernetes.io/docs/concepts/storage/persistent-volumes/#node-affinity\">node affinity</a> API\ndates back to Kubernetes v1.10.\nIt is widely used to express that volumes may not be equally accessible by all nodes in the cluster.\nThis field was previously immutable,\nand it is now mutable in Kubernetes v1.35 (alpha). This change opens a door to more flexible online volume management.</p><h2>Why make node affinity mutable?</h2><p>This raises an obvious question: why make node affinity mutable now?\nWhile stateless workloads like Deployments can be changed freely\nand the changes will be rolled out automatically by re-creating every Pod,\nPersistentVolumes (PVs) are stateful and cannot be re-created easily without losing data.</p><p>However, Storage providers evolve and storage requirements change.\nMost notably, multiple providers are offering regional disks now.\nSome of them even support live migration from zonal to regional disks, without disrupting the workloads.\nThis change can be expressed through the\n<a href=\"https://kubernetes.io/docs/concepts/storage/volume-attributes-classes/\">VolumeAttributesClass</a> API,\nwhich recently graduated to GA in 1.34.\nHowever, even if the volume is migrated to regional storage,\nKubernetes still prevents scheduling Pods to other zones because of the node affinity recorded in the PV object.\nIn this case, you may want to change the PV node affinity from:</p><div><pre tabindex=\"0\"><code data-lang=\"yaml\"></code></pre></div><div><pre tabindex=\"0\"><code data-lang=\"yaml\"></code></pre></div><p>As another example, providers sometimes offer new generations of disks.\nNew disks cannot always be attached to older nodes in the cluster.\nThis accessibility can also be expressed through PV node affinity and ensures the Pods can be scheduled to the right nodes.\nBut when the disk is upgraded, new Pods using this disk can still be scheduled to older nodes.\nTo prevent this, you may want to change the PV node affinity from:</p><div><pre tabindex=\"0\"><code data-lang=\"yaml\"></code></pre></div><div><pre tabindex=\"0\"><code data-lang=\"yaml\"></code></pre></div><p>So, it is mutable now, a first step towards a more flexible online volume management.\nWhile it is a simple change that removes one validation from the API server,\nwe still have a long way to go to integrate well with the Kubernetes ecosystem.</p><p>This feature is for you if you are a Kubernetes cluster administrator,\nand your storage provider allows online update that you want to utilize,\nbut those updates can affect the accessibility of the volume.</p><p>Note that changing PV node affinity alone will not actually change the accessibility of the underlying volume.\nBefore using this feature,\nyou must first update the underlying volume in the storage provider,\nand understand which nodes can access the volume after the update.\nYou can then enable this feature and keep the PV node affinity in sync.</p><p>Currently, this feature is in alpha state.\nIt is disabled by default, and may subject to change.\nTo try it out, enable the  feature gate on APIServer, then you can edit the PV  field.\nTypically only administrators can edit PVs, please make sure you have the right RBAC permissions.</p><h3>Race condition between updating and scheduling</h3><p>There are only a few factors outside of a Pod that can affect the scheduling decision, and PV node affinity is one of them.\nIt is fine to allow more nodes to access the volume by relaxing node affinity,\nbut there is a race condition when you try to tighten node affinity:\nit is unclear how the Scheduler will see the modified PV in its cache,\nso there is a small window where the scheduler may place a Pod on an old node that can no longer access the volume.\nIn this case, the Pod will stuck at  state.</p><p>One mitigation currently under discussion is for the kubelet to fail Pod startup if the PersistentVolume’s node affinity is violated.\nThis has not landed yet.\nSo if you are trying this out now, please watch subsequent Pods that use the updated PV,\nand make sure they are scheduled onto nodes that can access the volume.\nIf you update PV and immediately start new Pods in a script, it may not work as intended.</p><h2>Future integration with CSI (Container Storage Interface)</h2><p>Currently, it is up to the cluster administrator to modify both PV's node affinity and the underlying volume in the storage provider.\nBut manual operations are error-prone and time-consuming.\nIt is preferred to eventually integrate this with VolumeAttributesClass,\nso that an unprivileged user can modify their PersistentVolumeClaim (PVC) to trigger storage-side updates,\nand PV node affinity is updated automatically when appropriate, without the need for cluster admin's intervention.</p><p>As noted earlier, this is only a first step.</p><p>If you are a Kubernetes user,\nwe would like to learn how you use (or will use) PV node affinity.\nIs it beneficial to update it online in your case?</p><p>If you are a CSI driver developer,\nwould you be willing to implement this feature? How would you like the API to look?</p><p>Please provide your feedback via:</p><p>For any inquiries or specific questions related to this feature, please reach out to the <a href=\"https://github.com/kubernetes/community/tree/master/sig-storage\">SIG Storage community</a>.</p>",
      "contentLength": 4691,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "Kubernetes v1.35: A Better Way to Pass Service Account Tokens to CSI Drivers",
      "url": "https://kubernetes.io/blog/2026/01/07/kubernetes-v1-35-csi-sa-tokens-secrets-field-beta/",
      "date": 1767810600,
      "author": "",
      "guid": 36407,
      "unread": true,
      "content": "<p>If you maintain a CSI driver that uses service account tokens,\nKubernetes v1.35 brings a refinement you'll want to know about.\nSince the introduction of the <a href=\"https://kubernetes-csi.github.io/docs/token-requests.html\">TokenRequests feature</a>,\nservice account tokens requested by CSI drivers have been passed to them through the  field.\nWhile this has worked, it's not the ideal place for sensitive information,\nand we've seen instances where tokens were accidentally logged in CSI drivers.</p><p>Kubernetes v1.35 introduces a beta solution to address this:\n<em>CSI Driver Opt-in for Service Account Tokens via Secrets Field</em>.\nThis allows CSI drivers to receive service account tokens\nthrough the  field in ,\nwhich is the appropriate place for sensitive data in the CSI specification.</p><h2>Understanding the existing approach</h2><p>When CSI drivers use the <a href=\"https://kubernetes-csi.github.io/docs/token-requests.html\">TokenRequests feature</a>,\nthey can request service account tokens for workload identity\nby configuring the  field in the CSIDriver spec.\nThese tokens are passed to drivers as part of the volume attributes map,\nusing the key <code>csi.storage.k8s.io/serviceAccount.tokens</code>.</p><p>The  field works, but it's not designed for sensitive data.\nBecause of this, there are a few challenges:</p><p>First, the <a href=\"https://github.com/kubernetes-csi/csi-lib-utils/tree/master/protosanitizer\"></a> tool that CSI drivers use doesn't treat volume context as sensitive,\nso service account tokens can end up in logs when gRPC requests are logged.\nThis happened with <a href=\"https://github.com/kubernetes-sigs/secrets-store-csi-driver/security/advisories/GHSA-g82w-58jf-gcxx\">CVE-2023-2878</a> in the Secrets Store CSI Driver\nand <a href=\"https://github.com/kubernetes/kubernetes/issues/124759\">CVE-2024-3744</a> in the Azure File CSI Driver.</p><p>Second, each CSI driver that wants to avoid this issue needs to implement its own sanitization logic,\nwhich leads to inconsistency across drivers.</p><p>The CSI specification already has a  field in \nthat's designed exactly for this kind of sensitive information.\nThe challenge is that we can't just change where we put the tokens\nwithout breaking existing CSI drivers that expect them in volume context.</p><h2>How the opt-in mechanism works</h2><p>Kubernetes v1.35 introduces an opt-in mechanism that lets CSI drivers choose\nhow they receive service account tokens.\nThis way, existing drivers continue working as they do today,\nand drivers can move to the more appropriate secrets field when they're ready.</p><p>CSI drivers can set a new field in their CSIDriver spec:</p><div><pre tabindex=\"0\"><code data-lang=\"yaml\"></code></pre></div><p>The behavior depends on the <code>serviceAccountTokenInSecrets</code> field:</p><p>When set to  (the default), tokens are placed in  with the key <code>csi.storage.k8s.io/serviceAccount.tokens</code>, just like today.\nWhen set to , tokens are placed only in the  field with the same key.</p><p>The <code>CSIServiceAccountTokenSecrets</code> feature gate is enabled by default\non both kubelet and kube-apiserver.\nSince the <code>serviceAccountTokenInSecrets</code> field defaults to ,\nenabling the feature gate doesn't change any existing behavior.\nAll drivers continue receiving tokens via volume context unless they explicitly opt in.\nThis is why we felt comfortable starting at beta rather than alpha.</p><h2>Guide for CSI driver authors</h2><p>If you maintain a CSI driver that uses service account tokens, here's how to adopt this feature.</p><p>First, update your driver code to check both locations for tokens.\nThis makes your driver compatible with both the old and new approaches:</p><div><pre tabindex=\"0\"><code data-lang=\"go\"></code></pre></div><p>This fallback logic is backward compatible and safe to ship in any driver version,\neven before clusters upgrade to v1.35.</p><p>CSI driver authors need to follow a specific sequence when adopting this feature to avoid breaking existing volumes.</p><p> (can happen anytime)</p><p>You can start preparing your driver right away by adding fallback logic that checks both the secrets field and volume context for tokens.\nThis code change is backward compatible and safe to ship in any driver version, even before clusters upgrade to v1.35.\nWe encourage you to add this fallback logic early, cut releases, and even backport to maintenance branches where feasible.</p><p><strong>Cluster upgrade and feature enablement</strong></p><p>Once your driver has the fallback logic deployed, here's the safe rollout order for enabling the feature in a cluster:</p><ol><li>Complete the kube-apiserver upgrade to 1.35 or later</li><li>Complete kubelet upgrade to 1.35 or later on all nodes</li><li>Ensure CSI driver version with fallback logic is deployed (if not already done in preparation phase)</li><li>Fully complete CSI driver DaemonSet rollout across all nodes</li><li>Update your CSIDriver manifest to set <code>serviceAccountTokenInSecrets: true</code></li></ol><p>The most important thing to remember is timing.\nIf your CSI driver DaemonSet and CSIDriver object are in the same manifest or Helm chart,\nyou need two separate updates.\nDeploy the new driver version with fallback logic first,\nwait for the DaemonSet rollout to complete,\nthen update the CSIDriver spec to set <code>serviceAccountTokenInSecrets: true</code>.</p><p>Also, don't update the CSIDriver before all driver pods have rolled out.\nIf you do, volume mounts will fail on nodes still running the old driver version,\nsince those pods only check volume context.</p><p>Adopting this feature helps in a few ways:</p><ul><li>It eliminates the risk of accidentally logging service account tokens as part of volume context in gRPC requests</li><li>It uses the CSI specification's designated field for sensitive data, which feels right</li><li>The  tool automatically handles the secrets field correctly, so you don't need driver-specific workarounds</li><li>It's opt-in, so you can migrate at your own pace without breaking existing deployments</li></ul><p>We (Kubernetes SIG Storage) encourage CSI driver authors to adopt this feature and provide feedback\non the migration experience.\nIf you have thoughts on the API design or run into any issues during adoption,\nplease reach out to us on the\n<a href=\"https://kubernetes.slack.com/archives/C8EJ01Z46\">#csi</a> channel on Kubernetes Slack\n(for an invitation, visit <a href=\"https://slack.k8s.io/\">https://slack.k8s.io/</a>).</p><p>You can follow along on\n<a href=\"https://kep.k8s.io/5538\">KEP-5538</a>\nto track progress across the coming Kubernetes releases.</p>",
      "contentLength": 5556,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    }
  ],
  "tags": [
    "dev"
  ]
}