{
  "id": "Y2iXpRRkNSnx4gcGxbb6SwAw8J6WgRYKhY86enVhyDx91",
  "title": "Terminal Trove Newly Added Tools",
  "displayTitle": "Terminal Tools",
  "url": "https://terminaltrove.com/new.xml",
  "feedLink": "https://terminaltrove.com/",
  "isQuery": false,
  "isEmpty": false,
  "isHidden": false,
  "itemCount": 18,
  "items": [
    {
      "title": "eilmeldung",
      "url": "https://terminaltrove.com/feed/eilmeldung/",
      "date": 1771977600,
      "author": "Curator",
      "guid": 49309,
      "unread": true,
      "content": "<p>eilmeldung is a TUI RSS reader which supports many RSS providers.</p><p>You can filter and search articles using a small query language, tag items and bulk tag by query, and switch into a focus mode that hides everything except the article text. It also supports many RSS providers, keeps sane defaults but stays configurable. Under the hood it keeps feed state in sync, so refreshes do not block while new items arrive.</p><div><article dir=\"auto\" tabindex=\"-1\" data-turn-id=\"request-WEB:269624e1-534d-45e6-97ee-6941b7f1ea7d-4\" data-testid=\"conversation-turn-2\" data-scroll-anchor=\"true\" data-turn=\"assistant\"></article></div>",
      "contentLength": 413,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "chatuino",
      "url": "https://terminaltrove.com/feed/chatuino/",
      "date": 1771977600,
      "author": "Curator",
      "guid": 49310,
      "unread": true,
      "content": "<p>chatuino is a cross-platform, feature-rich TUI Twitch chat client, allowing you to manage multiple accounts and participate in multiple chat rooms simultaneously.&nbsp;</p><p>It Includes Twitch moderation tools, poll viewing, stream markers, and clip creation. Supports third-party emote providers: 7TV, BTTV, and FFZ. Graphical emote display for Kitty-compatible terminals.</p><p>You can also manage multiple Twitch accounts and chat rooms in a single terminal session. This tool also has local message logging, user chat history, custom commands, custom themes, and self-hostable server.</p><p>Ideal for chat moderators and users active in multiple chats for extended sessions and it is available on Linux, macOS, and Windows.</p>",
      "contentLength": 703,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "hardcover-tui",
      "url": "https://terminaltrove.com/feed/hardcover-tui/",
      "date": 1771977600,
      "author": "Curator",
      "guid": 49311,
      "unread": true,
      "content": "<p>hardcover-tui is an unofficial terminal user interface (TUI) client for Hardcover. It allows you to browse your library, track reading progress, manage shelves, and update your books from the terminal.</p><p>This tool has 4 tabs in its TUI interface, 'Home' where you can see an overview of your Hardcover activity, progress and book library for each of your saved books, 'Search' which allows you to search and find books on Hardcover, 'Lists' which categorizes books as private or public lists, and 'Stats' shows your reading stats by displaying charts, how much hardcovers, audiobooks and ebooks you've read, goals, and top genres.</p><p>A personal API key is needed to connect your account. Once connected, hardcover-tui can display your saved books such as author, series, and ratings. You can also select the status of the book, write a journal entry and follow other reading activity from other accounts in the TUI.</p><p>hardcover-tui is for book readers who want to effortlessly update and maintain their reading progress, manage lists, write reviews and keep a reading journal from the terminal itself.</p>",
      "contentLength": 1091,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "ralph-tui",
      "url": "https://terminaltrove.com/feed/ralph-tui/",
      "date": 1771977600,
      "author": "Curator",
      "guid": 49312,
      "unread": true,
      "content": "<p>ralph-tui is a terminal tool that works through a defined list of tasks and orchestrates AI agents to work though them.</p><p>It reads through tasks using a PRD document (product requirements document) in a JSON format i.e. a prd.json, picks the highest priority item, builds prompts, runs your chosen agent, and checks for completion each iteration. It supports <a href=\"https://terminaltrove.com/claude-code/\" target=\"_blank\" rel=\"noopener\">Claude Code</a>, <a href=\"https://terminaltrove.com/feed/ralph-tui/gemini-cli\" target=\"_blank\" rel=\"noopener\">Gemini CLI</a>, <a href=\"https://terminaltrove.com/codex/\" target=\"_blank\" rel=\"noopener\">Codex</a> and more, plus it is able pause and resume after crashes, saves logs per iteration, and has progress tracking across tasks.</p><p>Other features of ralph-tui are an interactive setup wizard, PRD creation with chat mode, conversion between tracker formats, prompt template viewing, and plugin listings for agents and trackers. Remote control is built in, with a listener mode, secure token based auth, remote add and test commands, and config push to multiple machines.</p><p>This tool works best for vibecoders, developers and maintainers who want repeatable agent runs on repos, especially when tackling many small fixes or refactors.</p>",
      "contentLength": 1008,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "lazykiq",
      "url": "https://terminaltrove.com/feed/lazykiq/",
      "date": 1771977600,
      "author": "Curator",
      "guid": 49313,
      "unread": true,
      "content": "<p>lazykiq is a TUI tool for inspecting Sidekiq activity in the terminal.</p><p>It connects via Redis to show Sidekiq processes, running jobs and has several properties such as queue contents, job lists and error backtraces. You can see which jobs that have been retried, busy or have been scheduled, and it gives error breakdowns and execution metrics in the TUI interface.&nbsp;</p><p>lazykiq also has keyboard shortcuts for vim style navigation, paging and list filtering, and quick view switching between dashboards, queues, and metrics. Job details include payload, timestamps, retry counts, and exception traces, and it supports nerd fonts.</p><p>This tool works best for Ruby and Rails developers, Backend Engineers, SREs, and DevOps engineers when diagnosing stuck workers, rising retries, or noisy failures during deploys, production incidents, or staging smoke tests.</p>",
      "contentLength": 849,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "mcdu",
      "url": "https://terminaltrove.com/feed/mcdu/",
      "date": 1771977600,
      "author": "Curator",
      "guid": 49314,
      "unread": true,
      "content": "<p>mcdu is a fast, modern disk usage analyzer and developer cleanup tool.</p><p>It scans disks and then sorts directories by size, so you can spot large files fast, and it tags sizes for quick reading. It has color-coded disk usage with vim-style navigation and also searches for build artifacts and caches across 18 plus ecosystems, which helps reclaim space from toolchains and package managers.&nbsp;</p><p>On macOS it detects orphaned app data left behind in the ~/Library folder. For deletion it supports dry runs, double confirmation, and JSON audit logs. It can also target common directories that have a collection of large files such like node_modules, cargo target, and old Docker build leftovers.</p><p>Ideal for developers whose need to clean up large files such as build artifacts, package caches, and old project leftovers, mcdi is useful when you need to reclaim disk space or clean up disk space on your machine over time.</p>",
      "contentLength": 910,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "climp",
      "url": "https://terminaltrove.com/feed/climp/",
      "date": 1771372800,
      "author": "Curator",
      "guid": 49303,
      "unread": true,
      "content": "<p>climp is a minimalist command line audio player that runs in the terminal.</p><p>It focuses on keyboard controls for playback, plays local files and folders as playlists, and also handles stream URLs through&nbsp;<a href=\"https://terminaltrove.com/yt-dlp/\" target=\"_blank\" rel=\"noopener\">yt-dlp</a> (Required) for sources like YouTube. You can queue tracks, seek, change volume and toggle repeat or shuffle without the need to use a browser.</p><p>It can save audio from a stream to a file, and also shows rich terminal visualizers such as matrix, spectrum or waveform. Optional settings cover key bindings, default player backends, and metadata display.</p><p>This tool is for those who want to listen to music while coding, are in terminal heavy setups or those that generally go for minimalist music players that run in the terminal. It is also useful when you need a music player that features quick playback, a queue, and visual feedback with lots of creative visualizations playing with the background.</p>",
      "contentLength": 904,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "ec",
      "url": "https://terminaltrove.com/feed/ec/",
      "date": 1771372800,
      "author": "Curator",
      "guid": 49304,
      "unread": true,
      "content": "<p>ec is a terminal merge-conflict helper that focuses on resolving git conflicts file by file.</p><p>It uses a three-way comparison between base, ours, and theirs, so you can see what changed on each side and build a result. You can pick whole sections from either side, copy lines across, and write the merged file back in place safely. It can also step through every conflicted file in a repo and run as a git mergetool.</p><p>This tool includes an optional diff3 output when base is available, non-interactive modes for scripts, backups of merged files, and a \"list conflicts\" mode when you run it with no args. There’s also a <a href=\"https://terminaltrove.com/neovim/\" target=\"_blank\" rel=\"noopener\">neovim</a> plugin to launch it in a terminal buffer.</p><p>ec works best for developers working with in long rebases, merges, and cherry-picks who want a repeatable way to clear conflicts without leaving the terminal.</p>",
      "contentLength": 822,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "datui",
      "url": "https://terminaltrove.com/feed/datui/",
      "date": 1771372800,
      "author": "Curator",
      "guid": 49305,
      "unread": true,
      "content": "<p>datui is a terminal tool for inspecting datasets and running quick checks on tables with a TUI interface.</p><p>It reads Parquet, CSV, JSON, NDJSON, Avro, Arrow, ORC, and Excel, and it can load data from local files, S3, or HTTP. You can sort, filter, group, pivot, and reshape columns, then run SQL or an SQL-like DSL to slice results. In addition, it computes basic stats and renders charts in the terminal.&nbsp;</p><p>Other features of datui are exporting of query results, chart export as images, correlation checks, support for hive-partitioned folders, and keybindings.</p><p>This tool is useful for analysts, data engineers, and students who need to check datasets small or large, locally or via remote storage in the terminal.</p>",
      "contentLength": 710,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "perch",
      "url": "https://terminaltrove.com/feed/perch/",
      "date": 1771372800,
      "author": "Curator",
      "guid": 49306,
      "unread": true,
      "content": "<p>perch is a terminal client for Mastodon and Bluesky, built for reading and posting to social media in the terminal.</p><p>You can read timelines, write, reply, like, and repost or boost posts, plus cross-post the same text to multiple networks. It also handles media attachments, drafts, scheduled posts, and has CLI commands for posting and fetching timelines. Credentials go into your system keyring.</p><p>perch also has an&nbsp;SQLite cache for offline reading, filters per network, desktop notifications for mentions, keybindings and built-in themes. It can keep multiple accounts ready, so switching is quick.</p><p>This tool works best for developers, writers, and those who use the terminal often and want to keep up with Mastodon or Bluesky during short work breaks, coding sessions or discreetly in the terminal.&nbsp;</p>",
      "contentLength": 799,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "monitui",
      "url": "https://terminaltrove.com/feed/monitui/",
      "date": 1771372800,
      "author": "Curator",
      "guid": 49307,
      "unread": true,
      "content": "<p>monitui is a terminal tool for managing hyprland monitor layouts without hand editing config files.</p><p>The TUI lets you place displays, snap them to edges, and tweak resolution, scale, and rotation. You can save presets for desk, dock, or travel setups, then switch presets quickly and preview changes before applying them. Additionally, it assigns workspaces to monitors, warns if there are config changes outside the tool, and keeps a short confirmation window to prevent bad layouts.</p><p>This tool also has mouse drag support, commands to list or apply presets, enabling or disabling toggles per monitor, and shortcuts for common resolutions. It can cycle orientations and restore previous workspace placement when loading a preset.</p><p>monitui works well for Linux and hyprland users with multi-monitor rigs who dock and undock, rotate a screen for coding, or swap between work and gaming setups. It is also useful for those who want to quickly configure their display settings in the terminal.</p>",
      "contentLength": 984,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "dealve-tui",
      "url": "https://terminaltrove.com/feed/dealve-tui/",
      "date": 1771372800,
      "author": "Curator",
      "guid": 49308,
      "unread": true,
      "content": "<p>dealve-tui is a terminal tool for browsing PC game discounts across many online game storefronts.</p><p>It pulls pricing from IsThereAnyDeal (API key required) and lists deals from 20+ online game stores, including Steam, GOG, Humble, and Epic Games Store. You can search titles, sort by discount, price, or popularity, and compare where the cheapest game deal or direct buy sits today. Also, it shows historical pricing and simple price charts to spot pricing deals.</p><p>Other features of dealve-tui are store and deal-type filters, region-aware pricing, per-game details such as current price and sale percentage, and a config file for further customization.</p><p>This tool&nbsp;is useful for PC gamers, gift buyers, and those who want game price comparisons across multiple games stores. It is extra useful if you want to quickly compare prices without opening multiple tabs with a browser, when you can instead compare game deals quickly by using the terminal.</p>",
      "contentLength": 942,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "whosthere",
      "url": "https://terminaltrove.com/feed/whosthere/",
      "date": 1770768000,
      "author": "Curator",
      "guid": 49297,
      "unread": true,
      "content": "<p>whosthere is a local area network (LAN) discovery tool that scans your LAN and summarizes every device it can spot, directly in real time in the terminal.</p><p>This tool uses multiple methods concurrently to find devices on your LAN. It performs mDNS and SSDP probes to discover network services. It is able to scan the local network without needing root privileges, and it even shows the manufacturer information by looking up MAC addresses.</p><p>Other features of whosthere include running in the background, a HTTP API, keybindings, optional port scanning on a discovered device, and a configuration file for making functional changes to whosthere. You can change the scan ranges, scan intervals, TCP ports to scan, timeouts, and the interface itself as it supports different themes.</p><p>This tool is helpful for network engineers, sysadmins and those with homelabs. It works best if you need to identify a device's IP in your LAN, check open ports on a device, or to get a holistic view of all devices in your local network.</p>",
      "contentLength": 1011,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "xfr",
      "url": "https://terminaltrove.com/feed/xfr/",
      "date": 1770768000,
      "author": "Curator",
      "guid": 49298,
      "unread": true,
      "content": "<p>xfr is a terminal network throughput testing tool, built to measure bandwidth between hosts and report results in real time during a run.</p><p>It runs TCP, UDP and QUIC, and also tunes bitrate, duration, interval, and parallel streams. The server handles multiple clients at once, and keeps TCP on only a single port. It supports reverse and bidirectional tests, firewalls, outputs to plain text, JSON, JSON streaming or CSV, and also can compare past runs.&nbsp;</p><p>This tool also has a LAN discovery feature to find local servers, plus optional Prometheus metrics, themes, keyboard bindings and update notifications as a way to prompt you to update the program when needed.</p><p>For network engineers, SREs or those who need to diagnose slow paths or compare transports, xfr is useful for network heavy use cases, such as testing data center networks, VPN testing and network benchmarking where repeatable bandwidth numbers matter.</p>",
      "contentLength": 913,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "hazelnut",
      "url": "https://terminaltrove.com/feed/hazelnut/",
      "date": 1770768000,
      "author": "Curator",
      "guid": 49299,
      "unread": true,
      "content": "<p>hazelnut is a terminal file organizer inspired by Hazel that watches folders and applies rules to new or changed files.</p><p>It watches multiple paths with optional recursion and debouncing. It also matches files by glob or regex names, extension lists, size thresholds, and modification age. Rules can move, copy, rename with date and filename tokens, trash or delete, plus it can archive files or run commands. This tool can run in the background that applies rules 24/7, keeps an activity log, and can send error notifications.</p><p>Ideal for developers and busy desktop users who want downloads, screenshots and invoices sorted, or old temporary files cleared, hazelnut helps to keep your files organized while staying in the terminal.</p>",
      "contentLength": 727,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "zerobrew",
      "url": "https://terminaltrove.com/feed/zerobrew/",
      "date": 1770768000,
      "author": "Curator",
      "guid": 49300,
      "unread": true,
      "content": "<p>zerobrew is a fast, experimental homebrew-compatible package manager.</p><p>It uses the Homebrew bottle ecosystem, is able to locally store a cache of packages, and is measured to be 5-20x faster than Homebrew. It is faster by being able to download and extract packages in parallel, uses APFS clonefiles (on macOS), which can copy packages by reference (copy on write) for zero disk overhead, and uses a SHA256 hashed content store. All of these performance enhancements means that re-installs are instant with zerobrew.</p><p>This tool also has a garbage collection command, which removes unreferenced data to reclaim space, and has commands like install, upgrade, uninstall, list, doctor and more commands which are the same commands as the original Homebrew.</p><p>This tool is ideal for those already familiar with Homebrew, but with the added benefit of being useful as a drop in alternative, and if you need fast installation and management of your Homebrew-installed tools.</p>",
      "contentLength": 960,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "jiq",
      "url": "https://terminaltrove.com/feed/jiq/",
      "date": 1770768000,
      "author": "Curator",
      "guid": 49301,
      "unread": true,
      "content": "<p>jiq is TUI for writing <a href=\"https://terminaltrove.com/jq/\" target=\"_blank\" rel=\"noopener\">jq</a> queries with live results while you type in the TUI.</p><p>It runs queries in real-time, suggests fields, functions, and has context aware autocomplete in the TUI. It has a snippet library for saved filters, shows function tooltips with examples, has searchable query history and it also has output search with highlighting.&nbsp;</p><p>It also has a system clipboard, mouse support, keybindings, syntax highlighting and has a JSON object statistics bar at the bottom of the TUI. This tool has an optional AI helper that displays query hints and is able to fix type errors.</p><p>jiq works best for developers, data analysts and those who work with anything that is JSON. It's useful if you need a tool with an interactive TUI to query data (e.g. API responses or JSON datasets) with helpful&nbsp;<a href=\"https://terminaltrove.com/jq/\" target=\"_blank\" rel=\"noopener\">jq</a>&nbsp;suggestions, UI feedback and optional AI assistance if you need it.&nbsp;</p>",
      "contentLength": 867,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    },
    {
      "title": "models",
      "url": "https://terminaltrove.com/feed/models/",
      "date": 1770768000,
      "author": "Curator",
      "guid": 49302,
      "unread": true,
      "content": "<p>models is a fast CLI and TUI for browsing LLM models and keeping tabs on coding agents from the terminal.</p><p>It uses data from models.dev, lists providers and models, plus filters providers by category and groups them for scanning. It supports cross provider search, prints context limits, pricing, and capability flags. It also copies model IDs or docs links, and can emit JSON for scripts.</p><p>For agents, it keeps a curated set of assistants, detects installed versions, and checks GitHub for stars, releases, changelogs, and update status. You can also pick which agents to track and add custom entries in a config file.</p><p>Designed for developers building with LLM APIs and those comparing model tradeoffs, models is useful when you need a fast answer about what a model supports and what it costs.</p>",
      "contentLength": 790,
      "flags": null,
      "enclosureUrl": "",
      "enclosureMime": "",
      "commentsUrl": null
    }
  ],
  "tags": []
}